{
  "name": "Drow",
  "description": "Drow are elves of the Underdark, known for their innate magic and superior darkvision.",
  "speed": 30,
  "traits": [
    {
      "name": "Superior Darkvision",
      "description": "Your darkvision has a radius of 120 feet."
    },
    {
      "name": "Fey Ancestry",
      "description": "You have advantage on saving throws you make to avoid or end the Charmed condition."
    },
    {
      "name": "Keen Senses",
      "description": "You have proficiency in the Insight, Perception, or Survival skill (choose one)."
    },
    {
      "name": "Trance",
      "description": "You don't need to sleep, and magic can't put you to sleep. You can finish a Long Rest in 4 hours of trancelike meditation."
    }
  ],
  "features": [
    {
      "name": "Drow Magic",
      "description": "You know the Dancing Lights cantrip. At 3rd level you can cast Faerie Fire once per long rest. At 5th level you can cast Darkness once per long rest. Intelligence, Wisdom, or Charisma is your spellcasting ability (choose when you select this lineage).",
      "spells": {
        "casting_ability": 5,
        "list": [
          {
            "name": "Dancing Lights",
            "level": 0,
            "description": "You create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration.",
            "sticky": true
          },
          {
            "name": "Faerie Fire",
            "level": 1,
            "description": "Objects and creatures in a 20-foot Cube within range are outlined in blue, green, or violet light. Creatures in the area must make a Dexterity save or have attack rolls against them gain Advantage. Once per Long Rest (racial).",
            "sticky": true,
            "min_level": 3
          },
          {
            "name": "Darkness",
            "level": 2,
            "description": "Magical darkness spreads from a point you choose within range to fill a 15-foot-radius Sphere for the duration. Darkvision can't see through it and nonmagical light can't illuminate it. Once per Long Rest (racial).",
            "sticky": true,
            "min_level": 5
          }
        ]
      }
    }
  ]
}
