{
  "name": "Tiefling (Abyssal)",
  "description": "Your fiendish legacy connects you to the Abyss, granting poison resistance and toxic spellcasting.",
  "speed": 30,
  "traits": [
    {
      "name": "Darkvision",
      "description": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light."
    },
    {
      "name": "Abyssal Resistance",
      "description": "You have resistance to Poison damage."
    }
  ],
  "features": [
    {
      "name": "Abyssal Legacy",
      "description": "You know the Thaumaturgy and Poison Spray cantrips. At 3rd level you can cast Ray of Sickness once per long rest. At 5th level you can cast Hold Person once per long rest. Intelligence, Wisdom, or Charisma is your spellcasting ability.",
      "spells": {
        "casting_ability": 5,
        "list": [
          {
            "name": "Thaumaturgy",
            "level": 0,
            "description": "You manifest a minor wonder, a sign of supernatural power: your voice booms, your eyes flash, flames flicker, or the ground trembles.",
            "sticky": true
          },
          {
            "name": "Poison Spray",
            "level": 0,
            "description": "You extend your hand toward a creature you can see within range and project a puff of noxious gas. The creature must succeed on a CON save or take 1d12 poison damage.",
            "sticky": true
          },
          {
            "name": "Ray of Sickness",
            "level": 1,
            "description": "A ray of sickening greenish energy lashes out toward a creature within range. Make a ranged spell attack. On a hit, the target takes 2d8 poison damage and must make a CON save or be Poisoned until the end of your next turn. Once per Long Rest (racial).",
            "sticky": true,
            "min_level": 3
          },
          {
            "name": "Hold Person",
            "level": 2,
            "description": "Choose a humanoid that you can see within range. The target must succeed on a WIS save or be Paralyzed for the duration. Once per Long Rest (racial).",
            "sticky": true,
            "min_level": 5
          }
        ]
      }
    }
  ]
}
