{
  "name": "High Elf",
  "description": "As a high elf, you have a keen mind and a mastery of at least the basics of magic.",
  "speed": 30,
  "traits": [
    {
      "name": "Darkvision",
      "description": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light."
    },
    {
      "name": "Fey Ancestry",
      "description": "You have advantage on saving throws you make to avoid or end the Charmed condition."
    },
    {
      "name": "Keen Senses",
      "description": "You have proficiency in the Insight, Perception, or Survival skill (choose one)."
    },
    {
      "name": "Trance",
      "description": "You don't need to sleep, and magic can't put you to sleep. You can finish a Long Rest in 4 hours of trancelike meditation."
    }
  ],
  "features": [
    {
      "name": "Elven Lineage",
      "description": "You know the Prestidigitation cantrip (replaceable with another Wizard cantrip after each Long Rest). At 3rd level you can cast Detect Magic once per long rest. At 5th level you can cast Misty Step once per long rest. Intelligence, Wisdom, or Charisma is your spellcasting ability (choose when you select this lineage).",
      "spells": [
        {
          "name": "Prestidigitation",
          "level": 0,
          "description": "A minor magical trick: create a sensory effect, light or snuff a flame, clean or soil an object, chill/warm/flavor material, create a symbol or trinket, or create an illusory image.",
          "sticky": true
        },
        {
          "name": "Detect Magic",
          "level": 1,
          "description": "For the duration, you sense the presence of magic within 30 feet of you. The spell can penetrate most barriers. Once per Long Rest (racial).",
          "sticky": true,
          "min_level": 3
        },
        {
          "name": "Misty Step",
          "level": 2,
          "description": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see. Once per Long Rest (racial).",
          "sticky": true,
          "min_level": 5
        }
      ]
    }
  ]
}
