{
  "name": "Artificer",
  "description": "A master of invention who uses ingenuity and magic to unlock extraordinary capabilities in objects.",
  "hit_die": 8,
  "casting_ability": "Intelligence",
  "proficiencies": [
    "LightArmor",
    "MediumArmor",
    "SimpleWeapons"
  ],
  "saving_throws": [
    "Constitution",
    "Intelligence"
  ],
  "features": [
    {
      "name": "Artificer Specialist",
      "description": "At 1st level, you choose the type of Artificer Specialist you are from the list of available specialisations. Your choice grants you features at 1st level and again at 3rd, 9th, 14th, and 17th level."
    },
    {
      "name": "Magic Item Analysis",
      "description": "Starting at 1st level, your understanding of magic items allows you to analyze and understand their secrets. You know the artificer spells detect magic and identify, and you can cast them as rituals. You don't need to provide a material component when casting identify with this class feature."
    },
    {
      "name": "Tool Expertise",
      "description": "Starting at 2nd level, your proficiency bonus is doubled for any ability check you make that uses any of the tool proficiencies you gain from this class."
    },
    {
      "name": "Wondrous Invention",
      "description": "At 2nd level, you gain the use of a magic item that you have crafted. Choose the item from the list of 2nd-level items below. Crafting an item is a difficult task. When you gain a magic item from this feature, it reflects long hours of study, tinkering, and experimentation that allowed you to finally complete the item."
    },
    {
      "name": "Masterwork Feature",
      "description": "At 3rd level, you gain a feature from your Artificer Specialist."
    },
    {
      "name": "Spellcasting",
      "description": "As part of your study of magic, you gain the ability to cast spells at 3rd level. The spells you learn are limited in scope, primarily concerned with modifying creatures and objects or creating items. Spell Slots: The Artificer table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher."
    },
    {
      "name": "Infuse Magic",
      "description": "Starting at 4th level, you gain the ability to channel your artificer spells into objects for later use. When you cast an artificer spell with a casting time of 1 action, you can increase its casting time to 1 minute. If you do so and hold a nonmagical item throughout the casting, you expend a spell slot, but none of the spell's effects occur."
    },
    {
      "name": "Ability Score Improvement",
      "description": "When you reach 4th, 8th, 12th, 16th, and 18th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
    },
    {
      "name": "Superior Attunement",
      "description": "At 5th level, your superior understanding of magic items allows you to master their use. You can now attune to up to four, rather than three, magic items at a time. At 15th level, this limit increases to five magic items."
    },
    {
      "name": "Mechanical Servant",
      "description": "At 6th level, your research and mastery of your craft allow you to produce a mechanical servant. The servant is a construct that obeys your commands without hesitation and functions in combat to protect you. Though magic fuels its creation, the servant is not magical itself."
    },
    {
      "name": "Soul of Artifice",
      "description": "At 20th level, your understanding of magic items is unmatched, allowing you to mingle your soul with items linked to you. You can attune to up to six magic items at once. In addition, you gain a +1 bonus to all saving throws per magic item you are currently attuned to."
    }
  ],
  "spells": [
    {
      "name": "Alarm",
      "level": 1,
      "description": "You set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won't set off the alarm. You also choose whether the alarm is mental or audible. A mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area."
    },
    {
      "name": "Cure Wounds",
      "level": 1,
      "description": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st."
    },
    {
      "name": "Disguise Self",
      "level": 1,
      "description": "You make yourself, including your clothing, armor, weapons, and other belongings on your person, look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The changes wrought by this spell fail to hold up to physical inspection."
    },
    {
      "name": "Expeditious Retreat",
      "level": 1,
      "description": "This spell allows you to move at an incredible pace. When you cast this spell, and then as a bonus action on each of your turns until the spell ends, you can take the Dash action."
    },
    {
      "name": "False Life",
      "level": 1,
      "description": "Bolstering yourself with a necromantic facsimile of life, you gain 1d4+4 temporary hit points for the duration. At Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, you gain 5 additional temporary hit points for each slot level above 1st."
    },
    {
      "name": "Jump",
      "level": 1,
      "description": "You touch a creature. The creature's jump distance is tripled until the spell ends."
    },
    {
      "name": "Longstrider",
      "level": 1,
      "description": "You touch a creature. The target's speed increases by 10 feet until the spell ends. At Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
    },
    {
      "name": "Sanctuary",
      "level": 1,
      "description": "You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball. If the warded creature makes an attack or casts a spell that affects an enemy creature, this spell ends."
    },
    {
      "name": "Shield of Faith",
      "level": 1,
      "description": "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration."
    },
    {
      "name": "Aid",
      "level": 2,
      "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration. At Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, a target's hit points increase by an additional 5 for each slot level above 2nd."
    },
    {
      "name": "Alter Self",
      "level": 2,
      "description": "You assume a different form. When you cast the spell, choose one of the following options, the effects of which last for the duration of the spell. While the spell lasts, you can end one option as an action to gain the benefits of a different one. Aquatic Adaptation: You adapt your body to an aquatic environment, sprouting gills, and growing webbing between your fingers. You can breathe underwater and gain a swimming speed equal to your walking speed."
    },
    {
      "name": "Arcane Lock",
      "level": 2,
      "description": "You touch a closed door, window, gate, chest, or other entryway, and it becomes locked for the duration. You and the creatures you designate when you cast this spell can open the object normally. You can also set a password that, when spoken within 5 feet of the object, suppresses this spell for 1 minute. Otherwise, it is impassable until it is broken or the spell is dispelled or suppressed. Casting knock on the object suppresses arcane lock for 10 minutes."
    },
    {
      "name": "Blur",
      "level": 2,
      "description": "Your body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn't rely on sight, as with blindsight, or can see through illusions, as with truesight."
    },
    {
      "name": "Continual Flame",
      "level": 2,
      "description": "A flame, equivalent in brightness to a torch, springs forth from an object that you touch. The effect looks like a regular flame, but it creates no heat and doesn't use oxygen. A continual flame can be covered or hidden but not smothered or quenched."
    },
    {
      "name": "Darkvision",
      "level": 2,
      "description": "You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 60 feet."
    },
    {
      "name": "Enhance Ability",
      "level": 2,
      "description": "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects; the target gains the effect until the spell ends. Bear's Endurance: The target has advantage on Constitution checks. It also gains 2d6 temporary hit points, which are lost when the spell ends. Bull's Strength: The target has advantage on Strength checks, and his or her carrying capacity doubles. Cat's Grace: The target has advantage on Dexterity checks."
    },
    {
      "name": "Enlarge/Reduce",
      "level": 2,
      "description": "You cause a creature or an object you can see within range to grow larger or smaller for the duration. Choose either a creature or an object that is neither worn nor carried. If the target is unwilling, it can make a Constitution saving throw. On a success, the spell has no effect. If the target is a creature, everything it is wearing and carrying changes size with it. Any item dropped by an affected creature returns to normal size at once. Enlarge."
    },
    {
      "name": "Invisibility",
      "level": 2,
      "description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for a target that attacks or casts a spell. At Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
    },
    {
      "name": "Lesser Restoration",
      "level": 2,
      "description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned."
    },
    {
      "name": "Magic Weapon",
      "level": 2,
      "description": "You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls. At Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the bonus increases to +2. When you use a spell slot of 6th level or higher, the bonus increases to +3."
    },
    {
      "name": "Protection from Poison",
      "level": 2,
      "description": "You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison afflicts the target, you neutralize one poison that you know is present, or you neutralize one at random. For the duration, the target has advantage on saving throws against being poisoned, and it has resistance to poison damage."
    },
    {
      "name": "Rope Trick",
      "level": 2,
      "description": "You touch a length of rope that is up to 60 feet long. One end of the rope then rises into the air until the whole rope hangs perpendicular to the ground. At the upper end of the rope, an invisible entrance opens to an extradimensional space that lasts until the spell ends. The extradimensional space can be reached by climbing to the top of the rope. The space can hold as many as eight Medium or smaller creatures."
    },
    {
      "name": "Spider Climb",
      "level": 2,
      "description": "Until the spell ends, one willing creature you touch gains the ability to move up, down, and across vertical surfaces and upside down along ceilings, while leaving its hands free. The target also gains a climbing speed equal to its walking speed."
    },
    {
      "name": "Blink",
      "level": 3,
      "description": "Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane (the spell fails and the casting is wasted if you were already on that plane). At the start of you next turn, and when the spell ends if you are on the Ethereal Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from."
    },
    {
      "name": "Fly",
      "level": 3,
      "description": "You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall. At Higher Levels: When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd."
    },
    {
      "name": "Gaseous Form",
      "level": 3,
      "description": "You transform a willing creature you touch, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn't affected. While in this form, the target's only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target has resistance to nonmagical damage, and it has advantage on Strength, Dexterity, and Constitution saving throws."
    },
    {
      "name": "Glyph of Warding",
      "level": 3,
      "description": "When you cast this spell, you inscribe a glyph that affects other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. The glyph can cover an area no larger than 10 feet in diameter. If the surface or object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered."
    },
    {
      "name": "Haste",
      "level": 3,
      "description": "Choose a willing creature that you can see within range. Until the spell ends, the target's speed is doubled, it gains a +2 bonus to AC, it has advantage on Dexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action. When the spell ends, the target can't move or take actions until after its next turn, as a wave of lethargy sweeps over it."
    },
    {
      "name": "Protection from Energy",
      "level": 3,
      "description": "For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder."
    },
    {
      "name": "Revivify",
      "level": 3,
      "description": "You touch a creature that has died within the last minute. That creature returns to life with 1 hit point. This spell can't return to life a creature that has died of old age, nor can it restore any missing body parts."
    },
    {
      "name": "Water Breathing",
      "level": 3,
      "description": "This spell grants up to ten willing creatures you can see within range the ability to breathe underwater until the spell ends. Affected creatures also retain their normal mode of respiration."
    },
    {
      "name": "Water Walk",
      "level": 3,
      "description": "This spell grants the ability to move across any liquid surface—such as water, acid, mud, snow, quicksand, or lava—as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration. If your target a creature submerged in a liquid, the spell carries the target to the surface of the liquid at a rate of 60 feet per round."
    },
    {
      "name": "Arcane Eye",
      "level": 4,
      "description": "You create an invisible, magical eye within range that hovers in the air for the duration. You mentally receive visual information from the eye, which has normal vision and darkvision out to 30 feet. The eye can look in every direction. As an action, you can move the eye up to 30 feet in any direction. There is no limit to how far away from you the eye can move, but it can't enter another plane of existence."
    },
    {
      "name": "Death Ward",
      "level": 4,
      "description": "You touch a creature and grant it a measure of protection from death. The first time the target would drop to 0 hit points as a result of taking damage, the target instead drops to 1 hit point, and the spell ends. If the spell is still in effect when the target is subjected to an effect that would kill it instantaneously without dealing damage, that effect is instead negated against the target, and the spells ends."
    },
    {
      "name": "Fabricate",
      "level": 4,
      "description": "You convert raw materials into products of the same material. For example, you can fabricate a wooden bridge from a clump of trees, a rope from a patch of hemp, and clothes from flax or wool. Choose raw materials that you can see within range. You can fabricate a Large or smaller object (contained within a 10-foot cube, or eight connected 5-foot cubes), given a sufficient quantity of raw material."
    },
    {
      "name": "Freedom of Movement",
      "level": 4,
      "description": "You touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained. The target can also spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature that has it grappled. Finally, being underwater imposes no penalties on the target's movement or attacks."
    },
    {
      "name": "Leomund's Secret Chest",
      "level": 4,
      "description": "You hide a chest, and all its contents, on the Ethereal Plane. You must touch the chest and the miniature replica that serves as a material component for the spell. The chest can contain up to 12 cubic feet of nonliving material (3 feet by 2 feet by 2 feet). While the chest remains on the Ethereal Plane, you can use an action and touch the replica to recall the chest. It appears in an unoccupied space on the ground within 5 feet of you."
    },
    {
      "name": "Mordenkainen's Faithful Hound",
      "level": 4,
      "description": "You conjure a phantom watchdog in an unoccupied space that you can see within range, where it remains for the duration, until you dismiss it as an action, or until you move more than 100 feet away from it. The hound is invisible to all creatures except you and can't be harmed. When a Small or larger creature comes within 30 feet of it without first speaking the password that you specify when you cast this spell, the hound starts barking loudly."
    },
    {
      "name": "Mordenkainen's Private Sanctum",
      "level": 4,
      "description": "You make an area within range magically secure. The area is a cube that can be as small as 5 feet to as large as 100 feet on each side. The spell lasts for the duration or until you use an action to dismiss it. When you cast the spell, you decide what sort of security the spell provides, choosing any or all of the following properties. - Sound can't pass through the barrier at the edge of the warded area."
    },
    {
      "name": "Otiluke's Resilient Sphere",
      "level": 4,
      "description": "A sphere of shimmering force encloses a creature or object of Large size or smaller within range. An unwilling creature must make a Dexterity saving throw. On a failed save, the creature is enclosed for the duration. Nothing, not physical objects, energy, or other spell effects, can pass through the barrier, in or out, though a creature in the sphere can breathe there."
    },
    {
      "name": "Stone Shape",
      "level": 4,
      "description": "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose. So, for example, you could shape a large rock into a weapon, idol, or coffer, or make a small passage through a wall, as long as the wall is less than 5 feet thick. You could also shape a stone door or its frame to seal the door shut."
    },
    {
      "name": "Stoneskin",
      "level": 4,
      "description": "This spell turns the flesh of a willing creature you touch as hard as stone. Until the spell ends, the target has resistance to nonmagical bludgeoning, piercing, and slashing damage."
    }
  ],
  "levels": [
    {
      "features": [
        "Artificer Specialist",
        "Magic Item Analysis"
      ]
    },
    {
      "features": [
        "Tool Expertise",
        "Wondrous Invention"
      ]
    },
    {
      "features": [
        "Masterwork Feature",
        "Spellcasting"
      ],
      "spell_slots": [
        2
      ],
      "spells_known": 3
    },
    {
      "features": [
        "Infuse Magic",
        "Ability Score Improvement"
      ],
      "spell_slots": [
        3
      ],
      "spells_known": 4
    },
    {
      "features": [
        "Superior Attunement",
        "Wondrous Invention"
      ],
      "spell_slots": [
        3
      ],
      "spells_known": 4
    },
    {
      "features": [
        "Mechanical Servant"
      ],
      "spell_slots": [
        3
      ],
      "spells_known": 4
    },
    {
      "features": [],
      "spell_slots": [
        4,
        2
      ],
      "spells_known": 5
    },
    {
      "features": [
        "Ability Score Improvement"
      ],
      "spell_slots": [
        4,
        2
      ],
      "spells_known": 6
    },
    {
      "features": [
        "Masterwork Feature"
      ],
      "spell_slots": [
        4,
        2
      ],
      "spells_known": 6
    },
    {
      "features": [
        "Wondrous Invention"
      ],
      "spell_slots": [
        4,
        3
      ],
      "spells_known": 7
    },
    {
      "features": [],
      "spell_slots": [
        4,
        3
      ],
      "spells_known": 8
    },
    {
      "features": [
        "Ability Score Improvement"
      ],
      "spell_slots": [
        4,
        3
      ],
      "spells_known": 8
    },
    {
      "features": [],
      "spell_slots": [
        4,
        3,
        2
      ],
      "spells_known": 9
    },
    {
      "features": [
        "Masterwork Feature"
      ],
      "spell_slots": [
        4,
        3,
        2
      ],
      "spells_known": 10
    },
    {
      "features": [
        "Superior Attunement",
        "Wondrous Invention"
      ],
      "spell_slots": [
        4,
        3,
        2
      ],
      "spells_known": 10
    },
    {
      "features": [
        "Ability Score Improvement"
      ],
      "spell_slots": [
        4,
        3,
        3
      ],
      "spells_known": 11
    },
    {
      "features": [
        "Masterwork Feature"
      ],
      "spell_slots": [
        4,
        3,
        3
      ],
      "spells_known": 11
    },
    {
      "features": [
        "Ability Score Improvement"
      ],
      "spell_slots": [
        4,
        3,
        3
      ],
      "spells_known": 11
    },
    {
      "features": [],
      "spell_slots": [
        4,
        3,
        3,
        1
      ],
      "spells_known": 12
    },
    {
      "features": [
        "Soul of Artifice"
      ],
      "spell_slots": [
        4,
        3,
        3,
        1
      ],
      "spells_known": 13
    }
  ]
}