{
  "name": "Barbarian",
  "description": "A fierce warrior who can enter a battle rage.",
  "hit_die": 12,
  "casting_ability": null,
  "proficiencies": [
    "LightArmor",
    "MediumArmor",
    "Shields",
    "SimpleWeapons",
    "MartialWeapons"
  ],
  "saving_throws": [
    "Strength",
    "Constitution"
  ],
  "features": [
    {
      "name": "Rage",
      "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain the following benefits if you aren't wearing heavy armor: - You have advantage on Strength checks and Strength saving throws. - When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level."
    },
    {
      "name": "Unarmored Defense",
      "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
    },
    {
      "name": "Danger Sense",
      "description": "At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated."
    },
    {
      "name": "Reckless Attack",
      "description": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
    },
    {
      "name": "Primal Path",
      "description": "At 3rd level, you choose a path that shapes the nature of your rage from the list of available paths. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
    },
    {
      "name": "Ability Score Improvement",
      "description": "When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. If your DM allows the use of feats, you may instead take a feat."
    },
    {
      "name": "Extra Attack",
      "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
    },
    {
      "name": "Fast Movement",
      "description": "Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor."
    },
    {
      "name": "Path Feature",
      "description": "At 6th level, you gain a feature from your Primal Path."
    },
    {
      "name": "Feral Instinct",
      "description": "By 7th level, your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
    },
    {
      "name": "Brutal Critical (1 die)",
      "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. This increases to two additional dice at 13th level and three additional dice at 17th level."
    },
    {
      "name": "Path feature",
      "description": "At 10th level, you gain a feature from your Primal Path."
    },
    {
      "name": "Relentless Rage",
      "description": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
    },
    {
      "name": "Brutal Critical (2 dice)",
      "description": "You now roll two additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
    },
    {
      "name": "Persistent Rage",
      "description": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
    },
    {
      "name": "Brutal Critical (3 dice)",
      "description": "You now roll three additional weapon damage dice when determining the extra damage for a critical hit with a melee attack."
    },
    {
      "name": "Indomitable Might",
      "description": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
    },
    {
      "name": "Primal Champion",
      "description": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
    }
  ],
  "spells": [],
  "levels": [
    {
      "features": [
        "Rage",
        "Unarmored Defense"
      ]
    },
    {
      "features": [
        "Danger Sense",
        "Reckless Attack"
      ]
    },
    {
      "features": [
        "Primal Path"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Extra Attack",
        "Fast Movement"
      ]
    },
    {
      "features": [
        "Path Feature"
      ]
    },
    {
      "features": [
        "Feral Instinct"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Brutal Critical (1 die)"
      ]
    },
    {
      "features": [
        "Path feature"
      ]
    },
    {
      "features": [
        "Relentless Rage"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Brutal Critical (2 dice)"
      ]
    },
    {
      "features": [
        "Path feature"
      ]
    },
    {
      "features": [
        "Persistent Rage"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Brutal Critical (3 dice)"
      ]
    },
    {
      "features": [
        "Indomitable Might"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Primal Champion"
      ]
    }
  ]
}