{
  "name": "Cleric",
  "description": "A priestly champion who wields divine magic in service of a higher power.",
  "hit_die": 8,
  "casting_ability": "Wisdom",
  "proficiencies": [
    "LightArmor",
    "MediumArmor",
    "Shields",
    "SimpleWeapons"
  ],
  "saving_throws": [
    "Wisdom",
    "Charisma"
  ],
  "features": [
    {
      "name": "Divine Order",
      "description": "You have dedicated yourself to one of the following sacred roles of your choice."
    },
    {
      "name": "Protector",
      "description": "Trained for battle, you gain proficiency with Martial weapons and training with Heavy armor."
    },
    {
      "name": "Spellcasting",
      "description": "You have learned to cast spells through prayer and meditation. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Cleric spells, which appear on the Cleric spell list later in the class's description. Cantrips: You know three cantrips of your choice from the Cleric spell list. Guidance, Sacred Flame, and Thaumaturgy are recommended."
    },
    {
      "name": "Thaumaturge",
      "description": "You know one extra cantrip from the Cleric spell list. In addition, your mystical connection to the divine gives you a bonus to your Intelligence (Arcana or Religion) checks. The bonus equals your Wisdom modifier (minimum of +1)."
    },
    {
      "name": "Channel Divinity",
      "description": "You can channel divine energy directly from the Outer Planes to fuel magical effects. You start with two such effects: Divine Spark and Turn Undead, each of which is described below. Each time you use this class's Channel Divinity, choose which Channel Divinity effect from this class to create. You gain additional effect options at higher Cleric levels."
    },
    {
      "name": "Divine Spark",
      "description": "As a Magic action, you point your Holy Symbol at another creature you can see within 30 feet of yourself and focus divine energy at it. Roll 1d8 and add your Wisdom modifier. You either restore Hit Points to the creature equal to that total or force the creature to make a Constitution saving throw. On a failed save, the creature takes Necrotic or Radiant damage (your choice) equal to that total."
    },
    {
      "name": "Turn Undead",
      "description": "As a Magic action, you present your Holy Symbol and censure Undead creatures. Each Undead of your choice within 30 feet of you must make a Wisdom saving throw. If the creature fails its save, it has the Frightened and Incapacitated conditions for 1 minute. For that duration, it tries to move as far from you as it can on its turns."
    },
    {
      "name": "Cleric Subclass",
      "description": "You gain a Cleric subclass of your choice. A subclass is a specialization that grants you features at certain Cleric levels. For the rest of your career, you gain each of your subclass's features that are of your Cleric level or lower."
    },
    {
      "name": "Ability Score Improvement",
      "description": "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Cleric levels 8, 12, and 16."
    },
    {
      "name": "Sear Undead",
      "description": "Whenever you use Turn Undead, you can roll a number of d8s equal to your Wisdom modifier (minimum of 1d8) and add the rolls together. Each Undead that fails its saving throw against that use of Turn Undead takes Radiant damage equal to the roll's total. This damage doesn't end the turn effect."
    },
    {
      "name": "Subclass Feature",
      "description": "You gain a feature from your Cleric Subclass."
    },
    {
      "name": "Blessed Strikes",
      "description": "Divine power infuses you in battle. You gain one of the following options of your choice (if you get either option from a Cleric subclass in an older book, use only the option you choose for this feature)."
    },
    {
      "name": "Divine Strike",
      "description": "Once on each of your turns when you hit a creature with an attack roll using a weapon, you can cause the target to take an extra 1d8 Necrotic or Radiant damage (your choice)."
    },
    {
      "name": "Potent Spellcasting",
      "description": "Add your Wisdom modifier to the damage you deal with any Cleric cantrip."
    },
    {
      "name": "Divine Intervention",
      "description": "You can call on your deity or pantheon to intervene on your behalf. As a Magic action, choose any Cleric spell of level 5 or lower that doesn't require a Reaction to cast. As part of the same action, you cast that spell without expending a spell slot or needing Material components. You can't use this feature again until you finish a Long Rest."
    },
    {
      "name": "Improved Blessed Strikes",
      "description": "The option you chose for Blessed Strikes grows more powerful. Divine Strike: The extra damage of your Divine Strike increases to 2d8. Potent Spellcasting: When you cast a Cleric cantrip and deal damage to a creature with it, you can give vitality to yourself or another creature within 60 feet of yourself, granting a number of Temporary Hit Points equal to twice your Wisdom modifier."
    },
    {
      "name": "Epic Boon",
      "description": "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Fate is recommended."
    },
    {
      "name": "Greater Divine Intervention",
      "description": "You can call on even more powerful divine intervention. When you use your Divine Intervention feature, you can choose Wish when you select a spell. If you do so, you can't use Divine Intervention again until you finish 2d4 Long Rests."
    }
  ],
  "spells": [
    {
      "name": "Guidance",
      "level": 0,
      "description": "You touch a willing creature and choose a skill. Until the spell ends, the creature adds 1d4 to any ability check using the chosen skill."
    },
    {
      "name": "Light",
      "level": 0,
      "description": "You touch one Large or smaller object that isn't being worn or carried by someone else. Until the spell ends, the object sheds Bright Light in a 20-foot radius and Dim Light for an additional 20 feet. The light can be colored as you like. Covering the object with something opaque blocks the light. The spell ends if you cast it again."
    },
    {
      "name": "Mending",
      "level": 0,
      "description": "This spell repairs a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage. This spell can physically repair a magic item, but it can't restore magic to such an object."
    },
    {
      "name": "Resistance",
      "level": 0,
      "description": "You touch a willing creature and choose a damage type: Acid, Bludgeoning, Cold, Fire, Lightning, Necrotic, Piercing, Poison, Radiant, Slashing, or Thunder. When the creature takes damage of the chosen type before the spell ends, the creature reduces the total damage taken by 1d4. A creature can benefit from this spell only once per turn."
    },
    {
      "name": "Sacred Flame",
      "level": 0,
      "description": "Flame-like radiance descends on a creature that you can see within range. The target must succeed on a Dexterity saving throw or take 1d8 Radiant damage. The target gains no benefit from Half Cover or Three-Quarters Cover for this save. Cantrip Upgrade: The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8)."
    },
    {
      "name": "Spare the Dying",
      "level": 0,
      "description": "Choose a creature within range that has 0 Hit Points and isn't dead. The creature becomes Stable. Cantrip Upgrade: The range doubles when you reach levels 5 (30 feet), 11 (60 feet), and 17 (120 feet)."
    },
    {
      "name": "Thaumaturgy",
      "level": 0,
      "description": "You manifest a minor wonder within range. You create one of the effects below within range. If you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time. Altered Eyes: You alter the appearance of your eyes for 1 minute. Booming Voice: Your voice booms up to three times as loud as normal for 1 minute. For the duration, you have Advantage on Charisma (Intimidation) checks."
    },
    {
      "name": "Toll the Dead",
      "level": 0,
      "description": "You point at one creature you can see within range, and the single chime of a dolorous bell is audible within 10 feet of the target. The target must succeed on a Wisdom saving throw or take 1d8 Necrotic damage. If the target is missing any of its Hit Points, it instead takes 1d12 Necrotic damage. Cantrip Upgrade: The damage increases by one die when you reach levels 5 (2d8 or 2d12), 11 (3d8 or 3d12), and 17 (4d8 or 4d12)."
    },
    {
      "name": "Word of Radiance",
      "level": 0,
      "description": "Burning radiance erupts from you in a 5-foot Emanation [Area of Effect]. Each creature of your choice that you can see in it must succeed on a Constitution saving throw or take 1d6 Radiant damage. Cantrip Upgrade: The damage increases by 1d6 when you reach levels 5 (2d6), 11 (3d6), and 17 (4d6)."
    },
    {
      "name": "Bane",
      "level": 1,
      "description": "Up to three creatures of your choice that you can see within range must each make a Charisma saving throw. Whenever a target that fails this save makes an attack roll or a saving throw before the spell ends, the target must subtract 1d4 from the attack roll or save. Using a Higher-Level Spell Slot: You can target one additional creature for each spell slot level above 1."
    },
    {
      "name": "Bless",
      "level": 1,
      "description": "You bless up to three creatures within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target adds 1d4 to the attack roll or save. Using a Higher-Level Spell Slot: You can target one additional creature for each spell slot level above 1."
    },
    {
      "name": "Command",
      "level": 1,
      "description": "You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. Choose the command from these options: Approach: The target moves toward you by the shortest and most direct route, ending its turn if it moves within 5 feet of you. Drop: The target drops whatever it is holding and then ends its turn. Flee: The target spends its turn moving away from you by the fastest available means."
    },
    {
      "name": "Create or Destroy Water",
      "level": 1,
      "description": "You do one of the following: Create Water: You create up to 10 gallons of clean water within range in an open container. Alternatively, the water falls as rain in a 30-foot Cube [Area of Effect] within range, extinguishing exposed flames there. Destroy Water: You destroy up to 10 gallons of water in an open container within range. Alternatively, you destroy fog in a 30-foot Cube [Area of Effect] within range."
    },
    {
      "name": "Cure Wounds",
      "level": 1,
      "description": "A creature you touch regains a number of Hit Points equal to 2d8 plus your spellcasting ability modifier. Using a Higher-Level Spell Slot: The healing increases by 2d8 for each spell slot level above 1."
    },
    {
      "name": "Detect Evil and Good",
      "level": 1,
      "description": "For the duration, you sense the location of any Aberration, Celestial, Elemental, Fey, Fiend, or Undead within 30 feet of yourself. You also sense whether the Hallow spell is active there and, if so, where. The spell is blocked by 1 foot of stone, dirt, or wood; 1 inch of metal; or a thin sheet of lead."
    },
    {
      "name": "Detect Magic",
      "level": 1,
      "description": "For the duration, you sense the presence of magical effects within 30 feet of yourself. If you sense such effects, you can take the Magic action to see a faint aura around any visible creature or object in the area that bears the magic, and if an effect was created by a spell, you learn the spell's school of magic. The spell is blocked by 1 foot of stone, dirt, or wood; 1 inch of metal; or a thin sheet of lead."
    },
    {
      "name": "Detect Poison and Disease",
      "level": 1,
      "description": "For the duration, you sense the location of poisons, poisonous or venomous creatures, and magical contagions within 30 feet of yourself. You sense the kind of poison, creature, or contagion in each case. The spell is blocked by 1 foot of stone, dirt, or wood; 1 inch of metal; or a thin sheet of lead."
    },
    {
      "name": "Guiding Bolt",
      "level": 1,
      "description": "You hurl a bolt of light toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 4d6 Radiant damage, and the next attack roll made against it before the end of your next turn has Advantage. Using a Higher-Level Spell Slot: The damage increases by 4d6 for each spell slot level above 1."
    },
    {
      "name": "Healing Word",
      "level": 1,
      "description": "A creature of your choice that you can see within range regains Hit Points equal to 2d4 plus your spellcasting ability modifier. Using a Higher-Level Spell Slot: The healing increases by 2d4 for each spell slot level above 1."
    },
    {
      "name": "Inflict Wounds",
      "level": 1,
      "description": "A creature you touch makes a Constitution saving throw, taking 2d10 Necrotic damage on a failed save or half as much damage on a successful one. Using a Higher-Level Spell Slot: The damage increases by 2d10 for each spell slot level above 1."
    },
    {
      "name": "Protection from Evil and Good",
      "level": 1,
      "description": "Until the spell ends, one willing creature you touch is protected against creatures that are Aberrations, Celestials, Elementals, Fey, Fiends, or Undead. The protection grants several benefits. Creatures of those types have Disadvantage on attack rolls against the target. The target also can't be possessed by or gain the Charmed or Frightened conditions from them."
    },
    {
      "name": "Purify Food and Drink",
      "level": 1,
      "description": "You remove poison and rot from nonmagical food and drink in a 5-foot-radius Sphere [Area of Effect] centered on a point within range."
    },
    {
      "name": "Sanctuary",
      "level": 1,
      "description": "You ward a creature within range. Until the spell ends, any creature who targets the warded creature with an attack roll or a damaging spell must succeed on a Wisdom saving throw or either choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from areas of effect. The spell ends if the warded creature makes an attack roll, casts a spell, or deals damage."
    },
    {
      "name": "Shield of Faith",
      "level": 1,
      "description": "A shimmering field surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration."
    },
    {
      "name": "Wardaway",
      "level": 1,
      "description": "You hurl a disorienting magical force toward one creature within range. The target makes a Constitution saving throw; Constructs and Undead automatically succeed on this save. On a failed save, the target takes 2d4 Force damage, its Speed is halved until the start of your next turn, and on its next turn, it can take only an action or a Bonus Action (but not both). On a successful save, the target takes half as much damage only."
    },
    {
      "name": "Aid",
      "level": 2,
      "description": "Choose up to three creatures within range. Each target's Hit Points maximum and current Hit Points increase by 5 for the duration. Using a Higher-Level Spell Slot: Each target's Hit Points increase by 5 for each spell slot level above 2."
    },
    {
      "name": "Augury",
      "level": 2,
      "description": "You receive an omen from an otherworldly entity about the results of a course of action that you plan to take within the next 30 minutes. The DM chooses the omen from the Omens table. The spell doesn't account for circumstances, such as other spells, that might change the results. If you cast the spell more than once before finishing a Long Rest, there is a cumulative 25 chance for each casting after the first that you get no answer."
    },
    {
      "name": "Blindness/Deafness",
      "level": 2,
      "description": "One creature that you can see within range must succeed on a Constitution saving throw, or it has the Blinded or Deafened condition (your choice) for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success. Using a Higher-Level Spell Slot: You can target one additional creature for each spell slot level above 2."
    },
    {
      "name": "Borrowed Knowledge",
      "level": 2,
      "description": "You draw on knowledge from spirits of the past. Choose one skill in which you lack proficiency. For the spell's duration, you have proficiency in the chosen skill. The spell ends early if you cast it again."
    },
    {
      "name": "Calm Emotions",
      "level": 2,
      "description": "Each Humanoid in a 20-foot-radius Sphere [Area of Effect] centered on a point you choose within range must succeed on a Charisma saving throw or be affected by one of the following effects (choose for each creature): The creature has Immunity to the Charmed and Frightened conditions until the spell ends. If the creature was already Charmed or Frightened, those conditions are suppressed for the duration."
    },
    {
      "name": "Continual Flame",
      "level": 2,
      "description": "A flame springs from an object that you touch. The effect casts Bright Light in a 20-foot radius and Dim Light for an additional 20 feet. It looks like a regular flame, but it creates no heat and consumes no fuel. The flame can be covered or hidden but not smothered or quenched."
    },
    {
      "name": "Deryan's Helpful Homunculi",
      "level": 2,
      "description": "You summon a group of helpful spirits, which lasts for the duration. The spirits appear as homunculi or as another Construct of your choice but are intangible and invulnerable, and they are considered to have proficiency in the Arcana skill and with the set of Artisan's Tools used in the spell's casting. If you are crafting an item, the spirits function as a single assistant for your crafting, halving the crafting time."
    },
    {
      "name": "Enhance Ability",
      "level": 2,
      "description": "You touch a creature and choose Strength, Dexterity, Intelligence, Wisdom, or Charisma. For the duration, the target has Advantage on ability checks using the chosen ability. Using a Higher-Level Spell Slot: You can target one additional creature for each spell slot level above 2. You can choose a different ability for each target."
    },
    {
      "name": "Find Traps",
      "level": 2,
      "description": "You sense any trap within range that is within line of sight. A trap, for the purpose of this spell, includes any object or mechanism that was created to cause damage or other danger. Thus, the spell would sense the Alarm or Glyph of Warding spell or a mechanical pit trap, but it wouldn't reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole. This spell reveals that a trap is present but not its location."
    },
    {
      "name": "Gentle Repose",
      "level": 2,
      "description": "You touch a corpse or other remains. For the duration, the target is protected from decay and can't become Undead. The spell also effectively extends the time limit on raising the target from the dead, since days spent under the influence of this spell don't count against the time limit of spells such as Raise Dead."
    },
    {
      "name": "Hold Person",
      "level": 2,
      "description": "Choose a Humanoid that you can see within range. The target must succeed on a Wisdom saving throw or have the Paralyzed condition for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success. Using a Higher-Level Spell Slot: You can target one additional Humanoid for each spell slot level above 2."
    },
    {
      "name": "Lesser Restoration",
      "level": 2,
      "description": "You touch a creature and end one condition on it: Blinded, Deafened, Paralyzed, or Poisoned."
    },
    {
      "name": "Locate Object",
      "level": 2,
      "description": "Describe or name an object that is familiar to you. You sense the direction to the object's location if that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement. The spell can locate a specific object known to you if you have seen it up close—within 30 feet—at least once. Alternatively, the spell can locate the nearest object of a particular kind, such as a certain kind of apparel, jewelry, furniture, tool, or weapon."
    },
    {
      "name": "Prayer of Healing",
      "level": 2,
      "description": "Up to five creatures of your choice who remain within range for the spell's entire casting gain the benefits of a Short Rest and also regain 2d8 Hit Points. A creature can't be affected by this spell again until that creature finishes a Long Rest. Using a Higher-Level Spell Slot: The healing increases by 2d8 for each spell slot level above 2."
    },
    {
      "name": "Protection from Poison",
      "level": 2,
      "description": "You touch a creature and end the Poisoned condition on it. For the duration, the target has Advantage on saving throws to avoid or end the Poisoned condition, and it has Resistance to Poison damage."
    },
    {
      "name": "Silence",
      "level": 2,
      "description": "For the duration, no sound can be created within or pass through a 20-foot-radius Sphere [Area of Effect] centered on a point you choose within range. Any creature or object entirely inside the Sphere [Area of Effect] has Immunity to Thunder damage, and creatures have the Deafened condition while entirely inside it. Casting a spell that includes a Verbal component is impossible there."
    },
    {
      "name": "Spiritual Weapon",
      "level": 2,
      "description": "You create a floating, spectral force that resembles a weapon of your choice and lasts for the duration. The force appears within range in a space of your choice, and you can immediately make one melee spell attack against one creature within 5 feet of the force. On a hit, the target takes Force damage equal to 1d8 plus your spellcasting ability modifier. As a Bonus Action on your later turns, you can move the force up to 20 feet and repeat the attack against a creature within 5 feet of it."
    },
    {
      "name": "Warding Bond",
      "level": 2,
      "description": "You touch another creature that is willing and create a mystic connection between you and the target until the spell ends. While the target is within 60 feet of you, it gains a +1 bonus to AC and saving throws, and it has Resistance to all damage. Also, each time it takes damage, you take the same amount of damage. The spell ends if you drop to 0 Hit Points or if you and the target become separated by more than 60 feet."
    },
    {
      "name": "Zone of Truth",
      "level": 2,
      "description": "You create a magical zone that guards against deception in a 15-foot-radius Sphere [Area of Effect] centered on a point within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there makes a Charisma saving throw. On a failed save, a creature can't speak a deliberate lie while in the radius. You know whether a creature succeeds or fails on this save."
    },
    {
      "name": "Animate Dead",
      "level": 3,
      "description": "Choose a pile of bones or a corpse of a Medium or Small Humanoid within range. The target becomes an Undead creature: a Skeleton if you chose bones or a Zombie if you chose a corpse. On each of your turns, you can take a Bonus Action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any of them at the same time, issuing the same command to each one)."
    },
    {
      "name": "Aura of Vitality",
      "level": 3,
      "description": "An aura radiates from you in a 30-foot Emanation [Area of Effect] for the duration. When you create the aura and at the start of each of your turns while it persists, you can restore 2d6 Hit Points to one creature in it."
    },
    {
      "name": "Beacon of Hope",
      "level": 3,
      "description": "Choose any number of creatures within range. For the duration, each target has Advantage on Wisdom saving throws and Death Saving Throw and regains the maximum number of Hit Points possible from any healing."
    },
    {
      "name": "Bestow Curse",
      "level": 3,
      "description": "You touch a creature, which must succeed on a Wisdom saving throw or become cursed for the duration. Until the curse ends, the target suffers one of the following effects of your choice: Choose one ability. The target has Disadvantage on ability checks and saving throws made with that ability. The target has Disadvantage on attack rolls against you. In combat, the target must succeed on a Wisdom saving throw at the start of each of its turns or be forced to take the Dodge action on that turn."
    },
    {
      "name": "Clairvoyance",
      "level": 3,
      "description": "You create an Invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The intangible, invulnerable sensor remains in place for the duration. When you cast the spell, choose seeing or hearing. You can use the chosen sense through the sensor as if you were in its space. As a Bonus Action, you can switch between seeing and hearing."
    },
    {
      "name": "Create Food and Water",
      "level": 3,
      "description": "You create 45 pounds of food and 30 gallons of fresh water on the ground or in containers within range—both useful in fending off the hazards of malnutrition and dehydration. The food is bland but nourishing and looks like a food of your choice, and the water is clean. The food spoils after 24 hours if uneaten."
    },
    {
      "name": "Daylight",
      "level": 3,
      "description": "For the duration, sunlight spreads from a point within range and fills a 60-foot-radius Sphere [Area of Effect]. The sunlight's area is Bright Light and sheds Dim Light for an additional 60 feet. Alternatively, you cast the spell on an object that isn't being worn or carried, causing the sunlight to fill a 60-foot Emanation [Area of Effect] originating from that object. Covering that object with something opaque, such as a bowl or helm, blocks the sunlight."
    },
    {
      "name": "Dispel Magic",
      "level": 3,
      "description": "Choose one creature, object, or magical effect within range. Any ongoing spell of level 3 or lower on the target ends. For each ongoing spell of level 4 or higher on the target, make an ability check using your spellcasting ability (10 plus that spell's level). On a successful check, the spell ends. Using a Higher-Level Spell Slot: You automatically end a spell on the target if the spell's level is equal to or less than the level of the spell slot you use."
    },
    {
      "name": "Fast Friends",
      "level": 3,
      "description": "When you need to make sure something gets done, you can't rely on vague promises, sworn oaths, or binding contracts of employment. When you cast this spell, choose one humanoid within range that can see and hear you, and that can understand you. The creature must succeed on a Wisdom saving throw or become charmed by you for the duration. While the creature is charmed in this way, it undertakes to perform any services or activities you ask of it in a friendly manner, to the best of its ability."
    },
    {
      "name": "Feign Death",
      "level": 3,
      "description": "You touch a willing creature and put it into a cataleptic state that is indistinguishable from death. For the duration, the target appears dead to outward inspection and to spells used to determine the target's status. The target has the Blinded and Incapacitated conditions, and its Speed is 0. The target also has Resistance to all damage except Psychic damage, and it has Immunity to the Poisoned condition."
    },
    {
      "name": "Glyph of Warding",
      "level": 3,
      "description": "You inscribe a glyph that later unleashes a magical effect. You inscribe it either on a surface (such as a table or a section of floor) or within an object that can be closed (such as a book or chest) to conceal the glyph. The glyph can cover an area no larger than 10 feet in diameter. If the surface or object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered."
    },
    {
      "name": "Incite Greed",
      "level": 3,
      "description": "When you cast this spell, you present the gem used as the material component and choose any number of creatures within range that can see you. Each target must succeed on a Wisdom saving throw or be charmed by you until the spell ends, or until you or your companions do anything harmful to it. While charmed in this way, a creature can do nothing but use its movement to approach you in a safe manner."
    },
    {
      "name": "Laeral's Silver Lance",
      "level": 3,
      "description": "Silver energy bursts out from you in a 120-foot-long, 5-foot-wide Line [Area of Effect]. Each creature of your choice in the Line [Area of Effect] makes a Strength saving throw. On a failed save, a creature takes 3d10 Force damage and has the Prone condition. On a successful save, a creature takes half as much damage only. Using a Higher-Level Spell Slot: The damage increases by 3d10 for every spell slot level above 3."
    },
    {
      "name": "Linked Glyphs",
      "level": 3,
      "description": "When you cast this spell, you inscribe a detection glyph that later activates a magical effect at the site of a separate, linked glyph. You inscribe the detection glyph either on a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. The glyph can cover an area no larger than 10 feet in diameter."
    },
    {
      "name": "Magic Circle",
      "level": 3,
      "description": "You create a 10-foot-radius, 20-foot-tall Cylinder [Area of Effect] of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the Cylinder [Area of Effect] intersects with the floor or other surface. Choose one or more of the following types of creatures: Celestials, Elementals, Fey, Fiends, or Undead."
    },
    {
      "name": "Mass Healing Word",
      "level": 3,
      "description": "Up to six creatures of your choice that you can see within range regain Hit Points equal to 2d4 plus your spellcasting ability modifier. Using a Higher-Level Spell Slot: The healing increases by 2d4 for each spell slot level above 3."
    },
    {
      "name": "Meld into Stone",
      "level": 3,
      "description": "You step into a stone object or surface large enough to fully contain your body, merging yourself and your equipment with the stone for the duration. You must touch the stone to do so. Nothing of your presence remains visible or otherwise detectable by nonmagical senses. While merged with the stone, you can't see what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside it are made with Disadvantage."
    },
    {
      "name": "Motivational Speech",
      "level": 3,
      "description": "You address allies, staff, or innocent bystanders to exhort and inspire them to greatness, whether they have anything to get excited about or not. Choose up to five creatures within range that can hear you. For the duration, each affected creature gains 5 temporary hit points and has advantage on Wisdom saving throws. If an affected creature is hit by an attack, it has advantage on the next attack roll it makes."
    },
    {
      "name": "Protection from Energy",
      "level": 3,
      "description": "For the duration, the willing creature you touch has Resistance to one damage type of your choice: Acid, Cold, Fire, Lightning, or Thunder."
    },
    {
      "name": "Remove Curse",
      "level": 3,
      "description": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's Attunement to the object so it can be removed or discarded."
    },
    {
      "name": "Revivify",
      "level": 3,
      "description": "You touch a creature that has died within the last minute. That creature revives with 1 Hit Points. This spell can't revive a creature that has died of old age, nor does it restore any missing body parts."
    },
    {
      "name": "Sending",
      "level": 3,
      "description": "You send a short message of 25 words or fewer to a creature you have met or a creature described to you by someone who has met it. The target hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables targets to understand the meaning of your message."
    },
    {
      "name": "Speak with Dead",
      "level": 3,
      "description": "You grant the semblance of life to a corpse of your choice within range, allowing it to answer questions you pose. The corpse must have a mouth, and this spell fails if the deceased creature was Undead when it died. The spell also fails if the corpse was the target of this spell within the past 10 days. Until the spell ends, you can ask the corpse up to five questions. The corpse knows only what it knew in life, including the languages it knew."
    },
    {
      "name": "Spirit Guardians",
      "level": 3,
      "description": "Protective spirits flit around you in a 15-foot Emanation [Area of Effect] for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish. When you cast this spell, you can designate creatures to be unaffected by it."
    },
    {
      "name": "Tongues",
      "level": 3,
      "description": "This spell grants the creature you touch the ability to understand any spoken or signed language that it hears or sees. Moreover, when the target communicates by speaking or signing, any creature that knows at least one language can understand it if that creature can hear the speech or see the signing."
    },
    {
      "name": "Water Walk",
      "level": 3,
      "description": "This spell grants the ability to move across any liquid surface—such as water, acid, mud, snow, quicksand, or lava—as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures of your choice within range gain this ability for the duration."
    },
    {
      "name": "Aura of Life",
      "level": 4,
      "description": "An aura radiates from you in a 30-foot Emanation [Area of Effect] for the duration. While in the aura, you and your allies have Resistance to Necrotic damage, and your Hit Points maximums can't be reduced. If an ally with 0 Hit Points starts its turn in the aura, that ally regains 1 Hit Points."
    },
    {
      "name": "Aura of Purity",
      "level": 4,
      "description": "An aura radiates from you in a 30-foot Emanation [Area of Effect] for the duration. While in the aura, you and your allies have Resistance to Poison damage and Advantage on saving throws to avoid or end effects that include the Blinded, Charmed, Deafened, Frightened, Paralyzed, Poisoned, or Stunned condition."
    },
    {
      "name": "Banishment",
      "level": 4,
      "description": "One creature that you can see within range must succeed on a Charisma saving throw or be transported to a harmless demiplane for the duration. While there, the target has the Incapacitated condition. When the spell ends, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. If the target is an Aberration, a Celestial, an Elemental, a Fey, or a Fiend, the target doesn't return if the spell lasts for 1 minute."
    },
    {
      "name": "Control Water",
      "level": 4,
      "description": "Until the spell ends, you control any water inside an area you choose that is a Cube [Area of Effect] up to 100 feet on a side, using one of the following effects. As a Magic action on your later turns, you can repeat the same effect or choose a different one. Flood: You cause the water level of all standing water in the area to rise by as much as 20 feet."
    },
    {
      "name": "Death Ward",
      "level": 4,
      "description": "You touch a creature and grant it a measure of protection from death. The first time the target would drop to 0 Hit Points before the spell ends, the target instead drops to 1 Hit Points, and the spell ends. If the spell is still in effect when the target is subjected to an effect that would kill it instantly without dealing damage, that effect is negated against the target, and the spell ends."
    },
    {
      "name": "Divination",
      "level": 4,
      "description": "This spell puts you in contact with a god or a god's servants. You ask one question about a specific goal, event, or activity to occur within 7 days. The DM offers a truthful reply, which might be a short phrase or cryptic rhyme. The spell doesn't account for circumstances that might change the answer, such as the casting of other spells. If you cast the spell more than once before finishing a Long Rest, there is a cumulative 25 chance for each casting after the first that you get no answer."
    },
    {
      "name": "Doomtide",
      "level": 4,
      "description": "You create a 20-foot-radius Sphere [Area of Effect] of inky fog within range. The fog is magical Darkness and lasts for the duration or until a strong wind (such as the one created by the Gust of Wind spell) disperses it, ending the spell. Each creature in the Sphere [Area of Effect] when it appears makes a Wisdom saving throw. On a failed save, a creature takes 5d6 Psychic damage and subtracts 1d6 from its saving throws until the end of its next turn."
    },
    {
      "name": "Freedom of Movement",
      "level": 4,
      "description": "You touch a willing creature. For the duration, the target's movement is unaffected by Difficult Terrain, and spells and other magical effects can neither reduce the target's Speed nor cause the target to have the Paralyzed or Restrained conditions. The target also has a Swim Speed equal to its Speed. In addition, the target can spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature imposing the Grappled condition on it."
    },
    {
      "name": "Guardian of Faith",
      "level": 4,
      "description": "A Large spectral guardian appears and hovers for the duration in an unoccupied space that you can see within range. The guardian occupies that space and is invulnerable, and it appears in a form appropriate for your deity or pantheon. Any enemy that moves to a space within 10 feet of the guardian for the first time on a turn or starts its turn there makes a Dexterity saving throw, taking 20 Radiant damage on a failed save or half as much damage on a successful one."
    },
    {
      "name": "Locate Creature",
      "level": 4,
      "description": "Describe or name a creature that is familiar to you. You sense the direction to the creature's location if that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement. The spell can locate a specific creature known to you or the nearest creature of a specific kind (such as a human or a unicorn) if you have seen such a creature up close—within 30 feet—at least once."
    },
    {
      "name": "Stone Shape",
      "level": 4,
      "description": "You touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape you like. For example, you could shape a large rock into a weapon, statue, or coffer, or you could make a small passage through a wall that is 5 feet thick. You could also shape a stone door or its frame to seal the door shut. The object you create can have up to two hinges and a latch, but finer mechanical detail isn't possible."
    },
    {
      "name": "Circle of Power",
      "level": 5,
      "description": "An aura radiates from you in a 30-foot Emanation [Area of Effect] for the duration. While in the aura, you and your allies have Advantage on saving throws against spells and other magical effects. When an affected creature makes a saving throw against a spell or magical effect that allows a save to take only half damage, it takes no damage if it succeeds on the save."
    },
    {
      "name": "Commune",
      "level": 5,
      "description": "You contact a deity or a divine proxy and ask up to three questions that can be answered with yes or no. You must ask your questions before the spell ends. You receive a correct answer for each question. Divine beings aren't necessarily omniscient, so you might receive \"unclear\" as an answer if a question pertains to information that lies beyond the deity's knowledge."
    },
    {
      "name": "Contagion",
      "level": 5,
      "description": "Your touch inflicts a magical contagion. The target must succeed on a Constitution saving throw or take 11d8 Necrotic damage and have the Poisoned condition. Also, choose one ability when you cast the spell. While Poisoned, the target has Disadvantage on saving throws made with the chosen ability. The target must repeat the saving throw at the end of each of its turns until it gets three successes or failures. If the target succeeds on three of these saves, the spell ends on the target."
    },
    {
      "name": "Dispel Evil and Good",
      "level": 5,
      "description": "For the duration, Celestials, Elementals, Fey, Fiends, and Undead have Disadvantage on attack rolls against you. You can end the spell early by using either of the following special functions. Break Enchantment: As a Magic action, you touch a creature that is possessed by or has the Charmed or Frightened condition from one or more creatures of the types above. The target is no longer possessed, Charmed, or Frightened by such creatures."
    },
    {
      "name": "Flame Strike",
      "level": 5,
      "description": "A vertical column of brilliant fire roars down from above. Each creature in a 10-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range makes a Dexterity saving throw, taking 5d6 Fire damage and 5d6 Radiant damage on a failed save or half as much damage on a successful one. Using a Higher-Level Spell Slot: The Fire damage and the Radiant damage increase by 5d6 for each spell slot level above 5."
    },
    {
      "name": "Geas",
      "level": 5,
      "description": "You give a verbal command to a creature that you can see within range, ordering it to carry out some service or refrain from an action or a course of activity as you decide. The target must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The target automatically succeeds if it can't understand your command. While Charmed, the creature takes 5d10 Psychic damage if it acts in a manner directly counter to your command."
    },
    {
      "name": "Greater Restoration",
      "level": 5,
      "description": "You touch a creature and magically remove one of the following effects from it: 1 Exhaustion level The Charmed or Petrified condition A curse, including the target's Attunement to a cursed magic item Any reduction to one of the target's ability scores Any reduction to the target's Hit Points maximum"
    },
    {
      "name": "Hallow",
      "level": 5,
      "description": "You touch a point and infuse an area around it with holy or unholy power. The area can have a radius up to 60 feet, and the spell fails if the radius includes an area already under the effect of Hallow. The affected area has the following effects. Hallowed Ward: Choose any of these creature types: Aberration, Celestial, Elemental, Fey, Fiend, or Undead."
    },
    {
      "name": "Insect Plague",
      "level": 5,
      "description": "Swarming locusts fill a 20-foot-radius Sphere [Area of Effect] centered on a point you choose within range. The Sphere [Area of Effect] remains for the duration, and its area is Lightly Obscured and Difficult Terrain. When the swarm appears, each creature in it makes a Constitution saving throw, taking 4d10 Piercing damage on a failed save or half as much damage on a successful one."
    },
    {
      "name": "Legend Lore",
      "level": 5,
      "description": "Name or describe a famous person, place, or object. The spell brings to your mind a brief summary of the significant lore about that famous thing, as described by the DM. The lore might consist of important details, amusing revelations, or even secret lore that has never been widely known. The more information you already know about the thing, the more precise and detailed the information you receive is."
    },
    {
      "name": "Mass Cure Wounds",
      "level": 5,
      "description": "A wave of healing energy washes out from a point you can see within range. Choose up to six creatures in a 30-foot-radius Sphere [Area of Effect] centered on that point. Each target regains Hit Points equal to 5d8 plus your spellcasting ability modifier. Using a Higher-Level Spell Slot: The healing increases by 5d8 for each spell slot level above 5."
    },
    {
      "name": "Planar Binding",
      "level": 5,
      "description": "You attempt to bind a Celestial, an Elemental, a Fey, or a Fiend to your service. The creature must be within range for the entire casting of the spell. (Typically, the creature is first summoned into the center of the inverted version of the Magic Circle spell to trap it while this spell is cast.) At the completion of the casting, the target must succeed on a Charisma saving throw or be bound to serve you for the duration."
    },
    {
      "name": "Raise Dead",
      "level": 5,
      "description": "With a touch, you revive a dead creature if it has been dead no longer than 10 days and it wasn't Undead when it died. The creature returns to life with 1 Hit Points. This spell also neutralizes any poisons that affected the creature at the time of death. This spell closes all mortal wounds, but it doesn't restore missing body parts. If the creature is lacking body parts or organs integral for its survival—its head, for instance—the spell automatically fails."
    },
    {
      "name": "Scrying",
      "level": 5,
      "description": "You can see and hear a creature you choose that is on the same plane of existence as you. The target makes a Wisdom saving throw, which is modified (see the tables below) by how well you know the target and the sort of physical connection you have to it. The target doesn't know what it is making the save against, only that it feels uneasy. On a successful save, the target isn't affected, and you can't use this spell on it again for 24 hours."
    },
    {
      "name": "Summon Celestial",
      "level": 5,
      "description": "You call forth a Celestial spirit. It manifests in an angelic form in an unoccupied space that you can see within range and uses the Celestial Spirit stat block. When you cast the spell, choose Avenger or Defender. Your choice determines certain details in its stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends. The creature is an ally to you and your allies. In combat, the creature shares your Initiative count, but it takes its turn immediately after yours."
    },
    {
      "name": "Blade Barrier",
      "level": 6,
      "description": "You create a wall of whirling blades made of magical energy. The wall appears within range and lasts for the duration. You make a straight wall up to 100 feet long, 20 feet high, and 5 feet thick, or a ringed wall up to 60 feet in diameter, 20 feet high, and 5 feet thick. The wall provides Three-Quarters Cover, and its space is Difficult Terrain. Any creature in the wall's space makes a Dexterity saving throw, taking 6d10 Force damage on a failed save or half as much damage on a successful one."
    },
    {
      "name": "Create Undead",
      "level": 6,
      "description": "You can cast this spell only at night. Choose up to three corpses of Medium or Small Humanoids within range. Each one becomes a Ghoul under your control (see the Monster Manual for its stat block). As a Bonus Action on each of your turns, you can mentally command any creature you animated with this spell if the creature is within 120 feet of you (if you control multiple creatures, you can command any of them at the same time, issuing the same command to them)."
    },
    {
      "name": "Dirge",
      "level": 6,
      "description": "Deathly power fills a 60-foot Emanation [Area of Effect] originating from you for the duration. When you cast this spell, you can designate creatures to be unaffected by it. Any other creature can't regain Hit Points while in the Emanation [Area of Effect]. Whenever the Emanation [Area of Effect] enters a creature's space and whenever a creature enters the Emanation [Area of Effect] or ends its turn there, the creature makes a Constitution saving throw."
    },
    {
      "name": "Find the Path",
      "level": 6,
      "description": "You magically sense the most direct physical route to a location you name. You must be familiar with the location, and the spell fails if you name a destination on another plane of existence, a moving destination (such as a mobile fortress), or an unspecific destination (such as \"a green dragon's lair\"). For the duration, as long as you are on the same plane of existence as the destination, you know how far it is and in what direction it lies."
    },
    {
      "name": "Forbiddance",
      "level": 6,
      "description": "You create a ward against magical travel that protects up to 40,000 square feet of floor space to a height of 30 feet above the floor. For the duration, creatures can't teleport into the area or use portals, such as those created by the Gate spell, to enter the area. The spell proofs the area against planar travel, and therefore prevents creatures from accessing the area by way of the Astral Plane, the Ethereal Plane, the Feywild, the Shadowfell, or the Plane Shift spell."
    },
    {
      "name": "Harm",
      "level": 6,
      "description": "You unleash virulent magic on a creature you can see within range. The target makes a Constitution saving throw. On a failed save, it takes 14d6 Necrotic damage, and its Hit Points maximum is reduced by an amount equal to the Necrotic damage it took. On a successful save, it takes half as much damage only. This spell can't reduce a target's Hit Points maximum below 1."
    },
    {
      "name": "Heal",
      "level": 6,
      "description": "Choose a creature that you can see within range. Positive energy washes through the target, restoring 70 Hit Points. This spell also ends the Blinded, Deafened, and Poisoned conditions on the target. Using a Higher-Level Spell Slot: The healing increases by 70 for each spell slot level above 6."
    },
    {
      "name": "Heroes' Feast",
      "level": 6,
      "description": "You conjure a feast that appears on a surface in an unoccupied 10-foot Cube [Area of Effect] next to you. The feast takes 1 hour to consume and disappears at the end of that time, and the beneficial effects don't set in until this hour is over. Up to twelve creatures can partake of the feast. A creature that partakes gains several benefits, which last for 24 hours. The creature has Resistance to Poison damage, and it has Immunity to the Frightened and Poisoned conditions."
    },
    {
      "name": "Planar Ally",
      "level": 6,
      "description": "You beseech an otherworldly entity for aid. The being must be known to you: a god, a demon prince, or some other being of cosmic power. That entity sends a Celestial, an Elemental, or a Fiend loyal to it to aid you, making the creature appear in an unoccupied space within range. If you know a specific creature's name, you can speak that name when you cast this spell to request that creature, though you might get a different creature anyway (DM's choice)."
    },
    {
      "name": "Sunbeam",
      "level": 6,
      "description": "You launch a sunbeam in a 5-foot-wide, 60-foot-long Line [Area of Effect]. Each creature in the Line [Area of Effect] makes a Constitution saving throw. On a failed save, a creature takes 6d8 Radiant damage and has the Blinded condition until the start of your next turn. On a successful save, it takes half as much damage only. Until the spell ends, you can take a Magic action to create a new Line [Area of Effect] of radiance. For the duration, a mote of brilliant radiance shines above you."
    },
    {
      "name": "True Seeing",
      "level": 6,
      "description": "For the duration, the willing creature you touch has Truesight with a range of 120 feet."
    },
    {
      "name": "Word of Recall",
      "level": 6,
      "description": "You and up to five willing creatures within 5 feet of you instantly teleport to a previously designated sanctuary. You and any creatures that teleport with you appear in the nearest unoccupied space to the spot you designated when you prepared your sanctuary (see below). If you cast this spell without first preparing a sanctuary, the spell has no effect. You must designate a location, such as a temple, as a sanctuary by casting this spell there."
    },
    {
      "name": "Conjure Celestial",
      "level": 7,
      "description": "You conjure a spirit from the Upper Planes, which manifests as a pillar of light in a 10-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range. For each creature you can see in the Cylinder [Area of Effect], choose which of these lights shines on it: Healing Light: The target regains Hit Points equal to 4d12 plus your spellcasting ability modifier."
    },
    {
      "name": "Divine Word",
      "level": 7,
      "description": "You utter a word imbued with power from the Upper Planes. Each creature of your choice in range makes a Charisma saving throw. On a failed save, a target that has 50 Hit Points or fewer suffers an effect based on its current Hit Points, as shown in the Divine Word Effects table."
    },
    {
      "name": "Etherealness",
      "level": 7,
      "description": "You step into the border regions of the Ethereal Plane, where it overlaps with your current plane. You remain in the Border Ethereal for the duration. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can perceive the plane you left, which looks gray, and you can't see anything there more than 60 feet away. While on the Ethereal Plane, you can affect and be affected only by creatures, objects, and effects on that plane."
    },
    {
      "name": "Fire Storm",
      "level": 7,
      "description": "A storm of fire appears within range. The area of the storm consists of up to ten 10-foot Cubes, which you arrange as you like. Each Cube [Area of Effect] must be contiguous with at least one other Cube [Area of Effect]. Each creature in the area makes a Dexterity saving throw, taking 7d10 Fire damage on a failed save or half as much damage on a successful one. Flammable objects in the area that aren't being worn or carried start burning."
    },
    {
      "name": "Plane Shift",
      "level": 7,
      "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination, as determined by the DM."
    },
    {
      "name": "Power Word Fortify",
      "level": 7,
      "description": "You fortify up to six creatures you can see within range. The spell bestows 120 Temporary Hit Points, which you divide among the spell's recipients."
    },
    {
      "name": "Regenerate",
      "level": 7,
      "description": "A creature you touch regains 4d8 + 15 Hit Points. For the duration, the target regains 1 Hit Points at the start of each of its turns, and any severed body parts regrow after 2 minutes."
    },
    {
      "name": "Resurrection",
      "level": 7,
      "description": "With a touch, you revive a dead creature that has been dead for no more than a century, didn't die of old age, and wasn't Undead when it died. The creature returns to life with all its Hit Points. This spell also neutralizes any poisons that affected the creature at the time of death. This spell closes all mortal wounds and restores any missing body parts. Coming back from the dead is an ordeal. The target takes a -4 penalty to D20 Test."
    },
    {
      "name": "Symbol",
      "level": 7,
      "description": "You inscribe a harmful glyph either on a surface (such as a section of floor or wall) or within an object that can be closed (such as a book or chest). The glyph can cover an area no larger than 10 feet in diameter. If you choose an object, it must remain in place; if it is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered."
    },
    {
      "name": "Antimagic Field",
      "level": 8,
      "description": "An aura of antimagic surrounds you in a 10-foot Emanation [Area of Effect]. No one can cast spells, take Magic actions, or create other magical effects inside the aura, and those things can't target or otherwise affect anything inside it. Magical properties of magic items don't work inside the aura or on anything inside it. Areas of effect created by spells or other magic can't extend into the aura, and no one can teleport into or out of it or use planar travel there."
    },
    {
      "name": "Control Weather",
      "level": 8,
      "description": "You take control of the weather within 5 miles of you for the duration. You must be outdoors to cast this spell, and it ends early if you go indoors. When you cast the spell, you change the current weather conditions, which are determined by the DM. You can change precipitation, temperature, and wind. It takes 1d4 × 10 minutes for the new conditions to take effect. Once they do so, you can change the conditions again. When the spell ends, the weather gradually returns to normal."
    },
    {
      "name": "Earthquake",
      "level": 8,
      "description": "Choose a point on the ground that you can see within range. For the duration, an intense tremor rips through the ground in a 100-foot-radius circle centered on that point. The ground there is Difficult Terrain. When you cast this spell and at the end of each of your turns for the duration, each creature on the ground in the area makes a Dexterity saving throw. On a failed save, a creature has the Prone condition, and its Concentration is broken. You can also cause the effects below."
    },
    {
      "name": "Holy Aura",
      "level": 8,
      "description": "For the duration, you emit an aura in a 30-foot Emanation [Area of Effect]. While in the aura, creatures of your choice have Advantage on all saving throws, and other creatures have Disadvantage on attack rolls against them. In addition, when a Fiend or an Undead hits an affected creature with a melee attack roll, the attacker must succeed on a Constitution saving throw or have the Blinded condition until the end of its next turn."
    },
    {
      "name": "Holy Star of Mystra",
      "level": 8,
      "description": "You create a glowing mote of energy that hovers above you for the duration. The mote sheds Bright Light in a 5-foot radius and Dim Light for an additional 5 feet. When you cast this spell and as a Bonus Action on later turns, you can unleash a shining bolt from the mote, targeting one creature within 120 feet of yourself. Make a ranged spell attack. On a hit, the target takes Force or Radiant damage (your choice) equal to 4d10 plus your spellcasting ability modifier."
    },
    {
      "name": "Sunburst",
      "level": 8,
      "description": "Brilliant sunlight flashes in a 60-foot-radius Sphere [Area of Effect] centered on a point you choose within range. Each creature in the Sphere [Area of Effect] makes a Constitution saving throw. On a failed save, a creature takes 12d6 Radiant damage and has the Blinded condition for 1 minute. On a successful save, it takes half as much damage only. A creature Blinded by this spell makes another Constitution saving throw at the end of each of its turns, ending the effect on itself on a success."
    },
    {
      "name": "Astral Projection",
      "level": 9,
      "description": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane (the spell ends instantly if you are already on that plane). Each target's body is left behind in a state of suspended animation; it has the Unconscious condition, doesn't need food or air, and doesn't age. A target's astral form resembles its body in almost every way, replicating its game statistics and possessions."
    },
    {
      "name": "Gate",
      "level": 9,
      "description": "You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration, and the portal's destination is visible through it. The portal has a front and a back on each plane where it appears. Travel through the portal is possible only by moving through its front."
    },
    {
      "name": "Mass Heal",
      "level": 9,
      "description": "A flood of healing energy flows from you into creatures around you. You restore up to 700 Hit Points, divided as you choose among any number of creatures that you can see within range. Creatures healed by this spell also have the Blinded, Deafened, and Poisoned conditions removed from them."
    },
    {
      "name": "Power Word Heal",
      "level": 9,
      "description": "A wave of healing energy washes over one creature you can see within range. The target regains all its Hit Points. If the creature has the Charmed, Frightened, Paralyzed, Poisoned, or Stunned condition, the condition ends. If the creature has the Prone condition, it can use its Reaction to stand up."
    },
    {
      "name": "True Resurrection",
      "level": 9,
      "description": "You touch a creature that has been dead for no longer than 200 years and that died for any reason except old age. The creature is revived with all its Hit Points. This spell closes all wounds, neutralizes any poison, cures all magical contagions, and lifts any curses affecting the creature when it died. The spell replaces damaged or missing organs and limbs. If the creature was Undead, it is restored to its non-Undead form."
    }
  ],
  "levels": [
    {
      "features": [
        "Divine Order",
        "Protector",
        "Spellcasting",
        "Thaumaturge"
      ],
      "spell_slots": [
        2
      ],
      "cantrips_known": 3
    },
    {
      "features": [
        "Channel Divinity",
        "Divine Spark",
        "Turn Undead"
      ],
      "spell_slots": [
        3
      ],
      "cantrips_known": 3
    },
    {
      "features": [
        "Cleric Subclass"
      ],
      "spell_slots": [
        4,
        2
      ],
      "cantrips_known": 3
    },
    {
      "features": [
        "Ability Score Improvement"
      ],
      "spell_slots": [
        4,
        3
      ],
      "cantrips_known": 4
    },
    {
      "features": [
        "Sear Undead"
      ],
      "spell_slots": [
        4,
        3,
        2
      ],
      "cantrips_known": 4
    },
    {
      "features": [
        "Subclass Feature"
      ],
      "spell_slots": [
        4,
        3,
        3
      ],
      "cantrips_known": 4
    },
    {
      "features": [
        "Blessed Strikes",
        "Divine Strike",
        "Potent Spellcasting"
      ],
      "spell_slots": [
        4,
        3,
        3,
        1
      ],
      "cantrips_known": 4
    },
    {
      "features": [
        "Ability Score Improvement"
      ],
      "spell_slots": [
        4,
        3,
        3,
        2
      ],
      "cantrips_known": 4
    },
    {
      "features": [],
      "spell_slots": [
        4,
        3,
        3,
        3,
        1
      ],
      "cantrips_known": 4
    },
    {
      "features": [
        "Divine Intervention"
      ],
      "spell_slots": [
        4,
        3,
        3,
        3,
        2
      ],
      "cantrips_known": 5
    },
    {
      "features": [],
      "spell_slots": [
        4,
        3,
        3,
        3,
        2,
        1
      ],
      "cantrips_known": 5
    },
    {
      "features": [
        "Ability Score Improvement"
      ],
      "spell_slots": [
        4,
        3,
        3,
        3,
        2,
        1
      ],
      "cantrips_known": 5
    },
    {
      "features": [],
      "spell_slots": [
        4,
        3,
        3,
        3,
        2,
        1,
        1
      ],
      "cantrips_known": 5
    },
    {
      "features": [
        "Improved Blessed Strikes"
      ],
      "spell_slots": [
        4,
        3,
        3,
        3,
        2,
        1,
        1
      ],
      "cantrips_known": 5
    },
    {
      "features": [],
      "spell_slots": [
        4,
        3,
        3,
        3,
        2,
        1,
        1,
        1
      ],
      "cantrips_known": 5
    },
    {
      "features": [
        "Ability Score Improvement"
      ],
      "spell_slots": [
        4,
        3,
        3,
        3,
        2,
        1,
        1,
        1
      ],
      "cantrips_known": 5
    },
    {
      "features": [
        "Subclass Feature"
      ],
      "spell_slots": [
        4,
        3,
        3,
        3,
        2,
        1,
        1,
        1,
        1
      ],
      "cantrips_known": 5
    },
    {
      "features": [],
      "spell_slots": [
        4,
        3,
        3,
        3,
        3,
        1,
        1,
        1,
        1
      ],
      "cantrips_known": 5
    },
    {
      "features": [
        "Epic Boon"
      ],
      "spell_slots": [
        4,
        3,
        3,
        3,
        3,
        2,
        1,
        1,
        1
      ],
      "cantrips_known": 5
    },
    {
      "features": [
        "Greater Divine Intervention"
      ],
      "spell_slots": [
        4,
        3,
        3,
        3,
        3,
        2,
        2,
        1,
        1
      ],
      "cantrips_known": 5
    }
  ],
  "subclasses": [
    {
      "name": "Knowledge Domain",
      "description": "The gods of knowledge—including Oghma, Boccob, Gilean, Aureon, and Thoth—value learning and understanding above all. Some teach that knowledge is to be gathered and shared in libraries and universities, or promote the practical knowledge of craft and invention.",
      "features": [
        {
          "name": "Knowledge Domain",
          "description": "The gods of knowledge—including Oghma, Boccob, Gilean, Aureon, and Thoth—value learning and understanding above all. Some teach that knowledge is to be gathered and shared in libraries and universities, or promote the practical knowledge of craft and invention. Some deities hoard knowledge and keep its secrets to themselves."
        },
        {
          "name": "Blessings of Knowledge",
          "description": "At 1st level, you learn two languages of your choice. You also become proficient in your choice of two of the following skills: Arcana, History, Nature, or Religion. Your proficiency bonus is doubled for any ability check you make that uses either of those skills."
        },
        {
          "name": "Channel Divinity: Knowledge of the Ages",
          "description": "Starting at 2nd level, you can use your Channel Divinity to tap into a divine well of knowledge. As an action, you choose one skill or tool. For 10 minutes, you have proficiency with the chosen skill or tool."
        },
        {
          "name": "Channel Divinity: Read Thoughts",
          "description": "At 6th level, you can use your Channel Divinity to read a creature's thoughts. You can then use your access to the creature's mind to command it. As an action, choose one creature that you can see within 60 feet of you. That creature must make a Wisdom saving throw. If the creature succeeds on the saving throw, you can't use this feature on it again until you finish a long rest."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Potent Spellcasting feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Potent Spellcasting",
          "description": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."
        },
        {
          "name": "Visions of the Past",
          "description": "Starting at 17th level, you can call up visions of the past that relate to an object you hold or your immediate surroundings. You spend at least 1 minute in meditation and prayer, then receive dreamlike, shadowy glimpses of recent events."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Knowledge Domain",
            "Blessings of Knowledge"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Knowledge of the Ages"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Knowledge of the Ages",
            "Knowledge Domain"
          ]
        },
        {
          "level": 6,
          "features": [
            "Channel Divinity: Read Thoughts"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Potent Spellcasting"
          ]
        },
        {
          "level": 17,
          "features": [
            "Visions of the Past"
          ]
        }
      ]
    },
    {
      "name": "Life Domain",
      "description": "Soothe the Hurts of the World The Life Domain focuses on the positive energy that helps sustain all life in the multiverse. Clerics who tap into this domain are masters of healing, using that life force to cure many hurts.",
      "features": [
        {
          "name": "Life Domain",
          "description": "Soothe the Hurts of the World The Life Domain focuses on the positive energy that helps sustain all life in the multiverse. Clerics who tap into this domain are masters of healing, using that life force to cure many hurts. Existence itself relies on the positive energy associated with this domain, so a Cleric of almost any religious tradition might choose it."
        },
        {
          "name": "Disciple of Life",
          "description": "When a spell you cast with a spell slot restores Hit Points to a creature, that creature regains additional Hit Points on the turn you cast the spell. The additional Hit Points equal 2 plus the spell slot's level."
        },
        {
          "name": "Life Domain Spells",
          "description": "Your connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the Life Domain Spells table, you thereafter always have the listed spells prepared."
        },
        {
          "name": "Preserve Life",
          "description": "As a Magic action, you present your Holy Symbol and expend a use of your Channel Divinity to evoke healing energy that can restore a number of Hit Points equal to five times your Cleric level. Choose Bloodied creatures within 30 feet of yourself (which can include you), and divide those Hit Points among them. This feature can restore a creature to no more than half its Hit Points maximum."
        },
        {
          "name": "Blessed Healer",
          "description": "The healing spells you cast on others heal you as well. Immediately after you cast a spell with a spell slot that restores Hit Points to one creature other than you, you regain Hit Points equal to 2 plus the spell slot's level."
        },
        {
          "name": "Supreme Healing",
          "description": "When you would normally roll one or more dice to restore Hit Points to a creature with a spell or Channel Divinity, don't roll those dice for the healing; instead use the highest number possible for each die. For example, instead of restoring 2d6 Hit Points to a creature with a spell, you restore 12."
        }
      ],
      "levels": [
        {
          "level": 3,
          "features": [
            "Life Domain",
            "Disciple of Life",
            "Life Domain Spells",
            "Preserve Life"
          ]
        },
        {
          "level": 6,
          "features": [
            "Blessed Healer"
          ]
        },
        {
          "level": 17,
          "features": [
            "Supreme Healing"
          ]
        }
      ],
      "spells": [
        {
          "name": "Bless",
          "level": 1,
          "description": "You bless up to three creatures within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target adds 1d4 to the attack roll or save."
        },
        {
          "name": "Cure Wounds",
          "level": 1,
          "description": "A creature you touch regains a number of Hit Points equal to 2d8 plus your spellcasting ability modifier."
        },
        {
          "name": "Aid",
          "level": 2,
          "description": "Choose up to three creatures within range. Each target's Hit Points maximum and current Hit Points increase by 5 for the duration."
        },
        {
          "name": "Lesser Restoration",
          "level": 2,
          "description": "You touch a creature and end one condition on it: Blinded, Deafened, Paralyzed, or Poisoned."
        },
        {
          "name": "Mass Healing Word",
          "level": 3,
          "description": "Up to six creatures of your choice that you can see within range regain Hit Points equal to 2d4 plus your spellcasting ability modifier."
        },
        {
          "name": "Revivify",
          "level": 3,
          "description": "You touch a creature that has died within the last minute. That creature revives with 1 Hit Points. This spell can't revive a creature that has died of old age, nor does it restore any missing body parts."
        },
        {
          "name": "Aura of Life",
          "level": 4,
          "description": "An aura radiates from you in a 30-foot Emanation [Area of Effect] for the duration. While in the aura, you and your allies have Resistance to Necrotic damage, and your Hit Points maximums can't be reduced. If an ally with 0 Hit Points starts its turn in the aura, that ally regains 1 Hit Points."
        },
        {
          "name": "Death Ward",
          "level": 4,
          "description": "You touch a creature and grant it a measure of protection from death. The first time the target would drop to 0 Hit Points before the spell ends, the target instead drops to 1 Hit Points, and the spell ends."
        },
        {
          "name": "Greater Restoration",
          "level": 5,
          "description": "You touch a creature and magically remove one of the following effects from it: 1 Exhaustion level The Charmed or Petrified condition A curse, including the target's Attunement to a cursed magic item Any reduction to one of the target's ability scores Any reduction to the target's Hit Points maximum"
        },
        {
          "name": "Mass Cure Wounds",
          "level": 5,
          "description": "A wave of healing energy washes out from a point you can see within range. Choose up to six creatures in a 30-foot-radius Sphere [Area of Effect] centered on that point. Each target regains Hit Points equal to 5d8 plus your spellcasting ability modifier."
        }
      ]
    },
    {
      "name": "Light Domain",
      "description": "Bring Light to Banish Darkness The Light Domain emphasizes the divine power to bring about blazing fire and revelation. Clerics who wield this power are enlightened souls infused with radiance and the power of their deities' discerning vision, charged with chasing away lies and burning away darkn...",
      "features": [
        {
          "name": "Light Domain",
          "description": "Bring Light to Banish Darkness The Light Domain emphasizes the divine power to bring about blazing fire and revelation. Clerics who wield this power are enlightened souls infused with radiance and the power of their deities' discerning vision, charged with chasing away lies and burning away darkness. The Light Domain is associated with gods of truth, vigilance, beauty, insight, and renewal."
        },
        {
          "name": "Light Domain Spells",
          "description": "Your connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the Light Domain Spells table, you thereafter always have the listed spells prepared."
        },
        {
          "name": "Radiance of the Dawn",
          "description": "As a Magic action, you present your Holy Symbol and expend a use of your Channel Divinity to emit a flash of light in a 30-foot Emanation [Area of Effect] originating from yourself. Any magical Darkness—such as that created by the Darkness spell—in that area is dispelled."
        },
        {
          "name": "Warding Flare",
          "description": "When a creature that you can see within 30 feet of yourself makes an attack roll, you can take a Reaction to impose Disadvantage on the attack roll, causing light to flare before it hits or misses. You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a Long Rest."
        },
        {
          "name": "Improved Warding Flare",
          "description": "You regain all expended uses of your Warding Flare when you finish a Short Rest or Long Rest. In addition, whenever you use Warding Flare, you can give the target of the triggering attack a number of Temporary Hit Points equal to 2d6 plus your Wisdom modifier."
        },
        {
          "name": "Corona of Light",
          "description": "As a Magic action, you cause yourself to emit an aura of sunlight that lasts for 1 minute or until you dismiss it (no action required). You emit Bright Light in a 60-foot radius and Dim Light for an additional 30 feet. Your enemies in the Bright Light have Disadvantage on saving throws against your Radiance of the Dawn and any spell that deals Fire or Radiant damage."
        }
      ],
      "levels": [
        {
          "level": 3,
          "features": [
            "Light Domain",
            "Light Domain Spells",
            "Radiance of the Dawn",
            "Warding Flare"
          ]
        },
        {
          "level": 6,
          "features": [
            "Improved Warding Flare"
          ]
        },
        {
          "level": 17,
          "features": [
            "Corona of Light"
          ]
        }
      ],
      "spells": [
        {
          "name": "Burning Hands",
          "level": 1,
          "description": "A thin sheet of flames shoots forth from you. Each creature in a 15-foot Cone [Area of Effect] makes a Dexterity saving throw, taking 3d6 Fire damage on a failed save or half as much damage on a successful one."
        },
        {
          "name": "Faerie Fire",
          "level": 1,
          "description": "Objects in a 20-foot Cube [Area of Effect] within range are outlined in blue, green, or violet light (your choice). Each creature in the Cube [Area of Effect] is also outlined if it fails a Dexterity saving throw."
        },
        {
          "name": "Scorching Ray",
          "level": 2,
          "description": "You hurl three fiery rays. You can hurl them at one target within range or at several. Make a ranged spell attack for each ray. On a hit, the target takes 2d6 Fire damage."
        },
        {
          "name": "See Invisibility",
          "level": 2,
          "description": "For the duration, you see creatures and objects that have the Invisible condition as if they were visible, and you can see into the Ethereal Plane. Creatures and objects there appear ghostly."
        },
        {
          "name": "Daylight",
          "level": 3,
          "description": "For the duration, sunlight spreads from a point within range and fills a 60-foot-radius Sphere [Area of Effect]. The sunlight's area is Bright Light and sheds Dim Light for an additional 60 feet."
        },
        {
          "name": "Fireball",
          "level": 3,
          "description": "A bright streak flashes from you to a point you choose within range and then blossoms with a low roar into a fiery explosion. Each creature in a 20-foot-radius Sphere [Area of Effect] centered on that point makes a Dexterity saving throw, taking 8d6 Fire damage on a failed save or half as much da..."
        },
        {
          "name": "Arcane Eye",
          "level": 4,
          "description": "You create an Invisible, invulnerable eye within range that hovers for the duration. You mentally receive visual information from the eye, which can see in every direction. It also has Darkvision with a range of 30 feet. As a Bonus Action, you can move the eye up to 30 feet in any direction."
        },
        {
          "name": "Wall of Fire",
          "level": 4,
          "description": "You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration."
        },
        {
          "name": "Flame Strike",
          "level": 5,
          "description": "A vertical column of brilliant fire roars down from above. Each creature in a 10-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range makes a Dexterity saving throw, taking 5d6 Fire damage and 5d6 Radiant damage on a failed save or half as much damage on a successf..."
        },
        {
          "name": "Scrying",
          "level": 5,
          "description": "You can see and hear a creature you choose that is on the same plane of existence as you. The target makes a Wisdom saving throw, which is modified (see the tables below) by how well you know the target and the sort of physical connection you have to it."
        }
      ]
    },
    {
      "name": "Nature Domain",
      "description": "Gods of nature are as varied as the natural world itself, from inscrutable gods of the deep forests (such as Silvanus, Obad-Hai, Chislev, Balinor, and Pan) to friendly deities associated with particular springs and groves (such as Eldath).",
      "features": [
        {
          "name": "Nature Domain",
          "description": "Gods of nature are as varied as the natural world itself, from inscrutable gods of the deep forests (such as Silvanus, Obad-Hai, Chislev, Balinor, and Pan) to friendly deities associated with particular springs and groves (such as Eldath)."
        },
        {
          "name": "Acolyte of Nature",
          "description": "At 1st level, you learn one druid cantrip of your choice. This cantrip doesn't count against the number of cleric cantrips you know. You also gain proficiency in one of the following skills of your choice: Animal Handling, Nature, or Survival."
        },
        {
          "name": "Bonus Proficiency",
          "description": "Also at 1st level, you gain proficiency with heavy armor."
        },
        {
          "name": "Channel Divinity: Charm Animals and Plants",
          "description": "Starting at 2nd level, you can use your Channel Divinity to charm animals and plants. As an action, you present your holy symbol and invoke the name of your deity. Each beast or plant creature that can see you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is charmed by you for 1 minute or until it takes damage."
        },
        {
          "name": "Dampen Elements",
          "description": "Starting at 6th level, when you or a creature within 30 feet of you takes acid, cold, fire, lightning, or thunder damage, you can use your reaction to grant resistance to the creature against that instance of the damage."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Divine Strike feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 cold, fire, or lightning damage (your choice) to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Master of Nature",
          "description": "At 17th level, you gain the ability to command animals and plant creatures. While creatures are charmed by your Charm Animals and Plants feature, you can take a bonus action on your turn to verbally command what each of those creatures will do on its next turn."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Nature Domain",
            "Acolyte of Nature",
            "Bonus Proficiency"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Charm Animals and Plants"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Charm Animals and Plants",
            "Nature Domain"
          ]
        },
        {
          "level": 6,
          "features": [
            "Dampen Elements"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Divine Strike"
          ]
        },
        {
          "level": 17,
          "features": [
            "Master of Nature"
          ]
        }
      ]
    },
    {
      "name": "Tempest Domain",
      "description": "Gods whose portfolios include the Tempest domain—including Talos, Umberlee, Kord, Zeboim, the Devourer, Zeus, and Thor—govern storms, sea, and sky. They include gods of lightning and thunder, gods of earthquakes, some fire gods, and certain gods of violence, physical strength, and courage.",
      "features": [
        {
          "name": "Tempest Domain",
          "description": "Gods whose portfolios include the Tempest domain—including Talos, Umberlee, Kord, Zeboim, the Devourer, Zeus, and Thor—govern storms, sea, and sky. They include gods of lightning and thunder, gods of earthquakes, some fire gods, and certain gods of violence, physical strength, and courage."
        },
        {
          "name": "Bonus Proficiencies",
          "description": "At 1st level, you gain proficiency with martial weapons and heavy armor."
        },
        {
          "name": "Wrath of the Storm",
          "description": "Also at 1st level, you can thunderously rebuke attackers. When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed saving throw, and half as much damage on a successful one."
        },
        {
          "name": "Channel Divinity: Destructive Wrath",
          "description": "Starting at 2nd level, you can use your Channel Divinity to wield the power of the storm with unchecked ferocity. When you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage, instead of rolling."
        },
        {
          "name": "Thunderbolt Strike",
          "description": "At 6th level, when you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Divine Strike feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Stormborn",
          "description": "At 17th level, you have a flying speed equal to your current walking speed whenever you are not underground or indoors."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Tempest Domain",
            "Bonus Proficiencies",
            "Wrath of the Storm"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Destructive Wrath"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Destructive Wrath",
            "Tempest Domain"
          ]
        },
        {
          "level": 6,
          "features": [
            "Thunderbolt Strike"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Divine Strike"
          ]
        },
        {
          "level": 17,
          "features": [
            "Stormborn"
          ]
        }
      ]
    },
    {
      "name": "Trickery Domain",
      "description": "Make Mischief and Challenge Authority The Trickery Domain offers magic of deception, illusion, and stealth. Clerics who wield this magic are a disruptive force in the world, puncturing pride, mocking tyrants, freeing captives, and flouting hollow traditions.",
      "features": [
        {
          "name": "Trickery Domain",
          "description": "Make Mischief and Challenge Authority The Trickery Domain offers magic of deception, illusion, and stealth. Clerics who wield this magic are a disruptive force in the world, puncturing pride, mocking tyrants, freeing captives, and flouting hollow traditions. They prefer subterfuge and pranks to direct confrontation."
        },
        {
          "name": "Blessing of the Trickster",
          "description": "As a Magic action, you can choose yourself or a willing creature within 30 feet of yourself to have Advantage on Dexterity (Stealth) checks. This blessing lasts until you finish a Long Rest or you use this feature again."
        },
        {
          "name": "Invoke Duplicity",
          "description": "As a Bonus Action, you can expend one use of your Channel Divinity to create a perfect visual illusion of yourself in an unoccupied space you can see within 30 feet of yourself. The illusion is intangible and doesn't occupy its space. It lasts for 1 minute, but it ends early if you dismiss it (no action required) or have the Incapacitated condition."
        },
        {
          "name": "Trickery Domain Spells",
          "description": "Your connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the Trickery Domain Spells table, you thereafter always have the listed spells prepared."
        },
        {
          "name": "Trickster's Transposition",
          "description": "Whenever you take the Bonus Action to create or move the illusion of your Invoke Duplicity, you can teleport, swapping places with the illusion."
        },
        {
          "name": "Improved Duplicity",
          "description": "The illusion of your Invoke Duplicity has grown more powerful in the following ways. Shared Distraction: When you and your allies make attack rolls against a creature within 5 feet of the illusion, the attack rolls have Advantage. Healing Illusion: When the illusion ends, you or a creature of your choice within 5 feet of it regains a number of Hit Points equal to your Cleric level."
        }
      ],
      "levels": [
        {
          "level": 3,
          "features": [
            "Trickery Domain",
            "Blessing of the Trickster",
            "Invoke Duplicity",
            "Trickery Domain Spells"
          ]
        },
        {
          "level": 6,
          "features": [
            "Trickster's Transposition"
          ]
        },
        {
          "level": 17,
          "features": [
            "Improved Duplicity"
          ]
        }
      ],
      "spells": [
        {
          "name": "Charm Person",
          "level": 1,
          "description": "One Humanoid you can see within range makes a Wisdom saving throw. It does so with Advantage if you or your allies are fighting it. On a failed save, the target has the Charmed condition until the spell ends or until you or your allies damage it. The Charmed creature is Friendly [Attitude] to you."
        },
        {
          "name": "Disguise Self",
          "level": 1,
          "description": "You make yourself—including your clothing, armor, weapons, and other belongings on your person—look different until the spell ends. You can seem 1 foot shorter or taller and can appear heavier or lighter. You must adopt a form that has the same basic arrangement of limbs as you have."
        },
        {
          "name": "Invisibility",
          "level": 2,
          "description": "A creature you touch has the Invisible condition until the spell ends. The spell ends early immediately after the target makes an attack roll, deals damage, or casts a spell."
        },
        {
          "name": "Pass without Trace",
          "level": 2,
          "description": "You radiate a concealing aura in a 30-foot Emanation [Area of Effect] for the duration. While in the aura, you and each creature you choose have a +10 bonus to Dexterity (Stealth) checks and leave no tracks."
        },
        {
          "name": "Hypnotic Pattern",
          "level": 3,
          "description": "You create a twisting pattern of colors in a 30-foot Cube [Area of Effect] within range. The pattern appears for a moment and vanishes. Each creature in the area who can see the pattern must succeed on a Wisdom saving throw or have the Charmed condition for the duration."
        },
        {
          "name": "Nondetection",
          "level": 3,
          "description": "For the duration, you hide a target that you touch from Divination spells. The target can be a willing creature, or it can be a place or an object no larger than 10 feet in any dimension. The target can't be targeted by any Divination spell or perceived through magical scrying sensors."
        },
        {
          "name": "Confusion",
          "level": 4,
          "description": "Each creature in a 10-foot-radius Sphere [Area of Effect] centered on a point you choose within range must succeed on a Wisdom saving throw, or that target can't take Bonus Actions or Reactions and must roll 1d10 at the start of each of its turns to determine its behavior for that turn, consultin..."
        },
        {
          "name": "Dimension Door",
          "level": 4,
          "description": "You teleport to a location within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"300 feet upward to the northwest at a 45-degree angle.\" You ca..."
        },
        {
          "name": "Dominate Person",
          "level": 5,
          "description": "One Humanoid you can see within range must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The target has Advantage on the save if you or your allies are fighting it. Whenever the target takes damage, it repeats the save, ending the spell on itself on a success."
        },
        {
          "name": "Modify Memory",
          "level": 5,
          "description": "You attempt to reshape another creature's memories. One creature that you can see within range makes a Wisdom saving throw. If you are fighting the creature, it has Advantage on the save. On a failed save, the target has the Charmed condition for the duration."
        }
      ]
    },
    {
      "name": "War Domain",
      "description": "Inspire Valor and Smite Foes War has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage.",
      "features": [
        {
          "name": "War Domain",
          "description": "Inspire Valor and Smite Foes War has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage. Clerics who tap into the magic of the War Domain excel in battle, inspiring others to fight the good fight or offering acts of violence as prayers."
        },
        {
          "name": "Guided Strike",
          "description": "When you or a creature within 30 feet of you misses with an attack roll, you can expend one use of your Channel Divinity and give that roll a +10 bonus, potentially causing it to hit. When you use this feature to benefit another creature's attack roll, you must take a Reaction to do so."
        },
        {
          "name": "War Domain Spells",
          "description": "Your connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the War Domain Spells table, you thereafter always have the listed spells prepared."
        },
        {
          "name": "War Priest",
          "description": "As a Bonus Action, you can make one attack with a weapon or an Unarmed Strike. You can use this Bonus Action a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a Short Rest or Long Rest."
        },
        {
          "name": "War God's Blessing",
          "description": "You can expend a use of your Channel Divinity to cast Shield of Faith or Spiritual Weapon rather than expending a spell slot. When you cast either spell in this way, the spell doesn't require Concentration. Instead the spell lasts for 1 minute, but it ends early if you cast that spell again, have the Incapacitated condition, or die."
        },
        {
          "name": "Avatar of Battle",
          "description": "You gain Resistance to Bludgeoning, Piercing, and Slashing damage."
        }
      ],
      "levels": [
        {
          "level": 3,
          "features": [
            "War Domain",
            "Guided Strike",
            "War Domain Spells",
            "War Priest"
          ]
        },
        {
          "level": 6,
          "features": [
            "War God's Blessing"
          ]
        },
        {
          "level": 17,
          "features": [
            "Avatar of Battle"
          ]
        }
      ],
      "spells": [
        {
          "name": "Guiding Bolt",
          "level": 1,
          "description": "You hurl a bolt of light toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 4d6 Radiant damage, and the next attack roll made against it before the end of your next turn has Advantage."
        },
        {
          "name": "Shield of Faith",
          "level": 1,
          "description": "A shimmering field surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration."
        },
        {
          "name": "Magic Weapon",
          "level": 2,
          "description": "You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls. The spell ends early if you cast it again."
        },
        {
          "name": "Spiritual Weapon",
          "level": 2,
          "description": "You create a floating, spectral force that resembles a weapon of your choice and lasts for the duration. The force appears within range in a space of your choice, and you can immediately make one melee spell attack against one creature within 5 feet of the force."
        },
        {
          "name": "Crusader's Mantle",
          "level": 3,
          "description": "You radiate a magical aura in a 30-foot Emanation [Area of Effect]. While in the aura, you and your allies each deal an extra 1d4 Radiant damage when hitting with a weapon or an Unarmed Strike."
        },
        {
          "name": "Spirit Guardians",
          "level": 3,
          "description": "Protective spirits flit around you in a 15-foot Emanation [Area of Effect] for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish. When you cast this spell, you can designate creatures to be unaffected by it."
        },
        {
          "name": "Fire Shield",
          "level": 4,
          "description": "Wispy flames wreathe your body for the duration, shedding Bright Light in a 10-foot radius and Dim Light for an additional 10 feet. The flames provide you with a warm shield or a chill shield, as you choose."
        },
        {
          "name": "Freedom of Movement",
          "level": 4,
          "description": "You touch a willing creature. For the duration, the target's movement is unaffected by Difficult Terrain, and spells and other magical effects can neither reduce the target's Speed nor cause the target to have the Paralyzed or Restrained conditions."
        },
        {
          "name": "Hold Monster",
          "level": 5,
          "description": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or have the Paralyzed condition for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success."
        },
        {
          "name": "Steel Wind Strike",
          "level": 5,
          "description": "You flourish the weapon used in the casting and then vanish to strike like the wind. Choose up to five creatures you can see within range. Make a melee spell attack against each target. On a hit, a target takes 6d10 Force damage."
        }
      ]
    },
    {
      "name": "Death Domain",
      "description": "The Death domain is concerned with the forces that cause death, as well as the negative energy that gives rise to undead creatures. Deities such as Chemosh, Myrkul, and Wee Jas are patrons of necromancers, death knights, liches, mummy lords, and vampires.",
      "features": [
        {
          "name": "Death Domain",
          "description": "The Death domain is concerned with the forces that cause death, as well as the negative energy that gives rise to undead creatures. Deities such as Chemosh, Myrkul, and Wee Jas are patrons of necromancers, death knights, liches, mummy lords, and vampires."
        },
        {
          "name": "Bonus Proficiency",
          "description": "When the cleric chooses this domain at 1st level, he or she gains proficiency with martial weapons."
        },
        {
          "name": "Reaper",
          "description": "At 1st level, the cleric learns one necromancy cantrip of his or her choice from any spell list. When the cleric casts a necromancy cantrip that normally targets only one creature, the spell can instead target two creatures within range and within 5 feet of each other."
        },
        {
          "name": "Channel Divinity: Touch of Death",
          "description": "Starting at 2nd level, the cleric can use Channel Divinity to destroy another creature's life force by touch. When the cleric hits a creature with a melee attack, the cleric can use Channel Divinity to deal extra necrotic damage to the target. The damage equals 5 + twice his or her cleric level."
        },
        {
          "name": "Inescapable Destruction",
          "description": "Starting at 6th level, the cleric's ability to channel negative energy becomes more potent. Necrotic damage dealt by the character's cleric spells and Channel Divinity options ignores resistance to necrotic damage."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Divine Strike feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Divine Strike",
          "description": "At 8th level, the cleric gains the ability to infuse his or her weapon strikes with necrotic energy. Once on each of the cleric's turns when he or she hits a creature with a weapon attack, the cleric can cause the attack to deal an extra 1d8 necrotic damage to the target. When the cleric reaches 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Improved Reaper",
          "description": "Starting at 17th level, when the cleric casts a Necromancy spell of 1st through 5th-level that targets only one creature, the spell can instead target two creatures within range and within 5 feet of each other. If the spell consumes its material components, the cleric must provide them for each target."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Death Domain",
            "Bonus Proficiency",
            "Reaper"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Touch of Death"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Touch of Death",
            "Death Domain"
          ]
        },
        {
          "level": 6,
          "features": [
            "Inescapable Destruction"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Divine Strike"
          ]
        },
        {
          "level": 17,
          "features": [
            "Improved Reaper"
          ]
        }
      ]
    },
    {
      "name": "Arcana Domain",
      "description": "Magic is an energy that suffuses the multiverse and that fuels both destruction and creation. Gods of the Arcana domain know the secrets and potential of magic intimately.",
      "features": [
        {
          "name": "Arcana Domain",
          "description": "Magic is an energy that suffuses the multiverse and that fuels both destruction and creation. Gods of the Arcana domain know the secrets and potential of magic intimately. For some of these gods, magical knowledge is a great responsibility that comes with a special understanding of the nature of reality. Other gods of Arcana see magic as pure power, to be used as its wielder sees fit."
        },
        {
          "name": "Arcane Initiate",
          "description": "When you choose this domain at 1st level, you gain proficiency in the Arcana skill, and you gain two cantrips of your choice from the wizard spell list. For you, these cantrips count as cleric cantrips."
        },
        {
          "name": "Channel Divinity: Arcane Abjuration",
          "description": "Starting at 2nd level, you can use your Channel Divinity to abjure otherworldly creatures. As an action, you present your holy symbol, and one celestial, elemental, fey, or fiend of your choice that is within 30 feet of you must make a Wisdom saving throw, provided that the creature can see or hear you."
        },
        {
          "name": "Spell Breaker",
          "description": "Starting at 6th level, when you restore hit points to an ally with a spell of 1st level or higher, you can also end one spell of your choice on that creature. The level of the spell you end must be equal to or lower than the level of the spell slot you use to cast the healing spell."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Potent Spellcasting feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Potent Spellcasting",
          "description": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."
        },
        {
          "name": "Arcane Mastery",
          "description": "At 17th level, you choose four spells from the Wizard spell list, one from each of the following levels: 6th, 7th, 8th, and 9th. You add them to your list of domain spells. Like your other domain spells, they are always prepared and count as cleric spells for you."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Arcana Domain",
            "Arcane Initiate"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Arcane Abjuration"
          ]
        },
        {
          "level": 3,
          "features": [
            "Arcana Domain",
            "Channel Divinity: Arcane Abjuration"
          ]
        },
        {
          "level": 6,
          "features": [
            "Spell Breaker"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Potent Spellcasting"
          ]
        },
        {
          "level": 17,
          "features": [
            "Arcane Mastery"
          ]
        }
      ]
    },
    {
      "name": "Ambition Domain (PSA)",
      "description": "Bontu has fully embraced this dictum, and though she expends little effort in teaching it, she surely leads by example. Her viziers subtly plant the seeds that flower into the ambition the God-Pharaoh desires.",
      "features": [
        {
          "name": "Ambition Domain (PSA)",
          "description": "Bontu has fully embraced this dictum, and though she expends little effort in teaching it, she surely leads by example. Her viziers subtly plant the seeds that flower into the ambition the God-Pharaoh desires."
        },
        {
          "name": "Warding Flare",
          "description": "When you choose this domain at 1st level, you can interpose divine light between yourself and an attacking enemy. When you are attacked by a creature within 30 feet of you that you can see, you can use your reaction to impose disadvantage on the attack roll, causing light to flare before the attacker before it hits or misses. An attacker that can't be blinded is immune to this feature."
        },
        {
          "name": "Channel Divinity: Invoke Duplicity",
          "description": "Starting at 2nd level, you can use your Channel Divinity to create an illusory duplicate of yourself. As an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentration on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you."
        },
        {
          "name": "Channel Divinity: Cloak of Shadows",
          "description": "Starting at 6th level, you can use your Channel Divinity to vanish. As an action, you become invisible until the end of your next turn. You become visible if you attack or cast a spell."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Potent Spellcasting feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Potent Spellcasting",
          "description": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."
        },
        {
          "name": "Improved Duplicity",
          "description": "At 17th level, you can create up to four duplicates of yourself, instead of one, when you use Invoke Duplicity. As a bonus action on your turn, you can move any number of them up to 30 feet, to a maximum range of 120 feet."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Ambition Domain (PSA)",
            "Warding Flare"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Invoke Duplicity"
          ]
        },
        {
          "level": 3,
          "features": [
            "Ambition Domain (PSA)",
            "Channel Divinity: Invoke Duplicity"
          ]
        },
        {
          "level": 6,
          "features": [
            "Channel Divinity: Cloak of Shadows"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Potent Spellcasting"
          ]
        },
        {
          "level": 17,
          "features": [
            "Improved Duplicity"
          ]
        }
      ]
    },
    {
      "name": "Knowledge Domain (PSA)",
      "description": "Kefnet's task is to pass on this teaching of the God-Pharaoh and elucidate its meaning. He teaches that the afterlife will be inhabited only by those who have proved by their wits that they are worthy of dwelling in the glorious presence of the God-Pharaoh.",
      "features": [
        {
          "name": "Knowledge Domain (PSA)",
          "description": "Kefnet's task is to pass on this teaching of the God-Pharaoh and elucidate its meaning. He teaches that the afterlife will be inhabited only by those who have proved by their wits that they are worthy of dwelling in the glorious presence of the God-Pharaoh. He trains acolytes and initiates to push their limits and challenge their mental capacity with spells of ever-greater power."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Knowledge Domain (PSA)"
          ]
        },
        {
          "level": 3,
          "features": [
            "Knowledge Domain (PSA)"
          ]
        }
      ]
    },
    {
      "name": "Solidarity Domain (PSA)",
      "description": "Oketra is charged with expounding upon this teaching of the God-Pharaoh, instilling in every initiate the virtue of solidarity. She forges each group of children into a crop of acolytes with just one purpose: to be judged worthy of a glorious afterlife.",
      "features": [
        {
          "name": "Solidarity Domain (PSA)",
          "description": "Oketra is charged with expounding upon this teaching of the God-Pharaoh, instilling in every initiate the virtue of solidarity. She forges each group of children into a crop of acolytes with just one purpose: to be judged worthy of a glorious afterlife. And she instills in each crop the ability to unite in a single action in pursuit of that purpose."
        },
        {
          "name": "Bonus Proficiency",
          "description": "When you choose this domain at 1st level, you gain proficiency with heavy armor."
        },
        {
          "name": "Solidarity's Action",
          "description": "Also at 1st level, when you take the Help action to aid an ally's attack, you can make one weapon attack as a bonus action. You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain expended uses when you finish a long rest."
        },
        {
          "name": "Channel Divinity: Preserve Life",
          "description": "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured. As an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum."
        },
        {
          "name": "Oketra's Blessing",
          "description": "At 6th level, when a creature within 30 feet of you makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the attack hits or misses."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Divine Strike feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Supreme Healing",
          "description": "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Solidarity Domain (PSA)",
            "Bonus Proficiency",
            "Solidarity's Action"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Preserve Life"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Preserve Life",
            "Solidarity Domain (PSA)"
          ]
        },
        {
          "level": 6,
          "features": [
            "Oketra's Blessing"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Divine Strike"
          ]
        },
        {
          "level": 17,
          "features": [
            "Supreme Healing"
          ]
        }
      ]
    },
    {
      "name": "Strength Domain (PSA)",
      "description": "It falls to Rhonas to instill this teaching in those who would enter the afterlife—but to his mind, the words themselves don't matter. Strength can't be taught. It must be built through practice and training.",
      "features": [
        {
          "name": "Strength Domain (PSA)",
          "description": "It falls to Rhonas to instill this teaching in those who would enter the afterlife—but to his mind, the words themselves don't matter. Strength can't be taught. It must be built through practice and training. Rhonas demonstrates his teachings by his example, rather than by giving his students any kind of academic instruction."
        },
        {
          "name": "Acolyte of Strength",
          "description": "At 1st level, you learn one druid cantrip of your choice. You also gain proficiency in one of the following skills of your choice: Animal Handling, Athletics, Nature, or Survival."
        },
        {
          "name": "Bonus Proficiency",
          "description": "Also at 1st level, you gain proficiency with heavy armor."
        },
        {
          "name": "Channel Divinity: Feat of Strength",
          "description": "At 2nd level, you can use your Channel Divinity to enhance your physical might. When you make an attack roll, ability check, or saving throw using Strength, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the roll succeeds or fails."
        },
        {
          "name": "Rhonas's Blessing",
          "description": "At 6th level, when a creature within 30 feet of you makes an attack roll, ability check, or saving throw using Strength, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity. You make this choice after you see the roll, but before the DM says whether the roll succeeds or fail."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Divine Strike feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Avatar of Battle",
          "description": "At 17th level, you gain resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Strength Domain (PSA)",
            "Acolyte of Strength",
            "Bonus Proficiency"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Feat of Strength"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Feat of Strength",
            "Strength Domain (PSA)"
          ]
        },
        {
          "level": 6,
          "features": [
            "Rhonas's Blessing"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Divine Strike"
          ]
        },
        {
          "level": 17,
          "features": [
            "Avatar of Battle"
          ]
        }
      ]
    },
    {
      "name": "Zeal Domain (PSA)",
      "description": "The God-Pharaoh expects those he welcomes into the afterlife to desire it above all other pleasures and achievements, and for them to show their dedication, passion, and fervor through their actions.",
      "features": [
        {
          "name": "Zeal Domain (PSA)",
          "description": "The God-Pharaoh expects those he welcomes into the afterlife to desire it above all other pleasures and achievements, and for them to show their dedication, passion, and fervor through their actions. Hazoret is charged with cultivating this zeal in the initiates who come under her care, and she has undertaken the task with appropriate enthusiasm."
        },
        {
          "name": "Bonus Proficiencies",
          "description": "At 1st level, you gain proficiency with martial weapons and heavy armor."
        },
        {
          "name": "Priest of Zeal",
          "description": "From 1st level, Hazoret delivers bolts of inspiration to you while you are engaged in battle. When you use the Attack action, you can make one weapon attack as a bonus action. You can use this feature a number of times equal to your Wisdom modifier (a minimum of once). You regain all expended uses when you finish a long rest."
        },
        {
          "name": "Channel Divinity: Consuming Fervor",
          "description": "Starting at 2nd level, you can use your Channel Divinity to channel your zeal into unchecked ferocity. When you roll fire or thunder damage, you can use your Channel Divinity to deal maximum damage instead of rolling."
        },
        {
          "name": "Resounding Strike",
          "description": "At 6th level, when you deal thunder damage to a Large or smaller creature, you can also push it up to 10 feet away from you."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Divine Strike feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Blaze of Glory",
          "description": "Starting at 17th level, you can delay death for an instant to perform a final heroic act. When you are reduced to 0 hit points by an attacker you can see, even if you would be killed outright, you can use your reaction to move up to your speed toward the attacker and make one melee weapon attack against it, as long as the movement brings it within your reach. You make this attack with advantage."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Zeal Domain (PSA)",
            "Bonus Proficiencies",
            "Priest of Zeal"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Consuming Fervor"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Consuming Fervor",
            "Zeal Domain (PSA)"
          ]
        },
        {
          "level": 6,
          "features": [
            "Resounding Strike"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Divine Strike"
          ]
        },
        {
          "level": 17,
          "features": [
            "Blaze of Glory"
          ]
        }
      ]
    },
    {
      "name": "Forge Domain",
      "description": "The gods of the forge are patrons of artisans who work with metal, from a humble blacksmith who keeps a village in horseshoes and plow blades to the mighty elf artisan whose diamond-tipped arrows of mithral have felled demon lords.",
      "features": [
        {
          "name": "Forge Domain",
          "description": "The gods of the forge are patrons of artisans who work with metal, from a humble blacksmith who keeps a village in horseshoes and plow blades to the mighty elf artisan whose diamond-tipped arrows of mithral have felled demon lords. The gods of the forge teach that, with patience and hard work, even the most intractable metal can be transformed from a lump of ore to a beautifully wrought object."
        },
        {
          "name": "Blessing of the Forge",
          "description": "At 1st level, you gain the ability to imbue magic into a weapon or armor. At the end of a long rest, you can touch one nonmagical object that is a suit of armor or a simple or martial weapon. Until the end of your next long rest or until you die, the object becomes a magic item, granting a +1 bonus to AC if it's armor or a +1 bonus to attack and damage rolls if it's a weapon."
        },
        {
          "name": "Bonus Proficiency",
          "description": "When you choose this domain at 1st level, you gain proficiency with heavy armor and smith's tools."
        },
        {
          "name": "Channel Divinity: Artisan's Blessing",
          "description": "Starting at 2nd level, you can use your Channel Divinity to create simple items. You conduct an hour-long ritual that crafts a nonmagical item that must include some metal: a simple or martial weapon, a suit of armor, ten pieces of ammunition, a set of tools, or another metal object (see chapter 5, \"Equipment,\" in the Player's Handbook for examples of these items)."
        },
        {
          "name": "Soul of the Forge",
          "description": "Starting at 6th level, your mastery of the forge grants you special abilities: You gain resistance to fire damage. While wearing heavy armor, you gain a +1 bonus to AC."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Divine Strike feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with the fiery power of the forge. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 fire damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Saint of Forge and Fire",
          "description": "At 17th level, your blessed affinity with fire and metal becomes more powerful: You gain immunity to fire damage, While wearing heavy armor, you have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Forge Domain",
            "Blessing of the Forge",
            "Bonus Proficiency"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Artisan's Blessing"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Artisan's Blessing",
            "Forge Domain"
          ]
        },
        {
          "level": 6,
          "features": [
            "Soul of the Forge"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Divine Strike"
          ]
        },
        {
          "level": 17,
          "features": [
            "Saint of Forge and Fire"
          ]
        }
      ]
    },
    {
      "name": "Grave Domain",
      "description": "Gods of the grave watch over the line between life and death. To these deities, death and the afterlife are a foundational part of the multiverse. To desecrate the peace of the dead is an abomination.",
      "features": [
        {
          "name": "Grave Domain",
          "description": "Gods of the grave watch over the line between life and death. To these deities, death and the afterlife are a foundational part of the multiverse. To desecrate the peace of the dead is an abomination. Deities of the grave include Kelemvor, Wee Jas, the ancestral spirits of the Undying Court, Hades, Anubis, and Osiris."
        },
        {
          "name": "Circle of Mortality",
          "description": "At 1st level, you gain the ability to manipulate the line between life and death. When you would normally roll one or more dice to restore hit points with a spell to a creature at 0 hit points, you instead use the highest number possible for each die. In addition, you learn the spare the dying cantrip, which doesn't count against the number of cleric cantrips you know."
        },
        {
          "name": "Eyes of the Grave",
          "description": "At 1st level, you gain the ability to occasionally sense the presence of the undead, whose existence is an insult to the natural cycle of life. As an action, you can open your awareness to magically detect undead. Until the end of your next turn, you know the location of any undead within 60 feet of you that isn't behind Cover and that isn't protected from divination magic."
        },
        {
          "name": "Channel Divinity: Path to the Grave",
          "description": "Starting at 2nd level, you can use your Channel Divinity to mark another creature's life force for termination. As an action, you choose one creature you can see within 30 feet of you, cursing it until the end of your next turn. The next time you or an ally of yours hits the cursed creature with an attack, the creature has vulnerability to all of that attack's damage, and then the curse ends."
        },
        {
          "name": "Sentinel at Death's Door",
          "description": "At 6th level, you gain the ability to impede death's progress. As a reaction when you or a creature you can see within 30 feet of you suffers a critical hit, you can turn that hit into a normal hit. Any effects triggered by a critical hit are canceled. You can use this feature a number of times equal to your Wisdom modifier (minimum of once)."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Potent Spellcasting feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Potent Spellcasting",
          "description": "Starting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip."
        },
        {
          "name": "Keeper of Souls",
          "description": "Starting at 17th level, you can seize a trace of vitality from a parting soul and use it to heal the living. When an enemy you can see dies within 60 feet of you, you or one creature of your choice that is within 60 feet of you regains hit points equal to the enemy's number of Hit Dice. You can use this feature only if you aren't incapacitated."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Grave Domain",
            "Circle of Mortality",
            "Eyes of the Grave"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Path to the Grave"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Path to the Grave",
            "Grave Domain"
          ]
        },
        {
          "level": 6,
          "features": [
            "Sentinel at Death's Door"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Potent Spellcasting"
          ]
        },
        {
          "level": 17,
          "features": [
            "Keeper of Souls"
          ]
        }
      ]
    },
    {
      "name": "Order Domain",
      "description": "The Order Domain represents discipline, as well as devotion to a society or an institution and strict obedience to the laws governing it. On Ravnica, the domain is favored by clerics of the Azorius Senate, who use it to maintain and enforce the law, and of the Orzhov Syndicate, who exploit law an...",
      "features": [
        {
          "name": "Order Domain",
          "description": "The Order Domain represents discipline, as well as devotion to a society or an institution and strict obedience to the laws governing it. On Ravnica, the domain is favored by clerics of the Azorius Senate, who use it to maintain and enforce the law, and of the Orzhov Syndicate, who exploit law and order for their personal gain."
        },
        {
          "name": "Bonus Proficiencies",
          "description": "When you choose this domain at 1st level, you gain proficiency with heavy armor. You also gain proficiency in the Intimidation or Persuasion skill (your choice)."
        },
        {
          "name": "Voice of Authority",
          "description": "Starting at 1st level, you can invoke the power of law to drive an ally to attack. If you cast a spell with a spell slot of 1st level or higher and target an ally with the spell, that ally can use their reaction immediately after the spell to make one weapon attack against a creature of your choice that you can see."
        },
        {
          "name": "Channel Divinity: Order's Demand",
          "description": "Starting at 2nd level, you can use your Channel Divinity to exert an intimidating presence over others. As an action, you present your holy symbol, and each creature of your choice that can see or hear you within 30 feet of you must succeed on a Wisdom saving throw or be charmed by you until the end of your next turn or until the charmed creature takes any damage."
        },
        {
          "name": "Embodiment of the Law",
          "description": "At 6th level, you become remarkably adept at channeling magical energy to compel others. If you cast a spell of the enchantment school using a spell slot of 1st level or higher, you can change the spell's casting time to 1 bonus action for this casting, provided the spell's casting time is normally 1 action."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Divine Strike feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Divine Strike",
          "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 psychic damage to the target. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Order's Wrath",
          "description": "Starting at 17th level, enemies you designate for destruction wilt under the combined efforts of you and your allies. If you deal your Divine Strike damage to a creature on your turn, you can curse that creature until the start of your next turn. The next time one of your allies hits the cursed creature with an attack, the target also takes 2d8 psychic damage, and the curse ends."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Order Domain",
            "Bonus Proficiencies",
            "Voice of Authority"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Order's Demand"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Order's Demand",
            "Order Domain"
          ]
        },
        {
          "level": 6,
          "features": [
            "Embodiment of the Law"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Divine Strike"
          ]
        },
        {
          "level": 17,
          "features": [
            "Order's Wrath"
          ]
        }
      ]
    },
    {
      "name": "Peace Domain",
      "description": "The balm of peace thrives at the heart of healthy communities, between friendly nations, and in the souls of the kindhearted. The gods of peace inspire people of all sorts to resolve conflict and to stand up against those forces that try to prevent peace from flourishing.",
      "features": [
        {
          "name": "Peace Domain",
          "description": "The balm of peace thrives at the heart of healthy communities, between friendly nations, and in the souls of the kindhearted. The gods of peace inspire people of all sorts to resolve conflict and to stand up against those forces that try to prevent peace from flourishing. See the Peace Deities table for a list of some of the gods associated with this domain."
        },
        {
          "name": "Emboldening Bond",
          "description": "1st-level Peace Domain feature You can forge an empowering bond among people who are at peace with one another. As an action, you choose a number of willing creatures within 30 feet of you (this can include yourself) equal to your proficiency bonus. You create a magical bond among them for 10 minutes or until you use this feature again."
        },
        {
          "name": "Implement of Peace",
          "description": "1st-level Peace Domain feature You gain proficiency in the Insight, Performance, or Persuasion skill (your choice)."
        },
        {
          "name": "Channel Divinity: Balm of Peace",
          "description": "2nd-level Peace Domain feature You can use your Channel Divinity to make your very presence a soothing balm. As an action, you can move up to your speed, without provoking opportunity attacks, and when you move within 5 feet of any other creature during this action, you can restore a number of hit points to that creature equal to 2d6 + your Wisdom modifier (minimum of 1 hit point)."
        },
        {
          "name": "Protective Bond",
          "description": "6th-level Peace Domain feature The bond you forge between people helps them protect each other. When a creature affected by your Emboldening Bond feature is about to take damage, a second bonded creature within 30 feet of the first can use its reaction to teleport to an unoccupied space within 5 feet of the first creature. The second creature then takes all the damage instead."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Potent Spellcasting feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Potent Spellcasting",
          "description": "8th-level Peace Domain feature You add your Wisdom modifier to the damage you deal with any cleric cantrip."
        },
        {
          "name": "Expansive Bond",
          "description": "17th-level Peace Domain feature The benefits of your Emboldening Bond and Protective Bond features now work when the creatures are within 60 feet of each other. Moreover, when a creature uses Protective Bond to take someone else's damage, the creature has resistance to that damage."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Peace Domain",
            "Emboldening Bond",
            "Implement of Peace"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Balm of Peace"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Balm of Peace",
            "Peace Domain"
          ]
        },
        {
          "level": 6,
          "features": [
            "Protective Bond"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Potent Spellcasting"
          ]
        },
        {
          "level": 17,
          "features": [
            "Expansive Bond"
          ]
        }
      ]
    },
    {
      "name": "Twilight Domain",
      "description": "The twilit transition from light into darkness often brings calm and even joy, as the day's labors end and the hours of rest begin. The darkness can also bring terrors, but the gods of twilight guard against the horrors of the night.",
      "features": [
        {
          "name": "Twilight Domain",
          "description": "The twilit transition from light into darkness often brings calm and even joy, as the day's labors end and the hours of rest begin. The darkness can also bring terrors, but the gods of twilight guard against the horrors of the night."
        },
        {
          "name": "Bonus Proficiencies",
          "description": "1st-level Twilight Domain feature You gain proficiency with martial weapons and heavy armor."
        },
        {
          "name": "Eyes of Night",
          "description": "1st-level Twilight Domain feature You can see through the deepest gloom. You have darkvision out to a range of 300 feet. In that radius, you can see in dim light as if it were bright light and in darkness as if it were dim light."
        },
        {
          "name": "Vigilant Blessing",
          "description": "1st-level Twilight Domain feature The night has taught you to be vigilant. As an action, you give one creature you touch (including possibly yourself) advantage on the next initiative roll the creature makes. This benefit ends immediately after the roll or if you use this feature again."
        },
        {
          "name": "Channel Divinity: Twilight Sanctuary",
          "description": "2nd-level Twilight Domain feature You can use your Channel Divinity to refresh your allies with soothing twilight. As an action, you present your holy symbol, and a sphere of twilight emanates from you. The sphere is centered on you, has a 30-foot radius, and is filled with dim light. The sphere moves with you, and it lasts for 1 minute or until you are incapacitated or die."
        },
        {
          "name": "Steps of Night",
          "description": "6th-level Twilight Domain feature You can draw on the mystical power of night to rise into the air. As a bonus action when you are in dim light or darkness, you can magically give yourself a flying speed equal to your walking speed for 1 minute. You can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
        },
        {
          "name": "Blessed Strikes",
          "description": "8th-level cleric {@variantrule optional class features, which replaces the Divine Strike feature} You are blessed with divine might in battle. When a creature takes damage from one of your cantrips or weapon attacks, you can also deal 1d8 radiant damage to that creature. Once you deal this damage, you can't use this feature again until the start of your next turn."
        },
        {
          "name": "Divine Strike",
          "description": "8th-level Twilight Domain feature You gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage. When you reach 14th level, the extra damage increases to 2d8."
        },
        {
          "name": "Twilight Shroud",
          "description": "17th-level Twilight Domain feature The twilight that you summon offers a protective embrace: you and your allies have Cover while in the sphere created by your Twilight Sanctuary."
        }
      ],
      "levels": [
        {
          "level": 1,
          "features": [
            "Twilight Domain",
            "Bonus Proficiencies",
            "Eyes of Night",
            "Vigilant Blessing"
          ]
        },
        {
          "level": 2,
          "features": [
            "Channel Divinity: Twilight Sanctuary"
          ]
        },
        {
          "level": 3,
          "features": [
            "Channel Divinity: Twilight Sanctuary",
            "Twilight Domain"
          ]
        },
        {
          "level": 6,
          "features": [
            "Steps of Night"
          ]
        },
        {
          "level": 8,
          "features": [
            "Blessed Strikes",
            "Divine Strike"
          ]
        },
        {
          "level": 17,
          "features": [
            "Twilight Shroud"
          ]
        }
      ]
    }
  ]
}