{
  "name": "Druid",
  "description": "A priest of the Old Faith, wielding the powers of nature and adopting animal forms.",
  "hit_die": 8,
  "proficiencies": [
    0,
    3,
    4
  ],
  "saving_throws": [
    3,
    4
  ],
  "features": [
    {
      "name": "Druidic",
      "description": "You know Druidic, the secret language of Druids. While learning this ancient tongue, you also unlocked the magic of communicating with animals; you always have the Speak with Animals spell prepared. You can use Druidic to leave hidden messages. You and others who know Druidic automatically spot such a message."
    },
    {
      "name": "Magician",
      "description": "You know one extra cantrip from the Druid spell list. In addition, your mystical connection to nature gives you a bonus to your Intelligence (Arcana or Nature) checks. The bonus equals your Wisdom modifier (minimum bonus of +1)."
    },
    {
      "name": "Primal Order",
      "description": "You have dedicated yourself to one of the following sacred roles of your choice."
    },
    {
      "name": "Spellcasting",
      "description": "You have learned to cast spells through studying the mystical forces of nature. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Druid spells, which appear on the Druid spell list later in the class's description. Cantrips: You know two cantrips of your choice from the Druid spell list. Druidcraft and Produce Flame are recommended.",
      "spells": {
        "casting_ability": 4,
        "list": {
          "from": "spells/druid.json"
        },
        "levels": [
          {
            "cantrips": 2
          },
          {
            "cantrips": 2
          },
          {
            "cantrips": 2
          },
          {
            "cantrips": 3
          },
          {
            "cantrips": 3
          },
          {
            "cantrips": 3
          },
          {
            "cantrips": 3
          },
          {
            "cantrips": 3
          },
          {
            "cantrips": 3
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          },
          {
            "cantrips": 4
          }
        ],
        "caster_coef": 1
      }
    },
    {
      "name": "Warden",
      "description": "Trained for battle, you gain proficiency with Martial weapons and training with Medium armor."
    },
    {
      "name": "Wild Companion",
      "description": "You can summon a nature spirit that assumes an animal form to aid you. As a Magic action, you can expend a spell slot or a use of Wild Shape to cast the Find Familiar spell without Material components. When you cast the spell in this way, the familiar is Fey and disappears when you finish a Long Rest."
    },
    {
      "name": "Wild Shape",
      "description": "The power of nature allows you to assume the form of an animal. As a Bonus Action, you shape-shift into a Beast form that you have learned for this feature (see \"Known Forms\" below). You stay in that form for a number of hours equal to half your Druid level or until you use Wild Shape again, have the Incapacitated condition, or die. You can also leave the form early as a Bonus Action."
    },
    {
      "name": "Druid Subclass",
      "description": "You gain a Druid subclass of your choice. A subclass is a specialization that grants you features at certain Druid levels. For the rest of your career, you gain each of your subclass's features that are of your Druid level or lower."
    },
    {
      "name": "Ability Score Improvement",
      "description": "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Druid levels 8, 12, and 16."
    },
    {
      "name": "Wild Resurgence",
      "description": "Once on each of your turns, if you have no uses of Wild Shape left, you can give yourself one use by expending a spell slot (no action required). In addition, you can expend one use of Wild Shape (no action required) to give yourself a level 1 spell slot, but you can't do so again until you finish a Long Rest."
    },
    {
      "name": "Subclass Feature",
      "description": "You gain a feature from your Druid Subclass."
    },
    {
      "name": "Elemental Fury",
      "description": "The might of the elements flows through you. You gain one of the following options of your choice."
    },
    {
      "name": "Potent Spellcasting",
      "description": "Add your Wisdom modifier to the damage you deal with any Druid cantrip."
    },
    {
      "name": "Primal Strike",
      "description": "Once on each of your turns when you hit a creature with an attack roll using a weapon or a Beast form's attack in Wild Shape, you can cause the target to take an extra 1d8 Cold, Fire, Lightning, or Thunder damage (choose when you hit)."
    },
    {
      "name": "Improved Elemental Fury",
      "description": "The option you chose for Elemental Fury grows more powerful, as detailed below. Potent Spellcasting: When you cast a Druid cantrip with a range of 10 feet or greater, the spell's range increases by 300 feet. Primal Strike: The extra damage of your Primal Strike increases to 2d8."
    },
    {
      "name": "Beast Spells",
      "description": "While using Wild Shape, you can cast spells in Beast form, except for any spell that has a Material component with a cost specified or that consumes its Material component."
    },
    {
      "name": "Epic Boon",
      "description": "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Dimensional Travel is recommended."
    },
    {
      "name": "Archdruid",
      "description": "The vitality of nature constantly blooms within you, granting you the following benefits. Evergreen Wild Shape: Whenever you roll Initiative and have no uses of Wild Shape left, you regain one expended use of it. Nature Magician: You can convert uses of Wild Shape into a spell slot (no action required)."
    }
  ],
  "levels": [
    {
      "features": [
        "Druidic",
        "Magician",
        "Primal Order",
        "Spellcasting",
        "Warden"
      ]
    },
    {
      "features": [
        "Wild Companion",
        "Wild Shape"
      ]
    },
    {
      "features": [
        "Druid Subclass"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Wild Resurgence"
      ]
    },
    {
      "features": [
        "Subclass Feature"
      ]
    },
    {
      "features": [
        "Elemental Fury",
        "Potent Spellcasting",
        "Primal Strike"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Subclass Feature"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Subclass Feature"
      ]
    },
    {
      "features": [
        "Improved Elemental Fury"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Beast Spells"
      ]
    },
    {
      "features": [
        "Epic Boon"
      ]
    },
    {
      "features": [
        "Archdruid"
      ]
    }
  ],
  "subclasses": [
    {
      "name": "Circle of the Land",
      "description": "Celebrate Connection to the Natural World The Circle of the Land comprises mystics and sages who safeguard ancient knowledge and rites. These Druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic.",
      "features": [
        {
          "name": "Circle of the Land",
          "description": "Celebrate Connection to the Natural World The Circle of the Land comprises mystics and sages who safeguard ancient knowledge and rites. These Druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle's wisest members preside as the chief priests of their communities."
        },
        {
          "name": "Circle of the Land Spells",
          "description": "Whenever you finish a Long Rest, choose one type of land: arid, polar, temperate, or tropical. Consult the table below that corresponds to the chosen type; you have the spells listed for your Druid level and lower prepared.",
          "spells": {
            "casting_ability": 4,
            "list": [
              {
                "name": "Acid Splash",
                "level": 0,
                "description": "You create an acidic bubble at a point within range, where it explodes in a 5-foot-radius Sphere [Area of Effect]. Each creature in that Sphere [Area of Effect] must succeed on a Dexterity saving throw or take 1d6 Acid damage."
              },
              {
                "name": "Fire Bolt",
                "level": 0,
                "description": "You hurl a mote of fire at a creature or an object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 Fire damage. A flammable object hit by this spell starts burning if it isn't being worn or carried."
              },
              {
                "name": "Ray of Frost",
                "level": 0,
                "description": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 Cold damage, and its Speed is reduced by 10 feet until the start of your next turn."
              },
              {
                "name": "Shocking Grasp",
                "level": 0,
                "description": "Lightning springs from you to a creature that you try to touch. Make a melee spell attack against the target. On a hit, the target takes 1d8 Lightning damage, and it can't make Opportunity Attack until the start of its next turn."
              },
              {
                "name": "Burning Hands",
                "level": 1,
                "description": "A thin sheet of flames shoots forth from you. Each creature in a 15-foot Cone [Area of Effect] makes a Dexterity saving throw, taking 3d6 Fire damage on a failed save or half as much damage on a successful one."
              },
              {
                "name": "Fog Cloud",
                "level": 1,
                "description": "You create a 20-foot-radius Sphere [Area of Effect] of fog centered on a point within range. The Sphere [Area of Effect] is Heavily Obscured. It lasts for the duration or until a strong wind (such as one created by Gust of Wind) disperses it."
              },
              {
                "name": "Ray of Sickness",
                "level": 1,
                "description": "You shoot a greenish ray at a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 Poison damage and has the Poisoned condition until the end of your next turn."
              },
              {
                "name": "Sleep",
                "level": 1,
                "description": "Each creature of your choice in a 5-foot-radius Sphere [Area of Effect] centered on a point within range must succeed on a Wisdom saving throw or have the Incapacitated condition until the end of its next turn, at which point it must repeat the save."
              },
              {
                "name": "Blur",
                "level": 2,
                "description": "Your body becomes blurred. For the duration, any creature has Disadvantage on attack rolls against you. An attacker is immune to this effect if it perceives you with Blindsight or Truesight."
              },
              {
                "name": "Hold Person",
                "level": 2,
                "description": "Choose a Humanoid that you can see within range. The target must succeed on a Wisdom saving throw or have the Paralyzed condition for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success."
              },
              {
                "name": "Misty Step",
                "level": 2,
                "description": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space you can see."
              },
              {
                "name": "Web",
                "level": 2,
                "description": "You conjure a mass of sticky webbing at a point within range. The webs fill a 20-foot Cube [Area of Effect] there for the duration. The webs are Difficult Terrain, and the area within them is Lightly Obscured."
              },
              {
                "name": "Fireball",
                "level": 3,
                "description": "A bright streak flashes from you to a point you choose within range and then blossoms with a low roar into a fiery explosion. Each creature in a 20-foot-radius Sphere [Area of Effect] centered on that point makes a Dexterity saving throw, taking 8d6 Fire damage on a failed save or half as much da..."
              },
              {
                "name": "Lightning Bolt",
                "level": 3,
                "description": "A stroke of lightning forming a 100-foot-long, 5-foot-wide Line [Area of Effect] blasts out from you in a direction you choose. Each creature in the Line [Area of Effect] makes a Dexterity saving throw, taking 8d6 Lightning damage on a failed save or half as much damage on a successful one."
              },
              {
                "name": "Sleet Storm",
                "level": 3,
                "description": "Until the spell ends, sleet falls in a 40-foot-tall, 20-foot-radius Cylinder [Area of Effect] centered on a point you choose within range. The area is Heavily Obscured, and exposed flames in the area are doused. Ground in the Cylinder [Area of Effect] is Difficult Terrain."
              },
              {
                "name": "Stinking Cloud",
                "level": 3,
                "description": "You create a 20-foot-radius Sphere [Area of Effect] of yellow, nauseating gas centered on a point within range. The cloud is Heavily Obscured. The cloud lingers in the air for the duration or until a strong wind (such as the one created by Gust of Wind) disperses it."
              },
              {
                "name": "Blight",
                "level": 4,
                "description": "A creature that you can see within range makes a Constitution saving throw, taking 8d8 Necrotic damage on a failed save or half as much damage on a successful one. A Plant creature automatically fails the save. Alternatively, target a nonmagical plant that isn't a creature, such as a tree or shrub."
              },
              {
                "name": "Freedom of Movement",
                "level": 4,
                "description": "You touch a willing creature. For the duration, the target's movement is unaffected by Difficult Terrain, and spells and other magical effects can neither reduce the target's Speed nor cause the target to have the Paralyzed or Restrained conditions."
              },
              {
                "name": "Ice Storm",
                "level": 4,
                "description": "Hail falls in a 20-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range. Each creature in the Cylinder [Area of Effect] makes a Dexterity saving throw."
              },
              {
                "name": "Polymorph",
                "level": 4,
                "description": "You attempt to transform a creature that you can see within range into a Beast. The target must succeed on a Wisdom saving throw or shape-shift into Beast form for the duration."
              },
              {
                "name": "Cone of Cold",
                "level": 5,
                "description": "You unleash a blast of cold air. Each creature in a 60-foot Cone [Area of Effect] originating from you makes a Constitution saving throw, taking 8d8 Cold damage on a failed save or half as much damage on a successful one. A creature killed by this spell becomes a frozen statue until it thaws."
              },
              {
                "name": "Insect Plague",
                "level": 5,
                "description": "Swarming locusts fill a 20-foot-radius Sphere [Area of Effect] centered on a point you choose within range. The Sphere [Area of Effect] remains for the duration, and its area is Lightly Obscured and Difficult Terrain."
              },
              {
                "name": "Tree Stride",
                "level": 5,
                "description": "You gain the ability to enter a tree and move from inside it to inside another tree of the same kind within 500 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree."
              },
              {
                "name": "Wall of Stone",
                "level": 5,
                "description": "A nonmagical wall of solid stone springs into existence at a point you choose within range. The wall is 6 inches thick and is composed of ten 10-foot-by-10-foot panels. Each panel must be contiguous with another panel."
              }
            ]
          }
        },
        {
          "name": "Land's Aid",
          "description": "As a Magic action, you can expend a use of your Wild Shape and choose a point within 60 feet of yourself. Vitality-giving flowers and life-draining thorns appear for a moment in a 10-foot-radius Sphere [Area of Effect] centered on that point."
        },
        {
          "name": "Natural Recovery",
          "description": "You can cast one of the level 1+ spells that you have prepared from your Circle Spells feature without expending a spell slot, and you must finish a Long Rest before you do so again. In addition, when you finish a Short Rest, you can choose expended spell slots to recover."
        },
        {
          "name": "Nature's Ward",
          "description": "You are immune to the Poisoned condition, and you have Resistance to a damage type associated with your current land choice in the Circle Spells feature, as shown in the Nature's Ward table."
        },
        {
          "name": "Nature's Sanctuary",
          "description": "As a Magic action, you can expend a use of your Wild Shape and cause spectral trees and vines to appear in a 15-foot Cube [Area of Effect] on the ground within 120 feet of yourself. They last there for 1 minute or until you have the Incapacitated condition or die. You and your allies have Cover while in that area, and your allies gain the current Resistance of your Nature's Ward while there."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Circle of the Land",
            "Circle of the Land Spells",
            "Land's Aid"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Natural Recovery"
          ]
        },
        "10": {
          "level": 10,
          "features": [
            "Nature's Ward"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Nature's Sanctuary"
          ]
        }
      }
    },
    {
      "name": "Circle of the Moon",
      "description": "You can channel lunar magic when you assume a Wild Shape form, granting you the benefits below. Challenge Rating: The maximum Challenge Rating for the form equals your Druid level divided by 3 (round down).",
      "features": [
        {
          "name": "Circle Forms",
          "description": "You can channel lunar magic when you assume a Wild Shape form, granting you the benefits below. Challenge Rating: The maximum Challenge Rating for the form equals your Druid level divided by 3 (round down). Armor Class: Until you leave the form, your AC equals 13 plus your Wisdom modifier if that total is higher than the Beast's AC."
        },
        {
          "name": "Circle of the Moon",
          "description": "Adopt Animal Forms to Guard the Wilds Druids of the Circle of the Moon draw on lunar magic to transform themselves. Their order gathers under the moon to share news and perform rituals. Changeable as the moon, a Druid of this circle might prowl as a great cat one night, soar over the treetops as an eagle the next day, and then crash through undergrowth as a bear to drive off a trespassing monst..."
        },
        {
          "name": "Circle of the Moon Spells",
          "description": "When you reach a Druid level specified in the Circle of the Moon Spells table, you thereafter always have the listed spells prepared. In addition, you can cast the spells from this feature while you're in a Wild Shape form.",
          "spells": {
            "casting_ability": 4,
            "list": [
              {
                "name": "Starry Wisp",
                "level": 0,
                "description": "You launch a mote of light at one creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d8 Radiant damage, and until the end of your next turn, it emits Dim Light in a 10-foot radius and can't benefit from the Invisible condition."
              },
              {
                "name": "Cure Wounds",
                "level": 1,
                "description": "A creature you touch regains a number of Hit Points equal to 2d8 plus your spellcasting ability modifier."
              },
              {
                "name": "Moonbeam",
                "level": 2,
                "description": "A silvery beam of pale light shines down in a 5-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range. Until the spell ends, Dim Light fills the Cylinder [Area of Effect], and you can take a Magic action on later turns to move the Cylinder [Area of Effect] up to 60..."
              },
              {
                "name": "Conjure Animals",
                "level": 3,
                "description": "You conjure nature spirits that appear as a Large pack of spectral, intangible animals in an unoccupied space you can see within range. The pack lasts for the duration, and you choose the spirits' animal form, such as wolves, serpents, or birds."
              },
              {
                "name": "Fount of Moonlight",
                "level": 4,
                "description": "A cool light wreathes your body for the duration, emitting Bright Light in a 20-foot radius and Dim Light for an additional 20 feet. Until the spell ends, you have Resistance to Radiant damage, and your melee attacks deal an extra 2d6 Radiant damage on a hit."
              },
              {
                "name": "Mass Cure Wounds",
                "level": 5,
                "description": "A wave of healing energy washes out from a point you can see within range. Choose up to six creatures in a 30-foot-radius Sphere [Area of Effect] centered on that point. Each target regains Hit Points equal to 5d8 plus your spellcasting ability modifier."
              }
            ]
          }
        },
        {
          "name": "Improved Circle Forms",
          "description": "While in a Wild Shape form, you gain the following benefits. Lunar Radiance: Each of your attacks in a Wild Shape form can deal its normal damage type or Radiant damage. You make this choice each time you hit with those attacks. Increased Toughness: You can add your Wisdom modifier to your Constitution saving throws."
        },
        {
          "name": "Moonlight Step",
          "description": "You magically transport yourself, reappearing amid a burst of moonlight. As a Bonus Action, you teleport up to 30 feet to an unoccupied space you can see, and you have Advantage on the next attack roll you make before the end of this turn. You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest."
        },
        {
          "name": "Lunar Form",
          "description": "The power of the moon suffuses you, granting you the following benefits. Improved Lunar Radiance: Once per turn, you can deal an extra 2d10 Radiant damage to a target you hit with a Wild Shape form's attack. Shared Moonlight: Whenever you use Moonlight Step, you can also teleport one willing creature."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Circle Forms",
            "Circle of the Moon",
            "Circle of the Moon Spells"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Improved Circle Forms"
          ]
        },
        "10": {
          "level": 10,
          "features": [
            "Moonlight Step"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Lunar Form"
          ]
        }
      }
    },
    {
      "name": "Circle of Dreams",
      "description": "Druids who are members of the Circle of Dreams hail from regions that have strong ties to the Feywild and its dreamlike realms. The druids' guardianship of the natural world makes for a natural alliance between them and good-aligned fey. These druids seek to fill the world with dreamy wonder.",
      "features": [
        {
          "name": "Circle of Dreams",
          "description": "Druids who are members of the Circle of Dreams hail from regions that have strong ties to the Feywild and its dreamlike realms. The druids' guardianship of the natural world makes for a natural alliance between them and good-aligned fey. These druids seek to fill the world with dreamy wonder."
        },
        {
          "name": "Balm of the Summer Court",
          "description": "At 2nd level, you become imbued with the blessings of the Summer Court. You are a font of energy that offers respite from injuries. You have a pool of fey energy represented by a number of d6s equal to your druid level. As a bonus action, you can choose one creature you can see within 120 feet of you and spend a number of those dice equal to half your druid level or less."
        },
        {
          "name": "Hearth of Moonlight and Shadow",
          "description": "At 6th level, home can be wherever you are. During a short or long rest, you can invoke the shadowy power of the Gloaming Court to help guard your respite. At the start of the rest, you touch a point in space, and an invisible, 30-foot-radius sphere of magic appears, centered on that point. Cover blocks the sphere."
        },
        {
          "name": "Hidden Paths",
          "description": "Starting at 10th level, you can use the hidden, magical pathways that some fey use to traverse space in the blink of an eye. As a bonus action on your turn, you can teleport up to 60 feet to an unoccupied space you can see. Alternatively, you can use your action to teleport one willing creature you touch up to 30 feet to an unoccupied space you can see."
        },
        {
          "name": "Walker in Dreams",
          "description": "At 14th level, the magic of the Feywild grants you the ability to travel mentally or physically through dreamlands. When you finish a short rest, you can cast one of the following spells, without expending a spell slot or requiring material components: dream (with you as the messenger), scrying, or teleportation circle. This use of teleportation circle is special."
        }
      ],
      "levels": {
        "2": {
          "level": 2,
          "features": [
            "Circle of Dreams",
            "Balm of the Summer Court"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Circle of Dreams"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Hearth of Moonlight and Shadow"
          ]
        },
        "10": {
          "level": 10,
          "features": [
            "Hidden Paths"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Walker in Dreams"
          ]
        }
      }
    },
    {
      "name": "Circle of the Shepherd",
      "description": "Druids of the Circle of the Shepherd commune with the spirits of nature, especially the spirits of beasts and the fey, and call to those spirits for aid.",
      "features": [
        {
          "name": "Circle of the Shepherd",
          "description": "Druids of the Circle of the Shepherd commune with the spirits of nature, especially the spirits of beasts and the fey, and call to those spirits for aid. These druids recognize that all living things play a role in the natural world, yet they focus on protecting animals and fey creatures that have difficulty defending themselves. Shepherds, as they are known, see such creatures as their charges."
        },
        {
          "name": "Speech of the Woods",
          "description": "At 2nd level, you gain the ability to converse with beasts and many fey. You learn to speak, read, and write Sylvan. In addition, beasts can understand your speech, and you gain the ability to decipher their noises and motions. Most beasts lack the intelligence to convey or understand sophisticated concepts, but a friendly beast could relay what it has seen or heard in the recent past."
        },
        {
          "name": "Spirit Totem",
          "description": "Starting at 2nd level, you can call forth nature spirits to influence the world around you. As a bonus action, you can magically summon an incorporeal spirit to a point you can see within 60 feet of you. The spirit creates an aura in a 30-foot radius around that point. It counts as neither a creature nor an object, though it has the spectral appearance of the creature it represents."
        },
        {
          "name": "Mighty Summoner",
          "description": "Starting at 6th level, beasts and fey that you conjure are more resilient than normal. Any beast or fey summoned or created by a spell that you cast gains the following benefits: The creature appears with more hit points than normal: 2 extra hit points per Hit Die it has."
        },
        {
          "name": "Guardian Spirit",
          "description": "Beginning at 10th level, your Spirit Totem safeguards the beasts and fey that you call forth with your magic. When a beast or fey that you summoned or created with a spell ends its turn in your Spirit Totem aura, that creature regains a number of hit points equal to half your druid level."
        },
        {
          "name": "Faithful Summons",
          "description": "Starting at 14th level, the nature spirits you commune with protect you when you are the most defenseless. If you are reduced to 0 hit points or are incapacitated against your will, you can immediately gain the benefits of conjure animals as if it were cast using a 9th-level spell slot. It summons four beasts of your choice that are challenge rating 2 or lower."
        }
      ],
      "levels": {
        "2": {
          "level": 2,
          "features": [
            "Circle of the Shepherd",
            "Speech of the Woods",
            "Spirit Totem"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Circle of the Shepherd"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Mighty Summoner"
          ]
        },
        "10": {
          "level": 10,
          "features": [
            "Guardian Spirit"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Faithful Summons"
          ]
        }
      }
    },
    {
      "name": "Circle of Spores",
      "description": "Druids of the Circle of Spores find beauty in decay. They see within mold and other fungi the ability to transform lifeless material into abundant, albeit somewhat strange, life. These druids believe that life and death are parts of a grand cycle, with one leading to the other and then back again.",
      "features": [
        {
          "name": "Circle of Spores",
          "description": "Druids of the Circle of Spores find beauty in decay. They see within mold and other fungi the ability to transform lifeless material into abundant, albeit somewhat strange, life. These druids believe that life and death are parts of a grand cycle, with one leading to the other and then back again. Death isn't the end of life, but instead a change of state that sees life shift into a new form."
        },
        {
          "name": "Circle Spells",
          "description": "Your symbiotic link to fungus and your ability to tap into the cycle of life and death grants you access to certain spells. At 2nd level, you learn the chill touch cantrip. At 3rd, 5th, 7th, and 9th level you gain access to the spells listed for that level in the Circle of Spores Spells table."
        },
        {
          "name": "Halo of Spores",
          "description": "Starting at 2nd level, you are surrounded by invisible, necrotic spores that are harmless until you unleash them on a creature nearby. When a creature you can see moves into a space within 10 feet of you or starts its turn there, you can use your reaction to deal 1d4 necrotic damage to that creature unless it succeeds on a Constitution saving throw against your spell save DC."
        },
        {
          "name": "Symbiotic Entity",
          "description": "At 2nd level, you gain the ability to channel magic into your spores. As an action, you can expend a use of your Wild Shape feature to awaken those spores, rather than transforming into a beast form, and you gain 4 temporary hit points for each level you have in this class."
        },
        {
          "name": "Fungal Infestation",
          "description": "At 6th level, your spores gain the ability to infest a corpse and animate it. If a beast or a humanoid that is Small or Medium dies within 10 feet of you, you can use your reaction to animate it, causing it to stand up immediately with 1 hit point. The creature uses the zombie stat block in the Monster Manual. It remains animate for 1 hour, after which time it collapses and dies."
        },
        {
          "name": "Spreading Spores",
          "description": "At 10th level, you gain the ability to seed an area with deadly spores. As a bonus action while your Symbiotic Entity feature is active, you can hurl spores up to 30 feet away, where they swirl in a 10-foot cube for 1 minute. The spores disappear early if you use this feature again, if you dismiss them as a bonus action, or if your Symbiotic Entity feature is no longer active."
        },
        {
          "name": "Fungal Body",
          "description": "At 14th level, the fungal spores in your body alter you: you can't be blinded, deafened, frightened, or poisoned, and any critical hit against you counts as a normal hit instead, unless you're incapacitated."
        }
      ],
      "levels": {
        "2": {
          "level": 2,
          "features": [
            "Circle of Spores",
            "Circle Spells",
            "Halo of Spores",
            "Symbiotic Entity"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Circle of Spores"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Fungal Infestation"
          ]
        },
        "10": {
          "level": 10,
          "features": [
            "Spreading Spores"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Fungal Body"
          ]
        }
      }
    },
    {
      "name": "Circle of Stars",
      "description": "The Circle of Stars allows druids to draw on the power of starlight. These druids have tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations.",
      "features": [
        {
          "name": "Circle of Stars",
          "description": "The Circle of Stars allows druids to draw on the power of starlight. These druids have tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations. By revealing and understanding these secrets, the Circle of the Stars seeks to harness the powers of the cosmos. Many druids of this circle keep records of the constellations and the stars' effects on the world."
        },
        {
          "name": "Star Map",
          "description": "2nd-level Circle of the Stars feature You've created a star chart as part of your heavenly studies. It is a Tiny object and can serve as a spellcasting focus for your druid spells. You determine its form by rolling on the Star Map table or by choosing one. While holding this map, you have these benefits: You know the guidance cantrip. You have the guiding bolt spell prepared."
        },
        {
          "name": "Starry Form",
          "description": "2nd-level Circle of the Stars feature As a bonus action, you can expend a use of your Wild Shape feature to take on a starry form, rather than transforming into a beast. While in your starry form, you retain your game statistics, but your body becomes luminous; your joints glimmer like stars, and glowing lines connect them as on a star chart."
        },
        {
          "name": "Archer",
          "description": "A constellation of an archer appears on you. When you activate this form, and as a bonus action on your subsequent turns while it lasts, you can make a ranged spell attack, hurling a luminous arrow that targets one creature within 60 feet of you. On a hit, the attack deals radiant damage equal to 1d8 + your Wisdom modifier."
        },
        {
          "name": "Chalice",
          "description": "A constellation of a life-giving goblet appears on you. Whenever you cast a spell using a spell slot that restores hit points to a creature, you or another creature within 30 feet of you can regain hit points equal to 1d8 + your Wisdom modifier."
        },
        {
          "name": "Dragon",
          "description": "A constellation of a wise dragon appears on you. When you make an Intelligence or a Wisdom check or a Constitution saving throw to maintain concentration on a spell, you can treat a roll of 9 or lower on the d20 as a 10."
        },
        {
          "name": "Cosmic Omen",
          "description": "6th-level Circle of the Stars feature Whenever you finish a long rest, you can consult your Star Map for omens. When you do so, roll a die. Until you finish your next long rest, you gain access to a special reaction based on whether you rolled an even or an odd number on the die: Weal (even):  Woe (odd):  You can use this reaction a number of times equal to your proficiency bonus, and you regai..."
        },
        {
          "name": "Twinkling Constellations",
          "description": "10th-level Circle of the Stars feature The constellations of your Starry Form improve. The 1d8 of the Archer and the Chalice becomes 2d8, and while the Dragon is active, you have a flying speed of 20 feet and can hover. Moreover, at the start of each of your turns while in your Starry Form, you can change which constellation glimmers on your body."
        },
        {
          "name": "Full of Stars",
          "description": "14th-level Circle of the Stars feature While in your Starry Form, you become partially incorporeal, giving you resistance to bludgeoning, piercing, and slashing damage."
        }
      ],
      "levels": {
        "2": {
          "level": 2,
          "features": [
            "Circle of Stars",
            "Star Map",
            "Starry Form",
            "Archer",
            "Chalice",
            "Dragon"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Circle of Stars"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Cosmic Omen"
          ]
        },
        "10": {
          "level": 10,
          "features": [
            "Twinkling Constellations"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Full of Stars"
          ]
        }
      }
    },
    {
      "name": "Circle of Wildfire",
      "description": "Druids within the Circle of Wildfire understand that destruction is sometimes the precursor of creation, such as when a forest fire promotes later growth.",
      "features": [
        {
          "name": "Circle of Wildfire",
          "description": "Druids within the Circle of Wildfire understand that destruction is sometimes the precursor of creation, such as when a forest fire promotes later growth. These druids bond with a primal spirit that harbors both destructive and creative power, allowing the druids to create controlled flames that burn away one thing but give life to another."
        },
        {
          "name": "Circle Spells",
          "description": "2nd-level Circle of Wildfire feature You have formed a bond with a wildfire spirit, a primal being of creation and destruction. Your link with this spirit grants you access to some spells when you reach certain levels in this class, as shown on the Circle of Wildfire Spells table."
        },
        {
          "name": "Summon Wildfire Spirit",
          "description": "2nd-level Circle of Wildfire feature You can summon the primal spirit bound to your soul. As an action, you can expend one use of your Wild Shape feature to summon your wildfire spirit, rather than assuming a beast form. The spirit appears in an unoccupied space of your choice that you can see within 30 feet of you."
        },
        {
          "name": "Enhanced Bond",
          "description": "6th-level Circle of Wildfire feature The bond with your wildfire spirit enhances your destructive and restorative spells. Whenever you cast a spell that deals fire damage or restores hit points while your wildfire spirit is summoned, roll a d8, and you gain a bonus equal to the number rolled to one damage or healing roll of the spell."
        },
        {
          "name": "Cauterizing Flames",
          "description": "10th-level Circle of Wildfire feature You gain the ability to turn death into magical flames that can heal or incinerate. When a Small or larger creature dies within 30 feet of you or your wildfire spirit, a harmless spectral flame springs forth in the dead creature's space and flickers there for 1 minute."
        },
        {
          "name": "Blazing Revival",
          "description": "14th-level Circle of Wildfire feature The bond with your wildfire spirit can save you from death. If the spirit is within 120 feet of you when you are reduced to 0 hit points and thereby fall unconscious, you can cause the spirit to drop to 0 hit points. You then regain half your hit points and immediately rise to your feet."
        }
      ],
      "levels": {
        "2": {
          "level": 2,
          "features": [
            "Circle of Wildfire",
            "Circle Spells",
            "Summon Wildfire Spirit"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Circle of Wildfire"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Enhanced Bond"
          ]
        },
        "10": {
          "level": 10,
          "features": [
            "Cauterizing Flames"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Blazing Revival"
          ]
        }
      }
    },
    {
      "name": "Circle of the Sea",
      "description": "Become One with Tides and Storms Druids of the Circle of the Sea draw on the tempestuous forces of oceans and storms. Some view themselves as embodiments of nature's wrath, seeking vengeance against those who despoil nature.",
      "features": [
        {
          "name": "Circle of the Sea",
          "description": "Become One with Tides and Storms Druids of the Circle of the Sea draw on the tempestuous forces of oceans and storms. Some view themselves as embodiments of nature's wrath, seeking vengeance against those who despoil nature."
        },
        {
          "name": "Circle of the Sea Spells",
          "description": "When you reach a Druid level specified in the Circle of the Sea Spells table, you thereafter always have the listed spells prepared.",
          "spells": {
            "casting_ability": 4,
            "list": [
              {
                "name": "Ray of Frost",
                "level": 0,
                "description": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 Cold damage, and its Speed is reduced by 10 feet until the start of your next turn."
              },
              {
                "name": "Fog Cloud",
                "level": 1,
                "description": "You create a 20-foot-radius Sphere [Area of Effect] of fog centered on a point within range. The Sphere [Area of Effect] is Heavily Obscured. It lasts for the duration or until a strong wind (such as one created by Gust of Wind) disperses it."
              },
              {
                "name": "Thunderwave",
                "level": 1,
                "description": "You unleash a wave of thunderous energy. Each creature in a 15-foot Cube [Area of Effect] originating from you makes a Constitution saving throw. On a failed save, a creature takes 2d8 Thunder damage and is pushed 10 feet away from you."
              },
              {
                "name": "Gust of Wind",
                "level": 2,
                "description": "A Line [Area of Effect] of strong wind 60 feet long and 10 feet wide blasts from you in a direction you choose for the duration. Each creature in the Line [Area of Effect] must succeed on a Strength saving throw or be pushed 15 feet away from you in a direction following the Line [Area of Effect]."
              },
              {
                "name": "Shatter",
                "level": 2,
                "description": "A loud noise erupts from a point of your choice within range. Each creature in a 10-foot-radius Sphere [Area of Effect] centered there makes a Constitution saving throw, taking 3d8 Thunder damage on a failed save or half as much damage on a successful one. A Construct has Disadvantage on the save."
              },
              {
                "name": "Lightning Bolt",
                "level": 3,
                "description": "A stroke of lightning forming a 100-foot-long, 5-foot-wide Line [Area of Effect] blasts out from you in a direction you choose. Each creature in the Line [Area of Effect] makes a Dexterity saving throw, taking 8d6 Lightning damage on a failed save or half as much damage on a successful one."
              },
              {
                "name": "Water Breathing",
                "level": 3,
                "description": "This spell grants up to ten willing creatures of your choice within range the ability to breathe underwater until the spell ends. Affected creatures also retain their normal mode of respiration."
              },
              {
                "name": "Control Water",
                "level": 4,
                "description": "Until the spell ends, you control any water inside an area you choose that is a Cube [Area of Effect] up to 100 feet on a side, using one of the following effects. As a Magic action on your later turns, you can repeat the same effect or choose a different one."
              },
              {
                "name": "Ice Storm",
                "level": 4,
                "description": "Hail falls in a 20-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range. Each creature in the Cylinder [Area of Effect] makes a Dexterity saving throw."
              },
              {
                "name": "Conjure Elemental",
                "level": 5,
                "description": "You conjure a Large, intangible spirit from the Elemental Planes that appears in an unoccupied space within range. Choose the spirit's element, which determines its damage type: air (Lightning), earth (Thunder), fire (Fire), or water (Cold). The spirit lasts for the duration."
              },
              {
                "name": "Hold Monster",
                "level": 5,
                "description": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or have the Paralyzed condition for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success."
              }
            ]
          }
        },
        {
          "name": "Wrath of the Sea",
          "description": "As a Bonus Action, you can expend a use of your Wild Shape to manifest a 5-foot Emanation [Area of Effect] that takes the form of ocean spray that surrounds you for 10 minutes. It ends early if you dismiss it (no action required), manifest it again, or have the Incapacitated condition."
        },
        {
          "name": "Aquatic Affinity",
          "description": "The size of the Emanation [Area of Effect] created by your Wrath of the Sea increases to 10 feet. In addition, you gain a Swim Speed equal to your Speed."
        },
        {
          "name": "Stormborn",
          "description": "Your Wrath of the Sea confers two more benefits while active, as detailed below. Flight: You gain a Fly Speed equal to your Speed. Resistance: You have Resistance to Cold, Lightning, and Thunder damage."
        },
        {
          "name": "Oceanic Gift",
          "description": "Instead of manifesting the Emanation [Area of Effect] of Wrath of the Sea around yourself, you can manifest it around one willing creature within 60 feet of yourself. That creature gains all the benefits of the Emanation [Area of Effect] and uses your spell save DC and Wisdom modifier for it."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Circle of the Sea",
            "Circle of the Sea Spells",
            "Wrath of the Sea"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Aquatic Affinity"
          ]
        },
        "10": {
          "level": 10,
          "features": [
            "Stormborn"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Oceanic Gift"
          ]
        }
      }
    },
    {
      "name": "Circle of the Stars",
      "description": "Harness Secrets Hidden in Constellations The Circle of the Stars has tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations. By understanding these secrets, the Druids of this circle seek to harness the powers of the cosmos.",
      "features": [
        {
          "name": "Circle of the Stars",
          "description": "Harness Secrets Hidden in Constellations The Circle of the Stars has tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations. By understanding these secrets, the Druids of this circle seek to harness the powers of the cosmos."
        },
        {
          "name": "Star Map",
          "description": "You've created a star chart as part of your heavenly studies. It is a Tiny object, and you can use it as a Spellcasting Focus for your Druid spells. You determine its form by rolling on the Star Map table or by choosing one. While holding the map, you have the Guidance and Guiding Bolt spells prepared, and you can cast Guiding Bolt without expending a spell slot.",
          "spells": {
            "casting_ability": 4,
            "list": [
              {
                "name": "Guidance",
                "level": 0,
                "description": "You touch a willing creature and choose a skill. Until the spell ends, the creature adds 1d4 to any ability check using the chosen skill."
              },
              {
                "name": "Guiding Bolt",
                "level": 1,
                "description": "You hurl a bolt of light toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 4d6 Radiant damage, and the next attack roll made against it before the end of your next turn has Advantage."
              }
            ]
          }
        },
        {
          "name": "Starry Form",
          "description": "As a Bonus Action, you can expend a use of your Wild Shape feature to take on a starry form rather than shape-shifting. While in your starry form, you retain your game statistics, but your body becomes luminous, your joints glimmer like stars, and glowing lines connect them as on a star chart. This form sheds Bright Light in a 10-foot radius and Dim Light for an additional 10 feet."
        },
        {
          "name": "Archer",
          "description": "A constellation of an archer appears on you. When you activate this form and as a Bonus Action on your subsequent turns while it lasts, you can make a ranged spell attack, hurling a luminous arrow that targets one creature within 60 feet of yourself. On a hit, the attack deals Radiant damage equal to 1d8 plus your Wisdom modifier."
        },
        {
          "name": "Chalice",
          "description": "A constellation of a life-giving goblet appears on you. Whenever you cast a spell using a spell slot that restores Hit Points to a creature, you or another creature within 30 feet of you can regain Hit Points equal to 1d8 plus your Wisdom modifier."
        },
        {
          "name": "Dragon",
          "description": "A constellation of a wise dragon appears on you. When you make an Intelligence or a Wisdom check or a Constitution saving throw to maintain Concentration, you can treat a roll of 9 or lower on the d20 as a 10."
        },
        {
          "name": "Cosmic Omen",
          "description": "Whenever you finish a Long Rest, you can consult your Star Map for omens and roll a die. Until you finish your next Long Rest, you gain access to a special Reaction based on whether you rolled an even or an odd number on the die: Weal (even): Whenever a creature you can see within 30 feet of you is about to make a D20 Test, you can take a Reaction to roll 1d6 and add the number rolled to the to..."
        },
        {
          "name": "Twinkling Constellations",
          "description": "The constellations of your Starry Form improve. The 1d8 of the Archer and the Chalice becomes 2d8, and while the Dragon is active, you have a Fly Speed of 20 feet and can hover. Moreover, at the start of each of your turns while in your Starry Form, you can change which constellation glimmers on your body."
        },
        {
          "name": "Full of Stars",
          "description": "While in your Starry Form, you become partially incorporeal, giving you Resistance to Bludgeoning, Piercing, and Slashing damage."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Circle of the Stars",
            "Star Map",
            "Starry Form",
            "Archer",
            "Chalice",
            "Dragon"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Cosmic Omen"
          ]
        },
        "10": {
          "level": 10,
          "features": [
            "Twinkling Constellations"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Full of Stars"
          ]
        }
      }
    }
  ]
}