{
  "name": "Paladin",
  "description": "A holy warrior bound to a sacred oath.",
  "hit_die": 10,
  "proficiencies": [
    0,
    1,
    2,
    3,
    4,
    5
  ],
  "saving_throws": [
    4,
    5
  ],
  "features": [
    {
      "name": "Lay on Hands",
      "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you finish a Long Rest. With that pool, you can restore a total number of Hit Points equal to five times your Paladin level."
    },
    {
      "name": "Spellcasting",
      "description": "You have learned to cast spells through prayer and meditation. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Paladin spells, which appear in the Paladin spell list later in the class's description. Spell Slots: The Paladin Features table shows how many spell slots you have to cast your level 1+ spells.",
      "spells": {
        "casting_ability": 5,
        "list": {
          "from": "spells/paladin.json"
        },
        "levels": [
          {
            "slots": [
              2
            ]
          },
          {
            "slots": [
              2
            ]
          },
          {
            "slots": [
              3
            ]
          },
          {
            "slots": [
              3
            ]
          },
          {
            "slots": [
              4,
              2
            ]
          },
          {
            "slots": [
              4,
              2
            ]
          },
          {
            "slots": [
              4,
              3
            ]
          },
          {
            "slots": [
              4,
              3
            ]
          },
          {
            "slots": [
              4,
              3,
              2
            ]
          },
          {
            "slots": [
              4,
              3,
              2
            ]
          },
          {
            "slots": [
              4,
              3,
              3
            ]
          },
          {
            "slots": [
              4,
              3,
              3
            ]
          },
          {
            "slots": [
              4,
              3,
              3,
              1
            ]
          },
          {
            "slots": [
              4,
              3,
              3,
              1
            ]
          },
          {
            "slots": [
              4,
              3,
              3,
              2
            ]
          },
          {
            "slots": [
              4,
              3,
              3,
              2
            ]
          },
          {
            "slots": [
              4,
              3,
              3,
              3,
              1
            ]
          },
          {
            "slots": [
              4,
              3,
              3,
              3,
              1
            ]
          },
          {
            "slots": [
              4,
              3,
              3,
              3,
              2
            ]
          },
          {
            "slots": [
              4,
              3,
              3,
              3,
              2
            ]
          }
        ]
      }
    },
    {
      "name": "Weapon Mastery",
      "description": "Your training with weapons allows you to use the weapon mastery properties of two kinds of weapons of your choice with which you have proficiency, such as Longsword and Javelin. Whenever you finish a Long Rest, you can change the kinds of weapons you chose. For example, you could switch to using the weapon mastery properties of Halberd and Flail."
    },
    {
      "name": "Fighting Style",
      "description": "You gain a Fighting Style feat of your choice. Instead of choosing one of those feats, you can choose the option below."
    },
    {
      "name": "Paladin's Smite",
      "description": "You always have the Divine Smite spell prepared. In addition, you can cast it without expending a spell slot, but you must finish a Long Rest before you can cast it in this way again."
    },
    {
      "name": "Channel Divinity",
      "description": "You can channel divine energy directly from the Outer Planes, using it to fuel magical effects. You start with one such effect: Divine Sense, which is described below. Other Paladin features give additional Channel Divinity effect options. Each time you use this class's Channel Divinity, you choose which effect from this class to create. You can use this class's Channel Divinity twice."
    },
    {
      "name": "Divine Sense",
      "description": "As a Bonus Action, you can open your awareness to detect Celestials, Fiends, and Undead. For the next 10 minutes or until you have the Incapacitated condition, you know the location of any creature of those types within 60 feet of yourself, and you know its creature type."
    },
    {
      "name": "Paladin Subclass",
      "description": "You gain a Paladin subclass of your choice. A subclass is a specialization that grants you features at certain Paladin levels. For the rest of your career, you gain each of your subclass's features that are of your Paladin level or lower. A Paladin tries to hold to the highest standards of conduct, but even the most dedicated are fallible. Sometimes a Paladin transgresses their oath."
    },
    {
      "name": "Ability Score Improvement",
      "description": "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Paladin levels 8, 12, and 16."
    },
    {
      "name": "Extra Attack",
      "description": "You can attack twice instead of once whenever you take the Attack action on your turn."
    },
    {
      "name": "Faithful Steed",
      "description": "You can call on the aid of an otherworldly steed. You always have the Find Steed spell prepared. You can also cast the spell once without expending a spell slot, and you regain the ability to do so when you finish a Long Rest."
    },
    {
      "name": "Aura of Protection",
      "description": "You radiate a protective, unseeable aura in a 10-foot Emanation [Area of Effect] that originates from you. The aura is inactive while you have the Incapacitated condition. You and your allies in the aura gain a bonus to saving throws equal to your Charisma modifier (minimum bonus of +1)."
    },
    {
      "name": "Subclass Feature",
      "description": "You gain a feature from your Paladin Subclass."
    },
    {
      "name": "Abjure Foes",
      "description": "As a Magic action, you can expend one use of this class's Channel Divinity to overwhelm foes with awe. As you present your Holy Symbol or weapon, you can target a number of creatures equal to your Charisma modifier (minimum of one creature) that you can see within 60 feet of yourself."
    },
    {
      "name": "Aura of Courage",
      "description": "You and your allies have Immunity to the Frightened condition while in your Aura of Protection. If a Frightened ally enters the aura, that condition has no effect on that ally while there."
    },
    {
      "name": "Radiant Strikes",
      "description": "Your strikes now carry supernatural power. When you hit a target with an attack roll using a Melee weapon or an Unarmed Strike, the target takes an extra 1d8 Radiant damage."
    },
    {
      "name": "Restoring Touch",
      "description": "When you use Lay On Hands on a creature, you can also remove one or more of the following conditions from the creature: Blinded, Charmed, Deafened, Frightened, Paralyzed, or Stunned. You must expend 5 Hit Points from the healing pool of Lay On Hands for each of these conditions you remove; those points don't also restore Hit Points to the creature."
    },
    {
      "name": "Aura Expansion",
      "description": "Your Aura of Protection is now a 30-foot Emanation [Area of Effect]."
    },
    {
      "name": "Epic Boon",
      "description": "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Truesight is recommended."
    }
  ],
  "levels": [
    {
      "features": [
        "Lay on Hands",
        "Spellcasting",
        "Weapon Mastery"
      ]
    },
    {
      "features": [
        "Fighting Style",
        "Paladin's Smite"
      ]
    },
    {
      "features": [
        "Channel Divinity",
        "Divine Sense",
        "Paladin Subclass"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Extra Attack",
        "Faithful Steed"
      ]
    },
    {
      "features": [
        "Aura of Protection"
      ]
    },
    {
      "features": [
        "Subclass Feature"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Abjure Foes"
      ]
    },
    {
      "features": [
        "Aura of Courage"
      ]
    },
    {
      "features": [
        "Radiant Strikes"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Restoring Touch"
      ]
    },
    {
      "features": [
        "Subclass Feature"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Aura Expansion"
      ]
    },
    {
      "features": [
        "Epic Boon"
      ]
    },
    {
      "features": [
        "Subclass Feature"
      ]
    }
  ],
  "subclasses": [
    {
      "name": "Oath of Devotion",
      "description": "Uphold the Ideals of Justice and Order The Oath of Devotion binds Paladins to the ideals of justice and order. These Paladins meet the archetype of the knight in shining armor.",
      "features": [
        {
          "name": "Oath of Devotion",
          "description": "Uphold the Ideals of Justice and Order The Oath of Devotion binds Paladins to the ideals of justice and order. These Paladins meet the archetype of the knight in shining armor. They hold themselves to the highest standards of conduct, and some—for better or worse—hold the rest of the world to the same standards."
        },
        {
          "name": "Oath of Devotion Spells",
          "description": "The magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of Devotion Spells table, you thereafter always have the listed spells prepared.",
          "spells": {
            "casting_ability": 5,
            "list": [
              {
                "name": "Protection from Evil and Good",
                "level": 1,
                "description": "Until the spell ends, one willing creature you touch is protected against creatures that are Aberrations, Celestials, Elementals, Fey, Fiends, or Undead. The protection grants several benefits. Creatures of those types have Disadvantage on attack rolls against the target."
              },
              {
                "name": "Shield of Faith",
                "level": 1,
                "description": "A shimmering field surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration."
              },
              {
                "name": "Aid",
                "level": 2,
                "description": "Choose up to three creatures within range. Each target's Hit Points maximum and current Hit Points increase by 5 for the duration."
              },
              {
                "name": "Zone of Truth",
                "level": 2,
                "description": "You create a magical zone that guards against deception in a 15-foot-radius Sphere [Area of Effect] centered on a point within range. Until the spell ends, a creature that enters the spell's area for the first time on a turn or starts its turn there makes a Charisma saving throw."
              },
              {
                "name": "Beacon of Hope",
                "level": 3,
                "description": "Choose any number of creatures within range. For the duration, each target has Advantage on Wisdom saving throws and Death Saving Throw and regains the maximum number of Hit Points possible from any healing."
              },
              {
                "name": "Dispel Magic",
                "level": 3,
                "description": "Choose one creature, object, or magical effect within range. Any ongoing spell of level 3 or lower on the target ends. For each ongoing spell of level 4 or higher on the target, make an ability check using your spellcasting ability (10 plus that spell's level). On a successful check, the spell ends."
              },
              {
                "name": "Freedom of Movement",
                "level": 4,
                "description": "You touch a willing creature. For the duration, the target's movement is unaffected by Difficult Terrain, and spells and other magical effects can neither reduce the target's Speed nor cause the target to have the Paralyzed or Restrained conditions."
              },
              {
                "name": "Guardian of Faith",
                "level": 4,
                "description": "A Large spectral guardian appears and hovers for the duration in an unoccupied space that you can see within range. The guardian occupies that space and is invulnerable, and it appears in a form appropriate for your deity or pantheon."
              },
              {
                "name": "Commune",
                "level": 5,
                "description": "You contact a deity or a divine proxy and ask up to three questions that can be answered with yes or no. You must ask your questions before the spell ends. You receive a correct answer for each question."
              },
              {
                "name": "Flame Strike",
                "level": 5,
                "description": "A vertical column of brilliant fire roars down from above. Each creature in a 10-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range makes a Dexterity saving throw, taking 5d6 Fire damage and 5d6 Radiant damage on a failed save or half as much damage on a successf..."
              }
            ]
          }
        },
        {
          "name": "Sacred Weapon",
          "description": "When you take the Attack action, you can expend one use of your Channel Divinity to imbue one Melee weapon that you are holding with positive energy. For 10 minutes or until you use this feature again, you add your Charisma modifier to attack rolls you make with that weapon (minimum bonus of +1), and each time you hit with it, you cause it to deal its normal damage type or Radiant damage."
        },
        {
          "name": "Aura of Devotion",
          "description": "You and your allies have Immunity to the Charmed condition while in your Aura of Protection. If a Charmed ally enters the aura, that condition has no effect on that ally while there."
        },
        {
          "name": "Smite of Protection",
          "description": "Your magical smite now radiates protective energy. Whenever you cast Divine Smite, you and your allies have Cover while in your Aura of Protection. The aura has this benefit until the start of your next turn."
        },
        {
          "name": "Holy Nimbus",
          "description": "As a Bonus Action, you can imbue your Aura of Protection with holy power, granting the benefits below for 10 minutes or until you end them (no action required). Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required)."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Oath of Devotion",
            "Oath of Devotion Spells",
            "Sacred Weapon"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Aura of Devotion"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Smite of Protection"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Holy Nimbus"
          ]
        }
      }
    },
    {
      "name": "Oath of the Ancients",
      "description": "As a Magic action, you can expend one use of your Channel Divinity to conjure spectral vines around nearby creatures. Each creature of your choice that you can see within 15 feet of yourself must succeed on a Strength saving throw or have the Restrained condition for 1 minute.",
      "features": [
        {
          "name": "Nature's Wrath",
          "description": "As a Magic action, you can expend one use of your Channel Divinity to conjure spectral vines around nearby creatures. Each creature of your choice that you can see within 15 feet of yourself must succeed on a Strength saving throw or have the Restrained condition for 1 minute. A Restrained creature repeats the save at the end of each of its turns, ending the effect on itself on a success."
        },
        {
          "name": "Oath of the Ancients",
          "description": "Preserve Life and Light in the World The Oath of the Ancients is as old as the first elves. Paladins who swear this oath cherish the light; they love the beautiful and life-giving things of the world more than any principles of honor, courage, and justice."
        },
        {
          "name": "Oath of the Ancients Spells",
          "description": "The magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of the Ancients Spells table, you thereafter always have the listed spells prepared.",
          "spells": {
            "casting_ability": 5,
            "list": [
              {
                "name": "Ensnaring Strike",
                "level": 1,
                "description": "As you hit the target, grasping vines appear on it, and it makes a Strength saving throw. A Large or larger creature has Advantage on this save. On a failed save, the target has the Restrained condition until the spell ends. On a successful save, the vines shrivel away, and the spell ends."
              },
              {
                "name": "Speak with Animals",
                "level": 1,
                "description": "For the duration, you can comprehend and verbally communicate with Beasts, and you can use any of the Influence action's skill options with them. Most Beasts have little to say about topics that don't pertain to survival or companionship, but at minimum, a Beast can give you information about nea..."
              },
              {
                "name": "Misty Step",
                "level": 2,
                "description": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space you can see."
              },
              {
                "name": "Moonbeam",
                "level": 2,
                "description": "A silvery beam of pale light shines down in a 5-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range. Until the spell ends, Dim Light fills the Cylinder [Area of Effect], and you can take a Magic action on later turns to move the Cylinder [Area of Effect] up to 60..."
              },
              {
                "name": "Plant Growth",
                "level": 3,
                "description": "This spell channels vitality into plants. The casting time you use determines whether the spell has the Overgrowth or the Enrichment effect below. Overgrowth: Choose a point within range."
              },
              {
                "name": "Protection from Energy",
                "level": 3,
                "description": "For the duration, the willing creature you touch has Resistance to one damage type of your choice: Acid, Cold, Fire, Lightning, or Thunder."
              },
              {
                "name": "Ice Storm",
                "level": 4,
                "description": "Hail falls in a 20-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range. Each creature in the Cylinder [Area of Effect] makes a Dexterity saving throw."
              },
              {
                "name": "Stoneskin",
                "level": 4,
                "description": "Until the spell ends, one willing creature you touch has Resistance to Bludgeoning, Piercing, and Slashing damage."
              },
              {
                "name": "Commune with Nature",
                "level": 5,
                "description": "You commune with nature spirits and gain knowledge of the surrounding area. In the outdoors, the spell gives you knowledge of the area within 3 miles of you. In caves and other natural underground settings, the radius is limited to 300 feet."
              },
              {
                "name": "Tree Stride",
                "level": 5,
                "description": "You gain the ability to enter a tree and move from inside it to inside another tree of the same kind within 500 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree."
              }
            ]
          }
        },
        {
          "name": "Aura of Warding",
          "description": "Ancient magic lies so heavily upon you that it forms an eldritch ward, blunting energy from beyond the Material Plane; you and your allies have Resistance to Necrotic, Psychic, and Radiant damage while in your Aura of Protection."
        },
        {
          "name": "Undying Sentinel",
          "description": "When you are reduced to 0 Hit Points and not killed outright, you can drop to 1 Hit Points instead, and you regain a number of Hit Points equal to three times your Paladin level. Once you use this feature, you can't do so again until you finish a Long Rest. Additionally, you can't be aged magically, and you cease visibly aging."
        },
        {
          "name": "Elder Champion",
          "description": "As a Bonus Action, you can imbue your Aura of Protection with primal power, granting the benefits below for 1 minute or until you end them (no action required). Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required)."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Nature's Wrath",
            "Oath of the Ancients",
            "Oath of the Ancients Spells"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Aura of Warding"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Undying Sentinel"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Elder Champion"
          ]
        }
      }
    },
    {
      "name": "Oath of Vengeance",
      "description": "Punish Evildoers at Any Cost The Oath of Vengeance is a solemn commitment to punish those who have committed grievously evil acts. When evil armies slaughter helpless villagers, when a tyrant defies the will of the gods, when a thieves' guild grows too violent, when a dragon rampages through the...",
      "features": [
        {
          "name": "Oath of Vengeance",
          "description": "Punish Evildoers at Any Cost The Oath of Vengeance is a solemn commitment to punish those who have committed grievously evil acts. When evil armies slaughter helpless villagers, when a tyrant defies the will of the gods, when a thieves' guild grows too violent, when a dragon rampages through the countryside—at times like these, paladins arise and swear an Oath of Vengeance to set right what has..."
        },
        {
          "name": "Oath of Vengeance Spells",
          "description": "The magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of Vengeance Spells table, you thereafter always have the listed spells prepared.",
          "spells": {
            "casting_ability": 5,
            "list": [
              {
                "name": "Bane",
                "level": 1,
                "description": "Up to three creatures of your choice that you can see within range must each make a Charisma saving throw. Whenever a target that fails this save makes an attack roll or a saving throw before the spell ends, the target must subtract 1d4 from the attack roll or save."
              },
              {
                "name": "Hunter's Mark",
                "level": 1,
                "description": "You magically mark one creature you can see within range as your quarry. Until the spell ends, you deal an extra 1d6 Force damage to the target whenever you hit it with an attack roll. You also have Advantage on any Wisdom (Perception or Survival) check you make to find it."
              },
              {
                "name": "Hold Person",
                "level": 2,
                "description": "Choose a Humanoid that you can see within range. The target must succeed on a Wisdom saving throw or have the Paralyzed condition for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success."
              },
              {
                "name": "Misty Step",
                "level": 2,
                "description": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space you can see."
              },
              {
                "name": "Haste",
                "level": 3,
                "description": "Choose a willing creature that you can see within range. Until the spell ends, the target's Speed is doubled, it gains a +2 bonus to Armor Class, it has Advantage on Dexterity saving throws, and it gains an additional action on each of its turns."
              },
              {
                "name": "Protection from Energy",
                "level": 3,
                "description": "For the duration, the willing creature you touch has Resistance to one damage type of your choice: Acid, Cold, Fire, Lightning, or Thunder."
              },
              {
                "name": "Banishment",
                "level": 4,
                "description": "One creature that you can see within range must succeed on a Charisma saving throw or be transported to a harmless demiplane for the duration. While there, the target has the Incapacitated condition."
              },
              {
                "name": "Dimension Door",
                "level": 4,
                "description": "You teleport to a location within range. You arrive at exactly the spot desired. It can be a place you can see, one you can visualize, or one you can describe by stating distance and direction, such as \"200 feet straight downward\" or \"300 feet upward to the northwest at a 45-degree angle.\" You ca..."
              },
              {
                "name": "Hold Monster",
                "level": 5,
                "description": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or have the Paralyzed condition for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success."
              },
              {
                "name": "Scrying",
                "level": 5,
                "description": "You can see and hear a creature you choose that is on the same plane of existence as you. The target makes a Wisdom saving throw, which is modified (see the tables below) by how well you know the target and the sort of physical connection you have to it."
              }
            ]
          }
        },
        {
          "name": "Vow of Enmity",
          "description": "When you take the Attack action, you can expend one use of your Channel Divinity to utter a vow of enmity against a creature you can see within 30 feet of yourself. You have Advantage on attack rolls against the creature for 1 minute or until you use this feature again."
        },
        {
          "name": "Relentless Avenger",
          "description": "Your supernatural focus helps you close off a foe's retreat. When you hit a creature with an Opportunity Attack, you can reduce the creature's Speed to 0 until the end of the current turn. You can then move up to half your Speed as part of the same Reaction. This movement doesn't provoke Opportunity Attack."
        },
        {
          "name": "Soul of Vengeance",
          "description": "Immediately after a creature under the effect of your Vow of Enmity hits or misses with an attack roll, you can take a Reaction to make a melee attack against that creature if it's within range."
        },
        {
          "name": "Avenging Angel",
          "description": "As a Bonus Action, you gain the benefits below for 10 minutes or until you end them (no action required). Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required). Flight: You sprout spectral wings on your back, have a Fly Speed of 60 feet, and can hover."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Oath of Vengeance",
            "Oath of Vengeance Spells",
            "Vow of Enmity"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Relentless Avenger"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Soul of Vengeance"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Avenging Angel"
          ]
        }
      }
    },
    {
      "name": "Oathbreaker",
      "description": "An Oathbreaker is a paladin who breaks his or her sacred oaths to pursue some dark ambition or serve an evil power. Whatever light burned in the paladin's heart has been extinguished. Only darkness remains. A paladin must be evil and at least 3rd level to become an Oathbreaker.",
      "features": [
        {
          "name": "Oathbreaker",
          "description": "An Oathbreaker is a paladin who breaks his or her sacred oaths to pursue some dark ambition or serve an evil power. Whatever light burned in the paladin's heart has been extinguished. Only darkness remains. A paladin must be evil and at least 3rd level to become an Oathbreaker. The paladin replaces the features specific to his or her Sacred Oath with Oathbreaker features."
        },
        {
          "name": "Channel Divinity",
          "description": "An Oathbreaker paladin of 3rd level or higher gains the following two Channel Divinity options."
        },
        {
          "name": "Control Undead",
          "description": "As an action, the paladin targets one undead creature he or she can see within 30 feet of him or her. The target must make a Wisdom saving throw. On a failed save, the target must obey the paladin's commands for the next 24 hours, or until the paladin uses this Channel Divinity option again. An undead whose challenge rating is equal to or greater than the paladin's level is immune to this effect."
        },
        {
          "name": "Dreadful Aspect",
          "description": "As an action, the paladin channels the darkest emotions and focuses them into a burst of magical menace. Each creature of the paladin's choice within 30 feet of the paladin must make a Wisdom saving throw if it can see the paladin. On a failed save, the target is frightened of the paladin for 1 minute."
        },
        {
          "name": "Oathbreaker Spells",
          "description": "You gain oathbreaker spells at the paladin levels listed."
        },
        {
          "name": "Aura of Hate",
          "description": "Starting at 7th level, the paladin, as well any fiends and undead within 10 feet of the paladin, gains a bonus to melee weapon damage rolls equal to the paladin's Charisma modifier (minimum of +1). A creature can benefit from this feature from only one paladin at a time. At 18th level, the range of this aura increases to 30 feet."
        },
        {
          "name": "Supernatural Resistance",
          "description": "At 15th level, the paladin gains resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons."
        },
        {
          "name": "Dread Lord",
          "description": "At 20th level, the paladin can, as an action, surround himself or herself with an aura of gloom that lasts for 1 minute. The aura reduces any bright light in a 30-foot radius around the paladin to dim light. Whenever an enemy that is frightened by the paladin starts its turn in the aura, it takes 4d10 psychic damage."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Oathbreaker",
            "Channel Divinity",
            "Control Undead",
            "Dreadful Aspect",
            "Oathbreaker Spells"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Aura of Hate"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Supernatural Resistance"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Dread Lord"
          ]
        }
      }
    },
    {
      "name": "Oath of the Crown",
      "description": "The Oath of the Crown is sworn to the ideals of civilization, be it the spirit of a nation, fealty to a sovereign, or service to a deity of law and rulership. The paladins who swear this oath dedicate themselves to serving society and, in particular, the laws that hold society together.",
      "features": [
        {
          "name": "Oath of the Crown",
          "description": "The Oath of the Crown is sworn to the ideals of civilization, be it the spirit of a nation, fealty to a sovereign, or service to a deity of law and rulership. The paladins who swear this oath dedicate themselves to serving society and, in particular, the laws that hold society together."
        },
        {
          "name": "Champion Challenge",
          "description": "As a bonus action, you issue a challenge that compels other creatures to do battle with you. Each creature of your choice that you can see within 30 feet of you must make a Wisdom saving throw. On a failed save, a creature can't willingly move more than 30 feet away from you. This effect ends on the creature if you are incapacitated or die or if the creature is more than 30 feet away from you."
        },
        {
          "name": "Channel Divinity",
          "description": "When you take this oath at 3rd level, you gain the following two Channel Divinity options."
        },
        {
          "name": "Oath Spells",
          "description": "You gain oath spells at the paladin levels listed."
        },
        {
          "name": "Tenets of the Crown",
          "description": "The tenets of the Oath of the Crown are often set by the sovereign to which their oath is sworn, but generally emphasize the following tenets. Law: The law is paramount. It is the mortar that holds the stones of civilization together, and it must be respected. Loyalty: Your word is your bond. Without loyalty, oaths and laws are meaningless."
        },
        {
          "name": "Turn the Tide",
          "description": "As a bonus action, you can bolster injured creatures with your Channel Divinity. Each creature of your choice that can hear you within 30 feet of you regains hit points equal to 1d6 + your Charisma modifier (minimum of 1) if it has no more than half of its hit points."
        },
        {
          "name": "Divine Allegiance",
          "description": "Starting at 7th level, when a creature within 5 feet of you takes damage, you can use your reaction to magically substitute your own health for that of the target creature, causing that creature not to take the damage. Instead, you take the damage. This damage to you can't be reduced or prevented in any way."
        },
        {
          "name": "Unyielding Spirit",
          "description": "Starting at 15th level, you have advantage on saving throws to avoid becoming paralyzed or stunned."
        },
        {
          "name": "Exalted Champion",
          "description": "At 20th level, your presence on the field of battle is an inspiration to those dedicated to your cause. You can use your action to gain the following benefits for 1 hour: You have resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons. Your allies have advantage on death saving throws while within 30 feet of you."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Oath of the Crown",
            "Champion Challenge",
            "Channel Divinity",
            "Oath Spells",
            "Tenets of the Crown",
            "Turn the Tide"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Divine Allegiance"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Unyielding Spirit"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Exalted Champion"
          ]
        }
      }
    },
    {
      "name": "Oath of Conquest",
      "description": "The Oath of Conquest calls to paladins who seek glory in battle and the subjugation of their enemies. It isn't enough for these paladins to establish order. They must crush the forces of chaos.",
      "features": [
        {
          "name": "Oath of Conquest",
          "description": "The Oath of Conquest calls to paladins who seek glory in battle and the subjugation of their enemies. It isn't enough for these paladins to establish order. They must crush the forces of chaos. Sometimes called knight tyrants or iron mongers, those who swear this oath gather into grim orders that serve gods or philosophies of war and well-ordered might."
        },
        {
          "name": "Channel Divinity",
          "description": "When you take this oath at 3rd level, you gain the following two Channel Divinity options."
        },
        {
          "name": "Conquering Presence",
          "description": "You can use your Channel Divinity to exude a terrifying presence. As an action, you force each creature of your choice that you can see within 30 feet of you to make a Wisdom saving throw. On a failed save, a creature becomes frightened of you for 1 minute. The frightened creature can repeat this saving throw at the end of each of its turns, ending the effect on itself on a success."
        },
        {
          "name": "Guided Strike",
          "description": "You can use your Channel Divinity to strike with supernatural accuracy. When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses."
        },
        {
          "name": "Oath Spells",
          "description": "You gain oath spells at the paladin levels listed."
        },
        {
          "name": "Tenets of Conquest",
          "description": "A paladin who takes this oath has the tenets of conquest seared on the upper arm. Douse the Flame of Hope: It is not enough to merely defeat an enemy in battle. Your victory must be so overwhelming that your enemies' will to fight is shattered forever. A blade can end a life. Fear can end an empire. Rule with an Iron Fist: Once you have conquered, tolerate no dissent. Your word is law."
        },
        {
          "name": "Aura of Conquest",
          "description": "Starting at 7th level, you constantly emanate a menacing aura while you're not incapacitated. The aura extends 10 feet from you in every direction, but not through Cover. If a creature is frightened of you, its speed is reduced to 0 while in the aura, and that creature takes psychic damage equal to half your paladin level if it starts its turn there."
        },
        {
          "name": "Scornful Rebuke",
          "description": "Starting at 15th level, those who dare to strike you are psychically punished for their audacity. Whenever a creature hits you with an attack, that creature takes psychic damage equal to your Charisma modifier (minimum of 1) if you're not incapacitated."
        },
        {
          "name": "Invincible Conqueror",
          "description": "At 20th level, you gain the ability to harness extraordinary martial prowess. As an action, you can magically become an avatar of conquest, gaining the following benefits for 1 minute: You have resistance to all damage. When you take the Attack action on your turn, you can make one additional attack as part of that action."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Oath of Conquest",
            "Channel Divinity",
            "Conquering Presence",
            "Guided Strike",
            "Oath Spells",
            "Tenets of Conquest"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Aura of Conquest"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Scornful Rebuke"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Invincible Conqueror"
          ]
        }
      }
    },
    {
      "name": "Oath of Redemption",
      "description": "The Oath of Redemption sets a paladin on a difficult path, one that requires a holy warrior to use violence only as a last resort. Paladins who dedicate themselves to this oath believe that any person can be redeemed and that the path of benevolence and justice is one that anyone can walk.",
      "features": [
        {
          "name": "Oath of Redemption",
          "description": "The Oath of Redemption sets a paladin on a difficult path, one that requires a holy warrior to use violence only as a last resort. Paladins who dedicate themselves to this oath believe that any person can be redeemed and that the path of benevolence and justice is one that anyone can walk."
        },
        {
          "name": "Channel Divinity",
          "description": "When you take this oath at 3rd level, you gain the following two Channel Divinity options."
        },
        {
          "name": "Emissary of Peace",
          "description": "You can use your Channel Divinity to augment your presence with divine power. As a bonus action, you grant yourself a +5 bonus to Charisma (Persuasion) checks for the next 10 minutes."
        },
        {
          "name": "Oath Spells",
          "description": "You gain oath spells at the paladin levels listed."
        },
        {
          "name": "Rebuke the Violent",
          "description": "You can use your Channel Divinity to rebuke those who use violence. Immediately after an attacker within 30 feet of you deals damage with an attack against a creature other than you, you can use your reaction to force the attacker to make a Wisdom saving throw. On a failed save, the attacker takes radiant damage equal to the damage it just dealt. On a successful save, it takes half as much damage."
        },
        {
          "name": "Tenets of Redemption",
          "description": "The tenets of the Oath of Redemption hold a paladin to a high standard of peace and justice. Peace: Violence is a weapon of last resort. Diplomacy and understanding are the paths to long-lasting peace. Innocence: All people begin life in an innocent state, and it is their environment or the influence of dark forces that drives them to evil."
        },
        {
          "name": "Aura of the Guardian",
          "description": "Starting at 7th level, you can shield others from harm at the cost of your own health. When a creature within 10 feet of you takes damage, you can use your reaction to magically take that damage, instead of that creature taking it. This feature doesn't transfer any other effects that might accompany the damage, and this damage can't be reduced in any way."
        },
        {
          "name": "Protective Spirit",
          "description": "Starting at 15th level, a holy presence mends your wounds in battle. You regain hit points equal to 1d6 + half your paladin level if you end your turn in combat with fewer than half of your hit points remaining and you aren't incapacitated."
        },
        {
          "name": "Emissary of Redemption",
          "description": "At 20th level, you become an avatar of peace, which gives you two benefits: You have resistance to all damage dealt by other creatures (their attacks, spells, and other effects). Whenever a creature hits you with an attack, it takes radiant damage equal to half the damage you take from the attack."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Oath of Redemption",
            "Channel Divinity",
            "Emissary of Peace",
            "Oath Spells",
            "Rebuke the Violent",
            "Tenets of Redemption"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Aura of the Guardian"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Protective Spirit"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Emissary of Redemption"
          ]
        }
      }
    },
    {
      "name": "Oath of Glory",
      "description": "Immediately after you cast Divine Smite, you can expend one use of your Channel Divinity and distribute Temporary Hit Points to creatures of your choice within 30 feet of yourself, which can include you.",
      "features": [
        {
          "name": "Inspiring Smite",
          "description": "Immediately after you cast Divine Smite, you can expend one use of your Channel Divinity and distribute Temporary Hit Points to creatures of your choice within 30 feet of yourself, which can include you. The total number of Temporary Hit Points equals 2d8 plus your Paladin level, divided among the chosen creatures however you like."
        },
        {
          "name": "Oath of Glory",
          "description": "Strive for the Heights of Heroism Paladins who take the Oath of Glory believe they and their companions are destined to achieve glory through deeds of heroism. They train diligently and encourage their companions, so they're all ready when destiny calls. These paladins share the following tenets: Endeavor to be known by your deeds. Face hardships with courage. Inspire others to strive for glory."
        },
        {
          "name": "Oath of Glory Spells",
          "description": "The magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of Glory Spells table, you thereafter always have the listed spells prepared.",
          "spells": {
            "casting_ability": 5,
            "list": [
              {
                "name": "Guiding Bolt",
                "level": 1,
                "description": "You hurl a bolt of light toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 4d6 Radiant damage, and the next attack roll made against it before the end of your next turn has Advantage."
              },
              {
                "name": "Heroism",
                "level": 1,
                "description": "A willing creature you touch is imbued with bravery. Until the spell ends, the creature is immune to the Frightened condition and gains Temporary Hit Points equal to your spellcasting ability modifier at the start of each of its turns."
              },
              {
                "name": "Enhance Ability",
                "level": 2,
                "description": "You touch a creature and choose Strength, Dexterity, Intelligence, Wisdom, or Charisma. For the duration, the target has Advantage on ability checks using the chosen ability."
              },
              {
                "name": "Magic Weapon",
                "level": 2,
                "description": "You touch a nonmagical weapon. Until the spell ends, that weapon becomes a magic weapon with a +1 bonus to attack rolls and damage rolls. The spell ends early if you cast it again."
              },
              {
                "name": "Haste",
                "level": 3,
                "description": "Choose a willing creature that you can see within range. Until the spell ends, the target's Speed is doubled, it gains a +2 bonus to Armor Class, it has Advantage on Dexterity saving throws, and it gains an additional action on each of its turns."
              },
              {
                "name": "Protection from Energy",
                "level": 3,
                "description": "For the duration, the willing creature you touch has Resistance to one damage type of your choice: Acid, Cold, Fire, Lightning, or Thunder."
              },
              {
                "name": "Compulsion",
                "level": 4,
                "description": "Each creature of your choice that you can see within range must succeed on a Wisdom saving throw or have the Charmed condition until the spell ends. For the duration, you can take a Bonus Action to designate a direction that is horizontal to you."
              },
              {
                "name": "Freedom of Movement",
                "level": 4,
                "description": "You touch a willing creature. For the duration, the target's movement is unaffected by Difficult Terrain, and spells and other magical effects can neither reduce the target's Speed nor cause the target to have the Paralyzed or Restrained conditions."
              },
              {
                "name": "Legend Lore",
                "level": 5,
                "description": "Name or describe a famous person, place, or object. The spell brings to your mind a brief summary of the significant lore about that famous thing, as described by the DM. The lore might consist of important details, amusing revelations, or even secret lore that has never been widely known."
              },
              {
                "name": "Yolande's Regal Presence",
                "level": 5,
                "description": "You surround yourself with unearthly majesty in a 10-foot Emanation [Area of Effect]. Whenever the Emanation [Area of Effect] enters the space of a creature you can see and whenever a creature you can see enters the Emanation [Area of Effect] or ends its turn there, you can force that creature to..."
              }
            ]
          }
        },
        {
          "name": "Peerless Athlete",
          "description": "As a Bonus Action, you can expend one use of your Channel Divinity to augment your athleticism. For 1 hour, you have Advantage on Strength (Athletics) and Dexterity (Acrobatics) checks, and the distance of your Long and High Jumps increases by 10 feet (this extra distance costs movement as normal)."
        },
        {
          "name": "Aura of Alacrity",
          "description": "Your Speed increases by 10 feet. In addition, whenever an ally enters your Aura of Protection for the first time on a turn or starts their turn there, the ally's Speed increases by 10 feet until the end of their next turn."
        },
        {
          "name": "Glorious Defense",
          "description": "You can turn defense into a sudden strike. When you or another creature you can see within 10 feet of you is hit by an attack roll, you can take a Reaction to grant a bonus to the target's AC against that attack, potentially causing it to miss. The bonus equals your Charisma modifier (minimum of +1)."
        },
        {
          "name": "Living Legend",
          "description": "You can empower yourself with the legends—whether true or exaggerated—of your great deeds. As a Bonus Action, you gain the benefits below for 10 minutes. Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required)."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Inspiring Smite",
            "Oath of Glory",
            "Oath of Glory Spells",
            "Peerless Athlete"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Aura of Alacrity"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Glorious Defense"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Living Legend"
          ]
        }
      }
    },
    {
      "name": "Oath of the Watchers",
      "description": "The Oath of the Watchers binds paladins to protect mortal realms from the predations of extraplanar creatures, many of which can lay waste to mortal soldiers. Thus, the Watchers hone their minds, spirits, and bodies to be the ultimate weapons against such threats.",
      "features": [
        {
          "name": "Oath of the Watchers",
          "description": "The Oath of the Watchers binds paladins to protect mortal realms from the predations of extraplanar creatures, many of which can lay waste to mortal soldiers. Thus, the Watchers hone their minds, spirits, and bodies to be the ultimate weapons against such threats."
        },
        {
          "name": "Channel Divinity",
          "description": "3rd-level Oath of the Watchers feature You gain the following Channel Divinity options. See the Sacred Oath class feature for how Channel Divinity works."
        },
        {
          "name": "Oath Spells",
          "description": "3rd-level Oath of the Watchers feature You gain oath spells at the paladin levels listed in the Oath of the Watchers table. See the Sacred Oath class feature for how oath spells work."
        },
        {
          "name": "Tenets of the Watchers",
          "description": "A paladin who assumes the Oath of the Watchers swears to safeguard mortal realms from otherworldly threats. Vigilance: The threats you face are cunning, powerful, and subversive. Be ever alert for their corruption. Loyalty: Never accept gifts or favors from fiends or those who truck with them. Stay true to your order, your comrades, and your duty."
        },
        {
          "name": "Abjure the Extraplanar",
          "description": "You can use your Channel Divinity to castigate unworldly beings. As an action, you present your holy symbol and each aberration, celestial, elemental, fey, or fiend within 30 feet of you that can hear you must make a Wisdom saving throw. On a failed save, the creature is turned for 1 minute or until it takes damage."
        },
        {
          "name": "Watcher's Will",
          "description": "You can use your Channel Divinity to invest your presence with the warding power of your faith. As an action, you can choose a number of creatures you can see within 30 feet of you, up to a number equal to your Charisma modifier (minimum of one creature). For 1 minute, you and the chosen creatures have advantage on Intelligence, Wisdom, and Charisma saving throws."
        },
        {
          "name": "Aura of the Sentinel",
          "description": "7th-level Oath of the Watchers feature You emit an aura of alertness while you aren't incapacitated. When you and any creatures of your choice within 10 feet of you roll initiative, you all gain a bonus to initiative equal to your proficiency bonus. At 18th level, the range of this aura increases to 30 feet."
        },
        {
          "name": "Vigilant Rebuke",
          "description": "15th-level Oath of the Watchers feature You've learned how to chastise anyone who dares wield beguilements against you and your wards. Whenever you or a creature you can see within 30 feet of you succeeds on an Intelligence, a Wisdom, or a Charisma saving throw, you can use your reaction to deal 2d8 + your Charisma modifier force damage to the creature that forced the saving throw."
        },
        {
          "name": "Mortal Bulwark",
          "description": "20th-level Oath of the Watchers feature You manifest a spark of divine power in defense of the mortal realms. As a bonus action, you gain the following benefits for 1 minute: You gain truesight with a range of 120 feet. You have advantage on attack rolls against aberrations, celestials, elementals, fey, and fiends."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Oath of the Watchers",
            "Channel Divinity",
            "Oath Spells",
            "Tenets of the Watchers",
            "Abjure the Extraplanar",
            "Watcher's Will"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Aura of the Sentinel"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Vigilant Rebuke"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Mortal Bulwark"
          ]
        }
      }
    },
    {
      "name": "Oath of the Noble Genies",
      "description": "Earth rises up around the target of your Divine Smite. The target has the Grappled condition (escape DC equal to your spell save DC). While Grappled, the target has the Restrained condition.",
      "features": [
        {
          "name": "Dao's Crush",
          "description": "Earth rises up around the target of your Divine Smite. The target has the Grappled condition (escape DC equal to your spell save DC). While Grappled, the target has the Restrained condition."
        },
        {
          "name": "Djinni's Escape",
          "description": "You Teleportation to an unoccupied space you can see within 30 feet of yourself and take on a semi-incorporeal form, which lasts until the end of your next turn. While in this form, you have Resistance to Bludgeoning, Piercing, and Slashing damage, and you have Immunity to the Grappled, Prone, and Restrained conditions."
        },
        {
          "name": "Efreeti's Fury",
          "description": "The target of your Divine Smite takes an extra 2d4 Fire damage, and fire jumps from the target to another creature you can see within 30 feet of yourself. The second creature also takes 2d4 Fire damage."
        },
        {
          "name": "Elemental Smite",
          "description": "Immediately after you cast Divine Smite, you can expend one use of your Channel Divinity and invoke one of the following effects."
        },
        {
          "name": "Genie Spells",
          "description": "When you reach a Paladin level specified in the Genie Spells table, you thereafter always have the listed spells prepared.",
          "spells": {
            "casting_ability": 5,
            "list": [
              {
                "name": "Elementalism",
                "level": 0,
                "description": "You exert control over the elements, creating one of the following effects within range. Beckon Air: You create a breeze strong enough to ripple cloth, stir dust, rustle leaves, and close open doors and shutters, all in a 5-foot Cube [Area of Effect]."
              },
              {
                "name": "Chromatic Orb",
                "level": 1,
                "description": "You hurl an orb of energy at a target within range. Choose Acid, Cold, Fire, Lightning, Poison, or Thunder for the type of orb you create, and then make a ranged spell attack against the target. On a hit, the target takes 3d8 damage of the chosen type."
              },
              {
                "name": "Thunderous Smite",
                "level": 1,
                "description": "Your strike rings with thunder that is audible within 300 feet of you, and the target takes an extra 2d6 Thunder damage from the attack. Additionally, if the target is a creature, it must succeed on a Strength saving throw or be pushed 10 feet away from you and have the Prone condition."
              },
              {
                "name": "Mirror Image",
                "level": 2,
                "description": "Three illusory duplicates of yourself appear in your space. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it's impossible to track which image is real."
              },
              {
                "name": "Phantasmal Force",
                "level": 2,
                "description": "You attempt to craft an illusion in the mind of a creature you can see within range. The target makes an Intelligence saving throw. On a failed save, you create a phantasmal object, creature, or other phenomenon that is no larger than a 10-foot Cube [Area of Effect] and that is perceivable only t..."
              },
              {
                "name": "Fly",
                "level": 3,
                "description": "You touch a willing creature. For the duration, the target gains a Fly Speed of 60 feet and can hover. When the spell ends, the target falls if it is still aloft unless it can stop the fall."
              },
              {
                "name": "Gaseous Form",
                "level": 3,
                "description": "A willing creature you touch shape-shifts, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends on the target if it drops to 0 Hit Points or if it takes a Magic action to end the spell on itself."
              },
              {
                "name": "Conjure Minor Elementals",
                "level": 4,
                "description": "You conjure spirits from the Elemental Planes that flit around you in a 15-foot Emanation [Area of Effect] for the duration. Until the spell ends, any attack you make deals an extra 2d8 damage when you hit a creature in the Emanation [Area of Effect]."
              },
              {
                "name": "Summon Elemental",
                "level": 4,
                "description": "You call forth an Elemental spirit. It manifests in an unoccupied space that you can see within range and uses the Elemental Spirit stat block. When you cast the spell, choose an element: Air, Earth, Fire, or Water."
              },
              {
                "name": "Banishing Smite",
                "level": 5,
                "description": "The target hit by the attack roll takes an extra 5d10 Force damage from the attack. If the attack reduces the target to 50 Hit Points or fewer, the target must succeed on a Charisma saving throw or be transported to a harmless demiplane for the duration."
              },
              {
                "name": "Contact Other Plane",
                "level": 5,
                "description": "You mentally contact a demigod, the spirit of a long-dead sage, or some other knowledgeable entity from another plane. Contacting this otherworldly intelligence can break your mind. When you cast this spell, make a 15 Intelligence saving throw."
              }
            ]
          }
        },
        {
          "name": "Genie's Splendor",
          "description": "When you aren't wearing any armor, your base Armor Class equals 10 plus your Dexterity and Charisma modifiers. You can use a Shield and still gain this benefit. You also gain proficiency in one of the following skills of your choice: Acrobatics, Intimidation, Performance, or Persuasion."
        },
        {
          "name": "Marid's Surge",
          "description": "The target of your Divine Smite and each creature of your choice in a 10-foot Emanation [Area of Effect] originating from you make a Strength saving throw against your spell save DC. On a failed save, a creature is pushed 15 feet straight away from you and has the Prone condition."
        },
        {
          "name": "Oath of the Noble Genies",
          "description": "Brandish the Elemental Splendor of Genies Paladins sworn to the Oath of the Noble Genies revere the forces of the Elemental Planes. Through taking this oath, Paladins draw power from the four different types of genies—dao, masters of earth; djinn, masters of air; efreet, masters of fire; and marids, masters of water."
        },
        {
          "name": "Aura of Elemental Shielding",
          "description": "Choose one of the following damage types: Acid, Cold, Fire, Lightning, or Thunder. You and your allies have Resistance to that damage type while in your Aura of Protection. At the start of each of your turns, you can change the damage type affected by this feature to one of the other listed options (no action required)."
        },
        {
          "name": "Elemental Rebuke",
          "description": "When you are hit by an attack roll, you can take a Reaction to halve the attack's damage against yourself (round down) and force the attacker to make a Dexterity saving throw against your spell save DC. On a failed save, the attacker takes damage equal to 2d10 plus your Charisma modifier of one of the following types (your choice): Acid, Cold, Fire, Lightning, or Thunder."
        },
        {
          "name": "Noble Scion",
          "description": "As a Bonus Action, you gain the benefits below for 10 minutes or until you end them (no action required). Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required). Flight: You have a Fly Speed of 60 feet and can hover."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Dao's Crush",
            "Djinni's Escape",
            "Efreeti's Fury",
            "Elemental Smite",
            "Genie Spells",
            "Genie's Splendor",
            "Marid's Surge",
            "Oath of the Noble Genies"
          ]
        },
        "7": {
          "level": 7,
          "features": [
            "Aura of Elemental Shielding"
          ]
        },
        "15": {
          "level": 15,
          "features": [
            "Elemental Rebuke"
          ]
        },
        "20": {
          "level": 20,
          "features": [
            "Noble Scion"
          ]
        }
      }
    }
  ]
}
