{
  "name": "Sorcerer",
  "description": "A spellcaster who draws on inherent magic from a gift or bloodline.",
  "hit_die": 6,
  "proficiencies": [
    4
  ],
  "saving_throws": [
    2,
    5
  ],
  "features": [
    {
      "name": "Innate Sorcery",
      "description": "An event in your past left an indelible mark on you, infusing you with simmering magic. As a Bonus Action, you can unleash that magic for 1 minute, during which you gain the following benefits: The spell save DC of your Sorcerer spells increases by 1. You have Advantage on the attack rolls of Sorcerer spells you cast."
    },
    {
      "name": "Spellcasting",
      "description": "Drawing from your innate magic, you can cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Sorcerer spells, which appear in the Sorcerer spell list later in the class's description. Cantrips: You know four Sorcerer cantrips of your choice. Light, Prestidigitation, Shocking Grasp, and Sorcerous Burst are recommended.",
      "spells": {
        "casting_ability": 5,
        "list": {
          "from": "spells/sorcerer.json"
        },
        "levels": [
          {
            "cantrips": 4,
            "spells": 2,
            "slots": [
              2
            ]
          },
          {
            "cantrips": 4,
            "spells": 3,
            "slots": [
              3
            ]
          },
          {
            "cantrips": 4,
            "spells": 4,
            "slots": [
              4,
              2
            ]
          },
          {
            "cantrips": 5,
            "spells": 5,
            "slots": [
              4,
              3
            ]
          },
          {
            "cantrips": 5,
            "spells": 6,
            "slots": [
              4,
              3,
              2
            ]
          },
          {
            "cantrips": 5,
            "spells": 7,
            "slots": [
              4,
              3,
              3
            ]
          },
          {
            "cantrips": 5,
            "spells": 8,
            "slots": [
              4,
              3,
              3,
              1
            ]
          },
          {
            "cantrips": 5,
            "spells": 9,
            "slots": [
              4,
              3,
              3,
              2
            ]
          },
          {
            "cantrips": 5,
            "spells": 10,
            "slots": [
              4,
              3,
              3,
              3,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 11,
            "slots": [
              4,
              3,
              3,
              3,
              2
            ]
          },
          {
            "cantrips": 6,
            "spells": 12,
            "slots": [
              4,
              3,
              3,
              3,
              2,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 12,
            "slots": [
              4,
              3,
              3,
              3,
              2,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 13,
            "slots": [
              4,
              3,
              3,
              3,
              2,
              1,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 13,
            "slots": [
              4,
              3,
              3,
              3,
              2,
              1,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 14,
            "slots": [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 14,
            "slots": [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 15,
            "slots": [
              4,
              3,
              3,
              3,
              2,
              1,
              1,
              1,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 15,
            "slots": [
              4,
              3,
              3,
              3,
              3,
              1,
              1,
              1,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 15,
            "slots": [
              4,
              3,
              3,
              3,
              3,
              2,
              1,
              1,
              1
            ]
          },
          {
            "cantrips": 6,
            "spells": 15,
            "slots": [
              4,
              3,
              3,
              3,
              3,
              2,
              2,
              1,
              1
            ]
          }
        ],
        "caster_coef": 1
      }
    },
    {
      "name": "Font of Magic",
      "description": "You can tap into the wellspring of magic within yourself. This wellspring is represented by Sorcery Points, which allow you to create a variety of magical effects. You have 2 Sorcery Points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer Features table. You can't have more Sorcery Points than the number shown in the table for your level.",
      "fields": [
        {
          "name": "Sorcery Points",
          "description": "The number of Sorcery Points you have.",
          "kind": "Points",
          "levels": {
            "2": 2,
            "3": 3,
            "4": 4,
            "5": 5,
            "6": 6,
            "7": 7,
            "8": 8,
            "9": 9,
            "10": 10,
            "11": 11,
            "12": 12,
            "13": 13,
            "14": 14,
            "15": 15,
            "16": 16,
            "17": 17,
            "18": 18,
            "19": 19,
            "20": 20
          }
        }
      ]
    },
    {
      "name": "Metamagic",
      "description": "Because your magic flows from within, you can alter your spells to suit your needs; you gain two Metamagic options of your choice from \"Metamagic Options\" later in this class's description. You use the chosen options to temporarily modify spells you cast. To use an option, you must spend the number of Sorcery Points that it costs.",
      "fields": [
        {
          "name": "Metamagic",
          "description": "The Metamagic options you have chosen and the number of Sorcery Points required to use each of them.",
          "kind": "Choice",
          "cost": "Sorcery Points",
          "levels": {
            "3": 2,
            "10": 4,
            "17": 6
          },
          "options": [
            {
              "name": "Careful Spell",
              "description": "When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, you spend 1 Sorcery Point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell.",
              "cost": 1
            },
            {
              "name": "Distant Spell",
              "description": "When you cast a spell that has a range of 5 feet or greater, you can spend 1 Sorcery Point to double the range of the spell.",
              "cost": 1
            },
            {
              "name": "Empowered Spell",
              "description": "When you roll damage for a spell, you can spend 1 Sorcery Point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls.",
              "cost": 1
            },
            {
              "name": "Extended Spell",
              "description": "When you cast a spell that has a duration of 1 minute or longer, you can spend 1 Sorcery Point to double its duration, up to a maximum duration of 24 hours.",
              "cost": 1
            },
            {
              "name": "Heightened Spell",
              "description": "When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 Sorcery Points to give one target of the spell Disadvantage on its first saving throw made against the spell.",
              "cost": 2
            },
            {
              "name": "Quickened Spell",
              "description": "When you cast a spell that has a casting time of 1 Action, you can spend 2 Sorcery Points to change the casting time to 1 Bonus Action for this casting.",
              "cost": 2
            },
            {
              "name": "Subtle Spell",
              "description": "When you cast a spell, you can spend 1 Sorcery Point to cast it without any somatic or verbal components.",
              "cost": 1
            },
            {
              "name": "Twinned Spell",
              "description": "When you cast a spell that targets only one creature and doesn't have a range of Self, you can spend a number of Sorcery Points equal to the spell's level to target a second creature in range with the same spell (1 Sorcery Point if the spell is a cantrip).",
              "cost": 1
            },
            {
              "name": "Seeking Spell",
              "description": "When you cast a spell that requires you to make an attack roll, you can spend 2 Sorcery Points to reroll the attack roll. You must use the new roll.",
              "cost": 1
            },
            {
              "name": "Transmuted Spell",
              "description": "When you cast a spell that deals a type of damage from the following list, you can spend 1 Sorcery Point to change that damage type to another type from the list: Acid, Cold, Fire, Lightning, Poison, Psychic, or Thunder.",
              "cost": 1
            }
          ]
        }
      ]
    },
    {
      "name": "Sorcerer Subclass",
      "description": "You gain a Sorcerer subclass of your choice. A subclass is a specialization that grants you features at certain Sorcerer levels. For the rest of your career, you gain each of your subclass's features that are of your Sorcerer level or lower."
    },
    {
      "name": "Ability Score Improvement",
      "description": "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Sorcerer levels 8, 12, and 16."
    },
    {
      "name": "Sorcerous Restoration",
      "description": "When you finish a Short Rest, you can regain expended Sorcery Points, but no more than a number equal to half your Sorcerer level (round down). Once you use this feature, you can't do so again until you finish a Long Rest."
    },
    {
      "name": "Sorcery Incarnate",
      "description": "If you have no uses of Innate Sorcery left, you can use it if you spend 2 Sorcery Points when you take the Bonus Action to activate it. In addition, while your Innate Sorcery feature is active, you can use up to two of your Metamagic options on each spell you cast."
    },
    {
      "name": "Epic Boon",
      "description": "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Dimensional Travel is recommended."
    },
    {
      "name": "Arcane Apotheosis",
      "description": "While your Innate Sorcery feature is active, you can use one Metamagic option on each of your turns without spending Sorcery Points on it."
    }
  ],
  "levels": [
    {
      "features": [
        "Innate Sorcery",
        "Spellcasting"
      ]
    },
    {
      "features": [
        "Font of Magic",
        "Metamagic",
        "Metamagic Options"
      ]
    },
    {
      "features": [
        "Sorcerer Subclass"
      ]
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Sorcerous Restoration"
      ]
    },
    {
      "features": [
        "Subclass Feature"
      ]
    },
    {
      "features": [
        "Sorcery Incarnate"
      ],
      "sorcery_points": 7
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Metamagic"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Subclass Feature"
      ]
    },
    {
      "features": []
    },
    {
      "features": [
        "Ability Score Improvement"
      ]
    },
    {
      "features": [
        "Metamagic"
      ]
    },
    {
      "features": [
        "Subclass Feature"
      ]
    },
    {
      "features": [
        "Epic Boon"
      ]
    },
    {
      "features": [
        "Arcane Apotheosis"
      ]
    }
  ],
  "subclasses": [
    {
      "name": "Draconic Bloodline",
      "description": "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors. Most often, sorcerers with this origin trace their descent back to a mighty sorcerer of ancient times who made a bargain with a dragon or who might even have claimed a dragon parent.",
      "features": [
        {
          "name": "Draconic Bloodline",
          "description": "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors. Most often, sorcerers with this origin trace their descent back to a mighty sorcerer of ancient times who made a bargain with a dragon or who might even have claimed a dragon parent. Some of these bloodlines are well established in the world, but most are obscure."
        },
        {
          "name": "Draconic Resilience",
          "description": "As magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class. Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren't wearing armor, your AC equals 13 + your Dexterity modifier."
        },
        {
          "name": "Dragon Ancestor",
          "description": "At 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later. You can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check."
        },
        {
          "name": "Elemental Affinity",
          "description": "Starting at 6th level, when you cast a spell that deals damage of the type associated with your draconic ancestry, you can add your Charisma modifier to one damage roll of that spell. At the same time, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour."
        },
        {
          "name": "Dragon Wings",
          "description": "At 14th level, you gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current speed. You can create these wings as a bonus action on your turn. They last until you dismiss them as a bonus action on your turn."
        },
        {
          "name": "Draconic Presence",
          "description": "Beginning at 18th level, you can channel the dread presence of your dragon ancestor, causing those around you to become awestruck or frightened. As an action, you can spend 5 sorcery points to draw on this power and exude an aura of awe or fear (your choice) to a distance of 60 feet."
        }
      ],
      "levels": {
        "1": {
          "level": 1,
          "features": [
            "Draconic Bloodline",
            "Draconic Resilience",
            "Dragon Ancestor"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Draconic Bloodline"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Elemental Affinity"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Dragon Wings"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Draconic Presence"
          ]
        }
      }
    },
    {
      "name": "Wild Magic",
      "description": "Your innate magic comes from the wild forces of chaos that underlie the order of creation. You might have endured exposure to some form of raw magic, perhaps through a planar portal leading to Limbo, the Elemental Planes, or the mysterious Far Realm.",
      "features": [
        {
          "name": "Wild Magic",
          "description": "Your innate magic comes from the wild forces of chaos that underlie the order of creation. You might have endured exposure to some form of raw magic, perhaps through a planar portal leading to Limbo, the Elemental Planes, or the mysterious Far Realm. Perhaps you were blessed by a powerful fey creature or marked by a demon."
        },
        {
          "name": "Tides of Chaos",
          "description": "Starting at 1st level, you can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. Once you do so, you must finish a long rest before you can use this feature again."
        },
        {
          "name": "Wild Magic Surge",
          "description": "Starting when you choose this origin at 1st level, your spellcasting can unleash surges of untamed magic. Immediately after you cast a sorcerer spell of 1st level or higher, the DM can have you roll a d20. If you roll a 1, roll on the Wild Magic Surge table to create a random magical effect. A Wild Magic Surge can happen once per turn."
        },
        {
          "name": "Bend Luck",
          "description": "Starting at 6th level, you have the ability to twist fate using your wild magic. When another creature you can see makes an attack roll, an ability check, or a saving throw, you can use your reaction and spend 2 sorcery points to roll 1d4 and apply the number rolled as a bonus or penalty (your choice) to the creature's roll."
        },
        {
          "name": "Controlled Chaos",
          "description": "At 14th level, you gain a modicum of control over the surges of your wild magic. Whenever you roll on the Wild Magic Surge table, you can roll twice and use either number."
        },
        {
          "name": "Spell Bombardment",
          "description": "Beginning at 18th level, the harmful energy of your spells intensifies. When you roll damage for a spell and roll the highest number possible on any of the dice, choose one of those dice, roll it again and add that roll to the damage. You can use the feature only once per turn."
        }
      ],
      "levels": {
        "1": {
          "level": 1,
          "features": [
            "Wild Magic",
            "Tides of Chaos",
            "Wild Magic Surge"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Wild Magic"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Bend Luck"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Controlled Chaos"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Spell Bombardment"
          ]
        }
      }
    },
    {
      "name": "Pyromancer (PSK)",
      "description": "Your innate magic manifests in fire. You are your fire, and your fire is you.",
      "features": [
        {
          "name": "Pyromancer (PSK)",
          "description": "Your innate magic manifests in fire. You are your fire, and your fire is you."
        },
        {
          "name": "Heart of Fire",
          "description": "At 1st level, whenever you start casting a spell of 1st level or higher that deals fire damage, fiery magic erupts from you. This eruption causes creatures of your choice that you can see within 10 feet of you to take fire damage equal to half your sorcerer level (minimum of 1)."
        },
        {
          "name": "Fire in the Veins",
          "description": "At 6th level, you gain resistance to fire damage. In addition, spells you cast ignore resistance to fire damage."
        },
        {
          "name": "Pyromancer's Fury",
          "description": "Starting at 14th level, when you are hit by a melee attack, you can use your reaction to deal fire damage to the attacker. The damage equals your sorcerer level, and ignores resistance to fire damage."
        },
        {
          "name": "Fiery Soul",
          "description": "At 18th level, you gain immunity to fire damage. In addition, any spell or effect you create ignores resistance to fire damage and treats immunity to fire damage as resistance to fire damage."
        }
      ],
      "levels": {
        "1": {
          "level": 1,
          "features": [
            "Pyromancer (PSK)",
            "Heart of Fire"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Pyromancer (PSK)"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Fire in the Veins"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Pyromancer's Fury"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Fiery Soul"
          ]
        }
      }
    },
    {
      "name": "Divine Soul",
      "description": "Sometimes the spark of magic that fuels a sorcerer comes from a divine source that glimmers within the soul. Having such a blessed soul is a sign that your innate magic might come from a distant but powerful familial connection to a divine being.",
      "features": [
        {
          "name": "Divine Soul",
          "description": "Sometimes the spark of magic that fuels a sorcerer comes from a divine source that glimmers within the soul. Having such a blessed soul is a sign that your innate magic might come from a distant but powerful familial connection to a divine being. Perhaps your ancestor was an angel, transformed into a mortal and sent to fight in a god's name."
        },
        {
          "name": "Divine Magic",
          "description": "Your link to the divine allows you to learn spells from the cleric class. When your Spellcasting feature lets you learn or replace a sorcerer cantrip or a sorcerer spell of 1st level or higher, you can choose the new spell from the cleric spell list or the sorcerer spell list. You must otherwise obey all the restrictions for selecting the spell, and it becomes a sorcerer spell for you."
        },
        {
          "name": "Favored by the Gods",
          "description": "Starting at 1st level, divine power guards your destiny. If you fail a saving throw or miss with an attack roll, you can roll 2d4 and add it to the total, possibly changing the outcome. Once you use this feature, you can't use it again until you finish a short or long rest."
        },
        {
          "name": "Empowered Healing",
          "description": "Starting at 6th level, the divine energy coursing through you can empower healing spells. Whenever you or an ally within 5 feet of you rolls dice to determine the number of hit points a spell restores, you can spend 1 sorcery point to reroll any number of those dice once, provided you aren't incapacitated. You can use this feature only once per turn."
        },
        {
          "name": "Otherworldly Wings",
          "description": "Starting at 14th level, you can use a bonus action to manifest a pair of spectral wings from your back. While the wings are present, you have a flying speed of 30 feet. The wings last until you're incapacitated, you die, or you dismiss them as a bonus action."
        },
        {
          "name": "Unearthly Recovery",
          "description": "At 18th level, you gain the ability to overcome grievous injuries. As a bonus action when you have fewer than half of your hit points remaining, you can regain a number of hit points equal to half your hit point maximum. Once you use this feature, you can't use it again until you finish a long rest."
        }
      ],
      "levels": {
        "1": {
          "level": 1,
          "features": [
            "Divine Soul",
            "Divine Magic",
            "Favored by the Gods"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Divine Soul"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Empowered Healing"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Otherworldly Wings"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Unearthly Recovery"
          ]
        }
      }
    },
    {
      "name": "Shadow Magic",
      "description": "You are a creature of shadow, for your innate magic comes from the Shadowfell itself. You might trace your lineage to an entity from that place, or perhaps you were exposed to its fell energy and transformed by it. The power of shadow magic casts a strange pall over your physical presence.",
      "features": [
        {
          "name": "Shadow Magic",
          "description": "You are a creature of shadow, for your innate magic comes from the Shadowfell itself. You might trace your lineage to an entity from that place, or perhaps you were exposed to its fell energy and transformed by it. The power of shadow magic casts a strange pall over your physical presence."
        },
        {
          "name": "Eyes of the Dark",
          "description": "Starting at 1st level, you have darkvision with a range of 120 feet. When you reach 3rd level in this class, you learn the darkness spell, which doesn't count against your number of sorcerer spells known. In addition, you can cast it by spending 2 sorcery points or by expending a spell slot. If you cast it with sorcery points, you can see through the darkness created by the spell."
        },
        {
          "name": "Strength of the Grave",
          "description": "Starting at 1st level, your existence in a twilight state between life and death makes you difficult to defeat. When damage reduces you to 0 hit points, you can make a Charisma saving throw (5 + the damage taken). On a success, you instead drop to 1 hit point. You can't use this feature if you are reduced to 0 hit points by radiant damage or by a critical hit."
        },
        {
          "name": "Hound of Ill Omen",
          "description": "At 6th level, you gain the ability to call forth a howling creature of darkness to harass your foes. As a bonus action, you can spend 3 sorcery points to magically summon a hound of ill omen to target one creature you can see within 120 feet of you."
        },
        {
          "name": "Shadow Walk",
          "description": "At 14th level, you gain the ability to step from one shadow into another. When you are in dim light or darkness, as a bonus action, you can magically teleport up to 120 feet to an unoccupied space you can see that is also in dim light or darkness."
        },
        {
          "name": "Umbral Form",
          "description": "Starting at 18th level, you can spend 6 sorcery points as a bonus action to magically transform yourself into a shadowy form. In this form, you have resistance to all damage except force and radiant damage, and you can move through other creatures and objects as if they were difficult terrain. You take 5 force damage if you end your turn inside an object. You remain in this form for 1 minute."
        }
      ],
      "levels": {
        "1": {
          "level": 1,
          "features": [
            "Shadow Magic",
            "Eyes of the Dark",
            "Strength of the Grave"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Shadow Magic"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Hound of Ill Omen"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Shadow Walk"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Umbral Form"
          ]
        }
      }
    },
    {
      "name": "Storm Sorcery",
      "description": "Your innate magic comes from the power of elemental air. Many with this power can trace their magic back to a near-death experience caused by the Great Rain, but perhaps you were born during a howling gale so powerful that folk still tell stories of it, or your lineage might include the influence...",
      "features": [
        {
          "name": "Storm Sorcery",
          "description": "Your innate magic comes from the power of elemental air. Many with this power can trace their magic back to a near-death experience caused by the Great Rain, but perhaps you were born during a howling gale so powerful that folk still tell stories of it, or your lineage might include the influence of potent air creatures such as djinn."
        },
        {
          "name": "Tempestuous Magic",
          "description": "Starting at 1st level, you can use a bonus action on your turn to cause whirling gusts of elemental air to briefly surround you, immediately before or after you cast a spell of 1st level or higher. Doing so allows you to fly up to 10 feet without provoking opportunity attacks."
        },
        {
          "name": "Wind Speaker",
          "description": "The arcane magic you command is infused with elemental air. You can speak, read, and write Primordial. Knowing this language allows you to understand and be understood by those who speak its dialects: Primordial, Primordial, Primordial, and Primordial."
        },
        {
          "name": "Heart of the Storm",
          "description": "At 6th level, you gain resistance to lightning and thunder damage. In addition, whenever you start casting a spell of 1st level or higher that deals lightning or thunder damage, stormy magic erupts from you."
        },
        {
          "name": "Storm Guide",
          "description": "At 6th level, you gain the ability to subtly control the weather around you. If it is raining, you can use an action to cause the rain to stop falling in a 20-foot-radius sphere centered on you. You can end this effect as a bonus action. If it is windy, you can use a bonus action each round to choose the direction that the wind blows in a 100-foot-radius sphere centered on you."
        },
        {
          "name": "Storm's Fury",
          "description": "Starting at 14th level, when you are hit by a melee attack, you can use your reaction to deal lightning damage to the attacker. The damage equals your sorcerer level. The attacker must also make a Strength saving throw against your sorcerer spell save DC. On a failed save, the attacker is pushed in a straight line up to 20 feet away from you."
        },
        {
          "name": "Wind Soul",
          "description": "At 18th level, you gain immunity to lightning and thunder damage. You also gain a magical flying speed of 60 feet. As an action, you can reduce your flying speed to 30 feet for 1 hour and choose a number of creatures within 30 feet of you equal to 3 + your Charisma modifier. The chosen creatures gain a magical flying speed of 30 feet for 1 hour."
        }
      ],
      "levels": {
        "1": {
          "level": 1,
          "features": [
            "Storm Sorcery",
            "Tempestuous Magic",
            "Wind Speaker"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Storm Sorcery"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Heart of the Storm",
            "Storm Guide"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Storm's Fury"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Wind Soul"
          ]
        }
      }
    },
    {
      "name": "Aberrant Mind",
      "description": "An alien influence has wrapped its tendrils around your mind, giving you psionic power. You can now touch other minds with that power and alter the world around you by using it to control the magical energy of the multiverse.",
      "features": [
        {
          "name": "Aberrant Mind",
          "description": "An alien influence has wrapped its tendrils around your mind, giving you psionic power. You can now touch other minds with that power and alter the world around you by using it to control the magical energy of the multiverse."
        },
        {
          "name": "Psionic Spells",
          "description": "1st-level Aberrant Mind feature You learn additional spells when you reach certain levels in this class, as shown on the Psionic Spells table. Each of these spells counts as a sorcerer spell for you, but it doesn't count against the number of sorcerer spells you know. Whenever you gain a sorcerer level, you can replace one spell you gained from this feature with another spell of the same level."
        },
        {
          "name": "Telepathic Speech",
          "description": "1st-level Aberrant Mind feature You can form a telepathic connection between your mind and the mind of another. As a bonus action, choose one creature you can see within 30 feet of you. You and the chosen creature can speak telepathically with each other while the two of you are within a number of miles of each other equal to your Charisma modifier (minimum of 1 mile)."
        },
        {
          "name": "Psionic Sorcery",
          "description": "6th-level Aberrant Mind feature When you cast any spell of 1st level or higher from your Psionic Spells feature, you can cast it by expending a spell slot as normal or by spending a number of sorcery points equal to the spell's level."
        },
        {
          "name": "Psychic Defenses",
          "description": "6th-level Aberrant Mind feature You gain resistance to psychic damage, and you have advantage on saving throws against being charmed or frightened."
        },
        {
          "name": "Revelation in Flesh",
          "description": "14th-level Aberrant Mind feature You can unleash the aberrant truth hidden within yourself. As a bonus action, you can spend 1 or more sorcery points to magically transform your body for 10 minutes. For each sorcery point you spend, you can gain one of the following benefits of your choice, the effects of which last until the transformation ends: You can see any invisible creature within 60 fee..."
        },
        {
          "name": "Warping Implosion",
          "description": "18th-level Aberrant Mind feature You can unleash your aberrant power as a space-warping anomaly. As an action, you can teleport to an unoccupied space you can see within 120 feet of you. Immediately after you disappear, each creature within 30 feet of the space you left must make a Strength saving throw against your spell save DC."
        }
      ],
      "levels": {
        "1": {
          "level": 1,
          "features": [
            "Aberrant Mind",
            "Psionic Spells",
            "Telepathic Speech"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Aberrant Mind"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Psionic Sorcery",
            "Psychic Defenses"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Revelation in Flesh"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Warping Implosion"
          ]
        }
      }
    },
    {
      "name": "Clockwork Soul",
      "description": "The cosmic force of order has suffused you with magic. That power arises from Mechanus or a realm like it-a plane of existence shaped entirely by clockwork efficiency.",
      "features": [
        {
          "name": "Clockwork Soul",
          "description": "The cosmic force of order has suffused you with magic. That power arises from Mechanus or a realm like it-a plane of existence shaped entirely by clockwork efficiency. You, or someone from your lineage, might have become entangled in the machinations of the modrons, the orderly beings who inhabit Mechanus. Perhaps your ancestor even took part in the Great Modron March."
        },
        {
          "name": "Clockwork Magic",
          "description": "1st-level Clockwork Soul feature You learn additional spells when you reach certain levels in this class, as shown on the Clockwork Spells table. Each of these spells counts as a sorcerer spell for you, but it doesn't count against the number of sorcerer spells you know."
        },
        {
          "name": "Restore Balance",
          "description": "1st-level Clockwork Soul feature Your connection to the plane of absolute order allows you to equalize chaotic moments. When a creature you can see within 60 feet of you is about to roll a d20 with advantage or disadvantage, you can use your reaction to prevent the roll from being affected by advantage and disadvantage."
        },
        {
          "name": "Bastion of Law",
          "description": "6th-level Clockwork Soul feature You can tap into the grand equation of existence to imbue a creature with a shimmering shield of order. As an action, you can expend 1 to 5 sorcery points to create a magical ward around yourself or another creature you can see within 30 feet of you. The ward lasts until you finish a long rest or until you use this feature again."
        },
        {
          "name": "Trance of Order",
          "description": "14th-level Clockwork Soul feature You gain the ability to align your consciousness to the endless calculations of Mechanus. As a bonus action, you can enter this state for 1 minute. For the duration, attack rolls against you can't benefit from advantage, and whenever you make an attack roll, an ability check, or a saving throw, you can treat a roll of 9 or lower on the d20 as a 10."
        },
        {
          "name": "Clockwork Cavalcade",
          "description": "18th-level Clockwork Soul feature You summon spirits of order to expunge disorder around you. As an action, you summon the spirits in a 30-foot cube originating from you. The spirits look like modrons or other constructs of your choice."
        }
      ],
      "levels": {
        "1": {
          "level": 1,
          "features": [
            "Clockwork Soul",
            "Clockwork Magic",
            "Restore Balance"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Clockwork Soul"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Bastion of Law"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Trance of Order"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Clockwork Cavalcade"
          ]
        }
      }
    },
    {
      "name": "Lunar Sorcery",
      "description": "On many worlds, the moon is a revered celestial body with magical properties. On Krynn, the gods of magic are associated with the world's three moons. On the world of Toril, the god Selûne uses the light of the moon to battle darkness.",
      "features": [
        {
          "name": "Lunar Sorcery",
          "description": "On many worlds, the moon is a revered celestial body with magical properties. On Krynn, the gods of magic are associated with the world's three moons. On the world of Toril, the god Selûne uses the light of the moon to battle darkness. On Eberron, scholars of the Draconic Prophecy decipher ancient secrets from the waxing and waning of that world's twelve moons."
        },
        {
          "name": "Lunar Embodiment",
          "description": "1st-Level Lunar Sorcery Feature You learn additional spells when you reach certain levels in this class, as shown on the Lunar Spells table. Each of these spells counts as a sorcerer spell for you, but it doesn't count against the number of sorcerer spells you know."
        },
        {
          "name": "Moon Fire",
          "description": "1st-Level Lunar Sorcery Feature You can call down the radiant light of the moon on command. You learn the sacred flame spell, which doesn't count against the number of sorcerer cantrips you know. When you cast the spell, you can target one creature as normal or target two creatures within range that are within 5 feet of each other."
        },
        {
          "name": "Lunar Boons",
          "description": "6th-Level Lunar Sorcery Feature The current phase of your Lunar Embodiment can affect your Metamagic feature. Each Lunar Embodiment phase is associated with certain schools of magic, as shown here: Full Moon: Abjuration and divination spells New Moon: Enchantment and necromancy spells Crescent Moon: Illusion and transmutation spells Whenever you use Metamagic on a spell of a school of magic ass..."
        },
        {
          "name": "Waxing and Waning",
          "description": "6th-Level Lunar Sorcery Feature You gain greater control over the phases of your lunar magic. As a bonus action, you can spend 1 sorcery point to change your current Lunar Embodiment phase to a different one. You can now cast one 1st-level spell from each lunar phase of the Lunar Spells table once without expending a spell slot, provided your current phase is the same as the lunar phase spell."
        },
        {
          "name": "Lunar Empowerment",
          "description": "14th-Level Lunar Sorcery Feature The power of a lunar phase saturates your being. While you are in a Lunar Embodiment phase, you also gain the following benefit associated with that phase: Full Moon: You can use a bonus action to shed bright light in a 10-foot radius and dim light for an additional 10 feet or to douse the light."
        },
        {
          "name": "Lunar Phenomenon",
          "description": "18th-Level Lunar Sorcery feature As a bonus action, you can tap into a special power of your current Lunar Embodiment phase. Alternatively, as part of the bonus action you take to change your lunar phase using the Waxing and Waning feature, you can immediately use the power of the lunar phase you are entering: Full Moon: You radiate moonlight for a moment."
        }
      ],
      "levels": {
        "1": {
          "level": 1,
          "features": [
            "Lunar Sorcery",
            "Lunar Embodiment",
            "Moon Fire"
          ]
        },
        "3": {
          "level": 3,
          "features": [
            "Lunar Sorcery"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Lunar Boons",
            "Waxing and Waning"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Lunar Empowerment"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Lunar Phenomenon"
          ]
        }
      }
    },
    {
      "name": "Aberrant Sorcery",
      "description": "Wield Unnatural Psionic Power An alien influence has wrapped its tendrils around your mind, giving you psionic power. You can now touch other minds with that power and alter the world around you.",
      "features": [
        {
          "name": "Aberrant Sorcery",
          "description": "Wield Unnatural Psionic Power An alien influence has wrapped its tendrils around your mind, giving you psionic power. You can now touch other minds with that power and alter the world around you. Will this power shine from you as a hopeful beacon to others? Or will you be a terror to those who feel the stab of your mind? Perhaps a psychic wind from the Astral Plane carried psionic energy to you..."
        },
        {
          "name": "Psionic Spells",
          "description": "When you reach a Sorcerer level specified in the Psionic Spells table, you thereafter always have the listed spells prepared.",
          "spells": {
            "casting_ability": 5,
            "list": [
              {
                "name": "Mind Sliver",
                "level": 0,
                "description": "You try to temporarily sliver the mind of one creature you can see within range. The target must succeed on an Intelligence saving throw or take 1d6 Psychic damage and subtract 1d4 from the next saving throw it makes before the end of your next turn."
              },
              {
                "name": "Arms of Hadar",
                "level": 1,
                "description": "Invoking Hadar, you cause tendrils to erupt from yourself. Each creature in a 10-foot Emanation [Area of Effect] originating from you makes a Strength saving throw. On a failed save, a target takes 2d6 Necrotic damage and can't take Reactions until the start of its next turn."
              },
              {
                "name": "Dissonant Whispers",
                "level": 1,
                "description": "One creature of your choice that you can see within range hears a discordant melody in its mind. The target makes a Wisdom saving throw. On a failed save, it takes 3d6 Psychic damage and must immediately use its Reaction, if available, to move as far away from you as it can, using the safest route."
              },
              {
                "name": "Calm Emotions",
                "level": 2,
                "description": "Each Humanoid in a 20-foot-radius Sphere [Area of Effect] centered on a point you choose within range must succeed on a Charisma saving throw or be affected by one of the following effects (choose for each creature): The creature has Immunity to the Charmed and Frightened conditions until the spe..."
              },
              {
                "name": "Detect Thoughts",
                "level": 2,
                "description": "You activate one of the effects below. Until the spell ends, you can activate either effect as a Magic action on your later turns. Sense Thoughts: You sense the presence of thoughts within 30 feet of yourself that belong to creatures that know languages or are telepathic."
              },
              {
                "name": "Hunger of Hadar",
                "level": 3,
                "description": "You open a gateway to the Far Realm, a region infested with unspeakable horrors. A 20-foot-radius Sphere [Area of Effect] of Darkness appears, centered on a point within range and lasting for the duration."
              },
              {
                "name": "Sending",
                "level": 3,
                "description": "You send a short message of 25 words or fewer to a creature you have met or a creature described to you by someone who has met it. The target hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately."
              },
              {
                "name": "Evard's Black Tentacles",
                "level": 4,
                "description": "Squirming, ebony tentacles fill a 20-foot square on ground that you can see within range. For the duration, these tentacles turn the ground in that area into Difficult Terrain. Each creature in that area makes a Strength saving throw."
              },
              {
                "name": "Summon Aberration",
                "level": 4,
                "description": "You call forth an aberrant spirit. It manifests in an unoccupied space that you can see within range and uses the Aberrant Spirit stat block. When you cast the spell, choose Beholderkin, Mind Flayer, or Slaad."
              },
              {
                "name": "Rary's Telepathic Bond",
                "level": 5,
                "description": "You forge a telepathic link among up to eight willing creatures of your choice within range, psychically linking each creature to all the others for the duration. Creatures that can't communicate in any languages aren't affected by this spell."
              },
              {
                "name": "Telekinesis",
                "level": 5,
                "description": "You gain the ability to move or manipulate creatures or objects by thought. When you cast the spell and as a Magic action on your later turns before the spell ends, you can exert your will on one creature or object that you can see within range, causing the appropriate effect below."
              }
            ]
          }
        },
        {
          "name": "Telepathic Speech",
          "description": "You can form a telepathic connection between your mind and the mind of another. As a Bonus Action, choose one creature you can see within 30 feet of yourself. You and the chosen creature can communicate telepathically with each other while the two of you are within a number of miles of each other equal to your Charisma modifier (minimum of 1 mile)."
        },
        {
          "name": "Psionic Sorcery",
          "description": "When you cast any level 1+ spell from your Psionic Spells feature, you can cast it by expending a spell slot as normal or by spending a number of Sorcery Points equal to the spell's level. If you cast the spell using Sorcery Points, it requires no Verbal or Somatic components, and it requires no Material components unless they are consumed by the spell or have a cost specified in it."
        },
        {
          "name": "Psychic Defenses",
          "description": "You have Resistance to Psychic damage, and you have Advantage on saving throws to avoid or end the Charmed or Frightened condition."
        },
        {
          "name": "Revelation in Flesh",
          "description": "You can unleash the aberrant truth hidden within yourself. As a Bonus Action, you can spend 1 Sorcery Point or more to magically alter your body for 10 minutes. For each Sorcery Point you spend, you gain one of the following benefits of your choice, the effects of which last until the alteration ends."
        },
        {
          "name": "Warping Implosion",
          "description": "You can unleash a space-warping anomaly. As a Magic action, you teleport to an unoccupied space you can see within 120 feet of yourself. Immediately after you disappear, each creature within 30 feet of the space you left must make a Strength saving throw against your spell save DC."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Aberrant Sorcery",
            "Psionic Spells",
            "Telepathic Speech"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Psionic Sorcery",
            "Psychic Defenses"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Revelation in Flesh"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Warping Implosion"
          ]
        }
      }
    },
    {
      "name": "Clockwork Sorcery",
      "description": "Channel Cosmic Forces of Order The cosmic force of order has suffused you with magic. That power arises from Mechanus or a realm like it—a plane of existence shaped entirely by clockwork efficiency.",
      "features": [
        {
          "name": "Clockwork Sorcery",
          "description": "Channel Cosmic Forces of Order The cosmic force of order has suffused you with magic. That power arises from Mechanus or a realm like it—a plane of existence shaped entirely by clockwork efficiency. You or someone from your lineage might have become entangled in the machinations of modrons, the orderly beings who inhabit Mechanus. Perhaps your ancestor even took part in the Great Modron March."
        },
        {
          "name": "Clockwork Spells",
          "description": "When you reach a Sorcerer level specified in the Clockwork Spells table, you thereafter always have the listed spells prepared. In addition, consult the Manifestations of Order table and choose or randomly determine a way your connection to order manifests while you are casting any of your Sorcerer spells.",
          "spells": {
            "casting_ability": 5,
            "list": [
              {
                "name": "Alarm",
                "level": 1,
                "description": "You set an alarm against intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot Cube [Area of Effect]. Until the spell ends, an alarm alerts you whenever a creature touches or enters the warded area."
              },
              {
                "name": "Protection from Evil and Good",
                "level": 1,
                "description": "Until the spell ends, one willing creature you touch is protected against creatures that are Aberrations, Celestials, Elementals, Fey, Fiends, or Undead. The protection grants several benefits. Creatures of those types have Disadvantage on attack rolls against the target."
              },
              {
                "name": "Aid",
                "level": 2,
                "description": "Choose up to three creatures within range. Each target's Hit Points maximum and current Hit Points increase by 5 for the duration."
              },
              {
                "name": "Lesser Restoration",
                "level": 2,
                "description": "You touch a creature and end one condition on it: Blinded, Deafened, Paralyzed, or Poisoned."
              },
              {
                "name": "Dispel Magic",
                "level": 3,
                "description": "Choose one creature, object, or magical effect within range. Any ongoing spell of level 3 or lower on the target ends. For each ongoing spell of level 4 or higher on the target, make an ability check using your spellcasting ability (10 plus that spell's level). On a successful check, the spell ends."
              },
              {
                "name": "Protection from Energy",
                "level": 3,
                "description": "For the duration, the willing creature you touch has Resistance to one damage type of your choice: Acid, Cold, Fire, Lightning, or Thunder."
              },
              {
                "name": "Freedom of Movement",
                "level": 4,
                "description": "You touch a willing creature. For the duration, the target's movement is unaffected by Difficult Terrain, and spells and other magical effects can neither reduce the target's Speed nor cause the target to have the Paralyzed or Restrained conditions."
              },
              {
                "name": "Summon Construct",
                "level": 4,
                "description": "You call forth the spirit of a Construct. It manifests in an unoccupied space that you can see within range and uses the Construct Spirit stat block. When you cast the spell, choose a material: Clay, Metal, or Stone."
              },
              {
                "name": "Greater Restoration",
                "level": 5,
                "description": "You touch a creature and magically remove one of the following effects from it: 1 Exhaustion level The Charmed or Petrified condition A curse, including the target's Attunement to a cursed magic item Any reduction to one of the target's ability scores Any reduction to the target's Hit Points maximum"
              },
              {
                "name": "Wall of Force",
                "level": 5,
                "description": "An Invisible wall of force springs into existence at a point you choose within range. The wall appears in any orientation you choose, as a horizontal or vertical barrier or at an angle. It can be free floating or resting on a solid surface."
              }
            ]
          }
        },
        {
          "name": "Restore Balance",
          "description": "Your connection to the plane of absolute order allows you to equalize chaotic moments. When a creature you can see within 60 feet of yourself is about to roll a d20 with Advantage or Disadvantage, you can take a Reaction to prevent the roll from being affected by Advantage and Disadvantage."
        },
        {
          "name": "Bastion of Law",
          "description": "You can tap into the grand equation of existence to imbue a creature with a shimmering shield of order. As a Magic action, you can expend 1 to 5 Sorcery Points to create a magical ward around yourself or another creature you can see within 30 feet of yourself. The ward is represented by a number of d8s equal to the number of Sorcery Points spent to create it."
        },
        {
          "name": "Trance of Order",
          "description": "You gain the ability to align your consciousness with the endless calculations of Mechanus. As a Bonus Action, you can enter this state for 1 minute. For the duration, attack rolls against you can't benefit from Advantage, and whenever you make a D20 Test, you can treat a roll of 9 or lower on the d20 as a 10."
        },
        {
          "name": "Clockwork Cavalcade",
          "description": "You momentarily summon spirits of order to expunge disorder around you. As a Magic action, you summon the spirits in a 30-foot Cube [Area of Effect] originating from you. The spirits look like modrons or other Constructs of your choice. The spirits are intangible and invulnerable, and they create the effects below within the Cube [Area of Effect] before vanishing."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Clockwork Sorcery",
            "Clockwork Spells",
            "Restore Balance"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Bastion of Law"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Trance of Order"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Clockwork Cavalcade"
          ]
        }
      }
    },
    {
      "name": "Draconic Sorcery",
      "description": "Breathe the Magic of Dragons Your innate magic comes from the gift of a dragon. Perhaps an ancient dragon facing death bequeathed some of its magical power to you or your ancestor. You might have absorbed magic from a site infused with dragons' power.",
      "features": [
        {
          "name": "Draconic Sorcery",
          "description": "Breathe the Magic of Dragons Your innate magic comes from the gift of a dragon. Perhaps an ancient dragon facing death bequeathed some of its magical power to you or your ancestor. You might have absorbed magic from a site infused with dragons' power. Or perhaps you handled a treasure taken from a dragon's hoard that was steeped in draconic power. Or you might have a dragon for an ancestor."
        },
        {
          "name": "Draconic Spells",
          "description": "When you reach a Sorcerer level specified in the Draconic Spells table, you thereafter always have the listed spells prepared.",
          "spells": {
            "casting_ability": 5,
            "list": [
              {
                "name": "Chromatic Orb",
                "level": 1,
                "description": "You hurl an orb of energy at a target within range. Choose Acid, Cold, Fire, Lightning, Poison, or Thunder for the type of orb you create, and then make a ranged spell attack against the target. On a hit, the target takes 3d8 damage of the chosen type."
              },
              {
                "name": "Command",
                "level": 1,
                "description": "You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn."
              },
              {
                "name": "Alter Self",
                "level": 2,
                "description": "You alter your physical form. Choose one of the following options. Its effects last for the duration, during which you can take a Magic action to replace the option you chose with a different one. Aquatic Adaptation: You sprout gills and grow webs between your fingers."
              },
              {
                "name": "Dragon's Breath",
                "level": 2,
                "description": "You touch one willing creature, and choose Acid, Cold, Fire, Lightning, or Poison. Until the spell ends, the target can take a Magic action to exhale a 15-foot Cone [Area of Effect]."
              },
              {
                "name": "Fear",
                "level": 3,
                "description": "Each creature in a 30-foot Cone [Area of Effect] must succeed on a Wisdom saving throw or drop whatever it is holding and have the Frightened condition for the duration."
              },
              {
                "name": "Fly",
                "level": 3,
                "description": "You touch a willing creature. For the duration, the target gains a Fly Speed of 60 feet and can hover. When the spell ends, the target falls if it is still aloft unless it can stop the fall."
              },
              {
                "name": "Arcane Eye",
                "level": 4,
                "description": "You create an Invisible, invulnerable eye within range that hovers for the duration. You mentally receive visual information from the eye, which can see in every direction. It also has Darkvision with a range of 30 feet. As a Bonus Action, you can move the eye up to 30 feet in any direction."
              },
              {
                "name": "Charm Monster",
                "level": 4,
                "description": "One creature you can see within range makes a Wisdom saving throw. It does so with Advantage if you or your allies are fighting it. On a failed save, the target has the Charmed condition until the spell ends or until you or your allies damage it. The Charmed creature is Friendly [Attitude] to you."
              },
              {
                "name": "Legend Lore",
                "level": 5,
                "description": "Name or describe a famous person, place, or object. The spell brings to your mind a brief summary of the significant lore about that famous thing, as described by the DM. The lore might consist of important details, amusing revelations, or even secret lore that has never been widely known."
              },
              {
                "name": "Summon Dragon",
                "level": 5,
                "description": "You call forth a Dragon spirit. It manifests in an unoccupied space that you can see within range and uses the Draconic Spirit stat block. The creature disappears when it drops to 0 Hit Points or when the spell ends. The creature is an ally to you and your allies."
              }
            ]
          }
        },
        {
          "name": "Draconic Resilience",
          "description": "The magic in your body manifests physical traits of your draconic gift. Your Hit Points maximum increases by 3, and it increases by 1 whenever you gain another Sorcerer level. Parts of you are also covered by dragon-like scales. While you aren't wearing armor, your base Armor Class equals 10 plus your Dexterity and Charisma modifiers."
        },
        {
          "name": "Elemental Affinity",
          "description": "Your draconic magic has an affinity with a damage type associated with dragons. Choose one of those types: Acid, Cold, Fire, Lightning, or Poison. You have Resistance to that damage type, and when you cast a spell that deals damage of that type, you can add your Charisma modifier to one damage roll of that spell."
        },
        {
          "name": "Dragon Wings",
          "description": "As a Bonus Action, you can cause draconic wings to appear on your back. The wings last for 1 hour or until you dismiss them (no action required). For the duration, you have a Fly Speed of 60 feet. Once you use this feature, you can't use it again until you finish a Long Rest unless you spend 3 Sorcery Points (no action required) to restore your use of it."
        },
        {
          "name": "Dragon Companion",
          "description": "You can cast Summon Dragon without a Material component. You can also cast it once without a spell slot, and you regain the ability to cast it in this way when you finish a Long Rest. Whenever you start casting the spell, you can modify it so that it doesn't require Concentration. If you do so, the spell's duration becomes 1 minute for that casting."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Draconic Sorcery",
            "Draconic Spells",
            "Draconic Resilience"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Elemental Affinity"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Dragon Wings"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Dragon Companion"
          ]
        }
      }
    },
    {
      "name": "Wild Magic Sorcery",
      "description": "Unleash Chaotic Magic Your innate magic stems from the forces of chaos that underlie the order of creation. You or an ancestor might have endured exposure to raw magic, perhaps through a planar portal leading to Limbo or the Elemental Planes.",
      "features": [
        {
          "name": "Wild Magic Sorcery",
          "description": "Unleash Chaotic Magic Your innate magic stems from the forces of chaos that underlie the order of creation. You or an ancestor might have endured exposure to raw magic, perhaps through a planar portal leading to Limbo or the Elemental Planes. Perhaps you were blessed by a fey being or marked by a demon. Or your magic could be a fluke with no apparent cause."
        },
        {
          "name": "Tides of Chaos",
          "description": "You can manipulate chaos itself to give yourself Advantage on one D20 Test before you roll the d20. Once you do so, you must cast a Sorcerer spell with a spell slot or finish a Long Rest before you can use this feature again. If you do cast a Sorcerer spell with a spell slot before you finish a Long Rest, you automatically roll on the Wild Magic Surge table."
        },
        {
          "name": "Wild Magic Surge",
          "description": "Your spellcasting can unleash surges of untamed magic. Once per turn, you can roll 1d20 immediately after you cast a Sorcerer spell with a spell slot. If you roll a 20, roll on the Wild Magic Surge table to create a magical effect. If the magical effect is a spell, it is too wild to be affected by your Metamagic."
        },
        {
          "name": "Bend Luck",
          "description": "You have the ability to twist fate using your wild magic. Immediately after another creature you can see rolls the d20 for a D20 Test, you can take a Reaction and spend 1 Sorcery Point to roll 1d4 and apply the number rolled as a bonus or penalty (your choice) to the d20 roll."
        },
        {
          "name": "Controlled Chaos",
          "description": "You gain a modicum of control over the surges of your wild magic. Whenever you roll on the Wild Magic Surge table, you can roll twice and use either number."
        },
        {
          "name": "Tamed Surge",
          "description": "Immediately after you cast a Sorcerer spell with a spell slot, you can create an effect of your choice from the Wild Magic Surge table instead of rolling on that table. You can choose any effect in the table except for the final row, and if the chosen effect involves a roll, you must make it. Once you use this feature, you can't do so again until you finish a Long Rest."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Wild Magic Sorcery",
            "Tides of Chaos",
            "Wild Magic Surge"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Bend Luck"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Controlled Chaos"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Tamed Surge"
          ]
        }
      }
    },
    {
      "name": "Spellfire Sorcery",
      "description": "You or one creature you can see within 30 feet of yourself gains Temporary Hit Points equal to 1d4 plus your Charisma modifier.",
      "features": [
        {
          "name": "Bolstering Flames",
          "description": "You or one creature you can see within 30 feet of yourself gains Temporary Hit Points equal to 1d4 plus your Charisma modifier."
        },
        {
          "name": "Radiant Fire",
          "description": "One creature you can see within 30 feet of yourself takes 1d4 Fire or Radiant damage (your choice)."
        },
        {
          "name": "Spellfire Burst",
          "description": "When you spend at least 1 Sorcery Point as part of the Magic action or a Bonus Action on your turn, you can unleash one of the following magical effects of your choice. You can do so only once per turn."
        },
        {
          "name": "Spellfire Sorcery",
          "description": "Wield Raw Magic Your innate power stems from the source of magic itself: the Weave. This connection manifests as a rare ability known as spellfire, and you surge with radiant bursts of this raw magic. Your talent with spellfire allows you to heal allies, sear enemies, and absorb powerful spells. Wielders of spellfire tend to have a penchant for wandering."
        },
        {
          "name": "Spellfire Spells",
          "description": "When you reach a Sorcerer level specified in the Spellfire Spells table, you thereafter always have the listed spells prepared.",
          "spells": {
            "casting_ability": 5,
            "list": [
              {
                "name": "Cure Wounds",
                "level": 1,
                "description": "A creature you touch regains a number of Hit Points equal to 2d8 plus your spellcasting ability modifier."
              },
              {
                "name": "Guiding Bolt",
                "level": 1,
                "description": "You hurl a bolt of light toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 4d6 Radiant damage, and the next attack roll made against it before the end of your next turn has Advantage."
              },
              {
                "name": "Lesser Restoration",
                "level": 2,
                "description": "You touch a creature and end one condition on it: Blinded, Deafened, Paralyzed, or Poisoned."
              },
              {
                "name": "Scorching Ray",
                "level": 2,
                "description": "You hurl three fiery rays. You can hurl them at one target within range or at several. Make a ranged spell attack for each ray. On a hit, the target takes 2d6 Fire damage."
              },
              {
                "name": "Aura of Vitality",
                "level": 3,
                "description": "An aura radiates from you in a 30-foot Emanation [Area of Effect] for the duration. When you create the aura and at the start of each of your turns while it persists, you can restore 2d6 Hit Points to one creature in it."
              },
              {
                "name": "Counterspell",
                "level": 3,
                "description": "You attempt to interrupt a creature in the process of casting a spell. The creature makes a Constitution saving throw. On a failed save, the spell dissipates with no effect, and the action, Bonus Action, or Reaction used to cast it is wasted."
              },
              {
                "name": "Dispel Magic",
                "level": 3,
                "description": "Choose one creature, object, or magical effect within range. Any ongoing spell of level 3 or lower on the target ends. For each ongoing spell of level 4 or higher on the target, make an ability check using your spellcasting ability (10 plus that spell's level). On a successful check, the spell ends."
              },
              {
                "name": "Fire Shield",
                "level": 4,
                "description": "Wispy flames wreathe your body for the duration, shedding Bright Light in a 10-foot radius and Dim Light for an additional 10 feet. The flames provide you with a warm shield or a chill shield, as you choose."
              },
              {
                "name": "Wall of Fire",
                "level": 4,
                "description": "You create a wall of fire on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for the duration."
              },
              {
                "name": "Flame Strike",
                "level": 5,
                "description": "A vertical column of brilliant fire roars down from above. Each creature in a 10-foot-radius, 40-foot-high Cylinder [Area of Effect] centered on a point within range makes a Dexterity saving throw, taking 5d6 Fire damage and 5d6 Radiant damage on a failed save or half as much damage on a successf..."
              },
              {
                "name": "Greater Restoration",
                "level": 5,
                "description": "You touch a creature and magically remove one of the following effects from it: 1 Exhaustion level The Charmed or Petrified condition A curse, including the target's Attunement to a cursed magic item Any reduction to one of the target's ability scores Any reduction to the target's Hit Points maximum"
              }
            ]
          }
        },
        {
          "name": "Absorb Spells",
          "description": "You always have Counterspell prepared. Additionally, whenever a target fails the saving throw against a Counterspell you cast, you regain 1d4 Sorcery Points."
        },
        {
          "name": "Honed Spellfire",
          "description": "Your Spellfire Burst improves. You add your Sorcerer level to the Temporary Hit Points gained from Bolstering Flames, and the damage of Radiant Fire increases to 1d8."
        },
        {
          "name": "Crown of Spellfire",
          "description": "When you use Innate Sorcery, you can alter it and infuse yourself with the essence of spellfire, gaining the following benefits while this use of Innate Sorcery is active. Once you use this feature to alter Innate Sorcery, you can't use it again until you finish a Long Rest unless you spend 5 Sorcery Points (no action required) to restore your use of it."
        }
      ],
      "levels": {
        "3": {
          "level": 3,
          "features": [
            "Bolstering Flames",
            "Radiant Fire",
            "Spellfire Burst",
            "Spellfire Sorcery",
            "Spellfire Spells"
          ]
        },
        "6": {
          "level": 6,
          "features": [
            "Absorb Spells"
          ]
        },
        "14": {
          "level": 14,
          "features": [
            "Honed Spellfire"
          ]
        },
        "18": {
          "level": 18,
          "features": [
            "Crown of Spellfire"
          ]
        }
      }
    }
  ]
}
